{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>It&#x2019;s easy to drop&#xA0;recently-taken photos and videos into your <a href=\"http://9to5mac.com/tag/facebook-messenger/\" target=\"_blank\">Facebook Messenger</a> chats directly from the camera roll, but it was less easy to share <a href=\"http://9to5mac.com/tag/dropbox/\" target=\"_blank\">Dropbox</a> files. This previously required you to open the Dropbox app first to grab a link to share.</p>\n\n<p>The latest update to the iOS Facebook Messenger app streamlines the process by allowing you to drop any file into a chat just by tapping the &#x2018;&#x2026;&#x2019; button.</p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">Videos and images&#x2014;including animated GIFs&#x2014;will be displayed directly in your chats. For everything else, tapping Open will bring recipients to the Dropbox mobile app, where they can preview and save files. It&#x2019;s a quick, simple way to share vacation snapshots, home movies, and laugh-worthy memes with any of the 900 million people using Messenger.</span></p>\n</blockquote>\n<p>The update, announced&#xA0;in a <a href=\"https://blogs.dropbox.com/dropbox/2016/04/dropbox-facebook-messenger-sharing/\" target=\"_blank\">blog post</a>, is one of a number of steps the company is taking to add functionality to the chat app. Facebook last year added <a href=\"http://9to5mac.com/2015/11/09/facebook-messenger-photo-magic-scans-friends/\" target=\"_blank\">automatic prompting</a> to share photos of friends, along with the ability to request&#xA0;<a href=\"http://9to5mac.com/2015/12/16/facebook-messenger-uber-3d-touch/\" target=\"_blank\">an Uber car</a> from within a chat.</p>\n<p>Code found within the app suggests that Facebook also intends to allow <a href=\"http://9to5mac.com/2016/03/29/facebook-messenger-monetization-plan-features/\" target=\"_blank\">person-to-person payments</a> from within Messenger.</p>\n<p>Facebook Messenger is a <a href=\"https://geo.itunes.apple.com/us/app/messenger/id454638411?mt=8&amp;at=11lqLQ\" target=\"_blank\">free download from iTunes</a>. If you already have it installed, the update should roll out automatically over the next few days, but&#xA0;can also be manually updated from the App Store. Additionally, quitting and restarting the app often triggers&#xA0;an update.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/12/facebook-messenger-dropbox/", "short_url": "http://rdd.me/lxie1i3w", "title": "Facebook Messenger iOS app now lets you share Dropbox files from within the app", "excerpt": "It&#x2019;s easy to drop&#xA0;recently-taken photos and videos into your Facebook Messenger chats directly from the camera roll, but it was less easy to share Dropbox files. This previously required&hellip;", "direction": "ltr", "word_count": 230, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-12 11:11:20"}