{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>In a sea of powerful, feature-packed, and well supported <a href=\"http://9to5google.com/2016/02/04/top-5-twitter-android-apps/\">third party clients</a>, the official <a href=\"http://9to5google.com/tag/twitter\">Twitter</a> app has generally never stood out as a particularly good choice for enjoying the social network&#x2019;s experience.</p>\n<p>One of the main gripes some users have had over the years is in regards to design; given the service&#x2019;s popularity, it was odd to see its stock <a href=\"http://9to5google.com/tag/android\">Android</a> app maintain a fairly anonymous &#x2014; and not particularly brilliant &#x2014; UI, markedly in dissonance with the platform&#x2019;s guidelines.&#xA0;However, the San Francisco-based company may have been hard at work to fix that&#x2026;</p>\n\n<p>User&#xA0;Hern&#xE1;n Casta&#xF1;&#xF3;n &#xC1;lvarez, a developer of the famous <a href=\"http://9to5google.com/tag/xda\">XDA</a> community, uploaded a video today on <a href=\"http://9to5google.com/tag/youtube\">YouTube</a> showing what likely seems to be an early build of the app whose UI is markedly based on <a href=\"http://9to5google.com/tag/material-design\">Material Design</a>. For instance, we can clearly see how&#xA0;the app uses tabs at the top once again &#x2014; properly, this time &#x2014; as well as the implementation&#xA0;of a Floating Action Button as opposed to the bottom action bar employed&#xA0;now.</p>\n<p>While there doesn&#x2019;t seem to be a huge number of animations across the board, screens now slide vertically, and the old toggles (reminiscent of <a href=\"http://9to5google.com/tag/ios\">iOS</a>) are all but gone, which is indeed a welcome change. The 47-second long video does not show much else, and there is no official word whether this build is only being tested internally or if we can&#xA0;expect a wider launch sooner than we think.</p>\n<p>We certainly hope so. In the meantime, you can check the video below yourself.</p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/a_afMbdV2JA?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Edoardo Maggio", "url": "http://9to5google.com/2016/04/11/material-design-twitter-app-android/", "short_url": "http://rdd.me/auqupdby", "title": "Early build of Twitter for Android with Material Design interface spotted", "excerpt": "In a sea of powerful, feature-packed, and well supported third party clients, the official Twitter app has generally never stood out as a particularly good choice for enjoying the social&hellip;", "direction": "ltr", "word_count": 248, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 22:50:30"}