{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>After first <a href=\"http://9to5google.com/2015/05/06/google-io-2015-expectations/\">planning to launch the app during Google I/O 2015</a> and changing its mind at the last minute, Google has finally launched <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.accessibility.voiceaccess\">Voice Access</a> in beta, a new accessibility app that allows users to control their phone using their voice. With Voice Access, you can use a wide variety of voice commands like &#x201C;open Chrome&#x201D; to bring up the browser or &#x201C;go home&#x201D; to go to the home screen&#x2026;</p>\n\n<p>The app is not unlike many other accessibility apps of its kind. With the app installed there is a set of commands that can be used from anywhere on the device, but Voice Access also overlays many numbers atop elements of the screen so that you can precisely accomplish whatever you need to without worrying about the app mishearing you. As you can see above, you can just say &#x201C;8&#x201D; if you want to launch the YouTube app.</p>\n<p>The launch was <a href=\"https://googleblog.blogspot.com/2016/04/building-more-accessible-technology.html\">mentioned</a> alongside other accessibility features Google highlighted on its blog:</p>\n<blockquote><p>We recently launched Voice Access Beta, an app that allows people who have difficulty manipulating a touch screen due to paralysis, tremor, temporary injury or other reasons to control their Android devices by voice. For example, you can say &#x201C;open Chrome&#x201D; or &#x201C;go home&#x201D; to navigate around the phone, or interact with the screen by saying &#x201C;click next&#x201D; or &#x201C;scroll down.&#x201D;</p></blockquote>\n<p>To download the app in beta, Google suggests that you follow the instructions at&#xA0;<a href=\"https://g.co/voiceaccess\">http://g.co/voiceaccess</a>. You&#x2019;ll need to enroll in the&#xA0;testing program for the unreleased version of the&#xA0;app, after which you&#x2019;ll be able to download it <a href=\"https://play.google.com/store/apps/details?id=com.google.android.apps.accessibility.voiceaccess&amp;ah=qsnAcW0gzWGW8y-TrcdmZp7f5HQ\">from the Play Store here</a> for free.</p>\n<p>In other recent accessibility news,&#xA0;<a href=\"http://9to5google.com/2016/03/24/google-accessibility-scanner/\">Google launched an easy to use &#x2018;Accessibility Scanner&#x2019; for Android that analyzes apps for accessibility&#xA0;issues</a>, and the company announced that you can now&#xA0;<a href=\"http://9to5google.com/2016/02/24/google-docs-voice-edit-format/\">use your voice to edit &amp; format in Google Docs with a series of new voice&#xA0;commands</a>.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Stephen Hall", "url": "http://9to5google.com/2016/04/11/google-new-voice-access-app/", "short_url": "http://rdd.me/d1h6nga4", "title": "Google launches ‘Voice Access’ app in beta, lets you control your phone with your voice", "excerpt": "After first planning to launch the app during Google I/O 2015 and changing its mind at the last minute, Google has finally launched Voice Access in beta, a new accessibility app that allows users to&hellip;", "direction": "ltr", "word_count": 305, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 19:23:17"}