{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p class=\"p1\"><span class=\"s1\">The major US record labels are still unhappy with the current state of their deals for YouTube royalties, leading the industry&#x2019;s trade group to file a complaint as contracts with the streaming service are set to expire this year. Recode <a href=\"http://recode.net/2016/04/11/youtube-google-dmca-riaa-cary-sherman/\" target=\"_blank\">spoke with</a> head of the Recording Industry Association of America (RIAA) Cary Sherman who represents the labels and explained why the music industry thinks the deals and negotiations with YouTube are unfair and hurting the industry and artists.</span></p>\n\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">We accept the inevitability of death. It doesn&#x2019;t mean we have to like it. There is now under way a study of whether the DMCA is actually effective and fulfilling its intended purpose, being conducted by the Copyright Office, and it has given us an opportunity for the community to collect our thoughts about just how dysfunctional the DMCA actually is. And to actually tell the government about it.</span></p>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">Sherman goes on to describe how negotiations with YouTube have played out in recent years, noting that labels are forced to either accept the deals YouTube offers or fight a losing battle trying to combat content uploaded to the service using take down notices. </span></p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">The way the negotiation goes is something like this: &#x201C;Look. This is all we can afford to pay you,&#x201D; YouTube says. &#x201C;We hope that you&#x2019;ll find that reasonable. But that&#x2019;s the best we can do. And if you don&#x2019;t want to give us a license, okay. You know that your music is still going to be up on the service anyway. So send us notices, and we&#x2019;ll take &#x2019;em down as fast we can, and we know they&#x2019;ll keep coming back up. We&#x2019;ll do what we can. It&#x2019;s your decision as to whether you want to take our deal, or whether you just want to keep sending us takedown notices.&#x201D;&#x2026; That&#x2019;s not a real negotiation. That&#x2019;s like saying, &#x201C;That&#x2019;s a real nice song you got there. Be a shame if anything happened to it.&#x201D;</span></p>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">Google/YouTube didn&#x2019;t respond directly to the comments from the RIAA, but Recode points to the following response from the company related to the investigation with the US Copyright Office that Sherman mentioned in the interview:</span></p>\n<blockquote>\n<p class=\"p1\">Some in the recording industry have suggested that the safe harbors somehow diminish the value of sound recordings, pointing to YouTube and blaming the DMCA for creating a so-called &#x201C;<a href=\"http://recode.net/2016/03/22/streaming-is-officially-the-biggest-part-of-the-music-business-which-want-youtube-to-pay-up/\">value grab</a>.&#x201D; This claim is not supported by the facts. As an initial matter, it is important to understand that YouTube has had license agreements in place with both major and independent record labels for many years; it is simply incorrect to say that YouTube relies on the DMCA instead of licensing works. Those pressing the &#x201C;value grab&#x201D; argument also assert that the royalty rates in these licenses are too low, allegedly because the DMCA&#x2019;s notice-and-takedown process makes it too difficult for record labels to withdraw their works from YouTube in the face of users re-uploading those works. This claim, however, ignores Content ID, which has been in existence since 2008 and which record labels (and many other copyright owners) use every day to monetize their works on YouTube. Thanks to Content ID, record labels do not have to rely solely on the DMCA&#x2019;s notice-and-takedown process on YouTube&#x2014;they can remove any or all user-uploads of their works from the platform on an automated and ongoing basis. Indeed, since January 2014, over 98% of all YouTube copyright removal claims have come through Content ID. Although business partners can be expected to disagree from time to time about the price of a license, any claim that the DMCA safe harbors are responsible for a &#x201C;value gap&#x201D; for music on YouTube is simply false.</p>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">You can read the full interview with the RIAA&#x2019;s Cary Sherman <a href=\"http://recode.net/2016/04/11/youtube-google-dmca-riaa-cary-sherman/\"><span class=\"s2\">here</span></a>.&#xA0;</span></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Jordan Kahn", "url": "http://9to5google.com/2016/04/11/record-labels-youtube-riaa-royalities-complaint/", "short_url": "http://rdd.me/7mmftxvi", "title": "Major record labels again complain of unfair YouTube deals as contracts set to expire", "excerpt": "The major US record labels are still unhappy with the current state of their deals for YouTube royalties, leading the industry&#x2019;s trade group to file a complaint as contracts with the streaming&hellip;", "direction": "ltr", "word_count": 621, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 16:20:57"}