{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>As <a href=\"http://9to5google.com/2016/04/05/lg-g5-se-trademark/\">we told you last week</a>,&#xA0;LG recently registered a trademark for &#x201C;G5 SE,&#x201D; a decidedly coincidental &#x2014; or perhaps not-so-coincidental &#x2014; filing considering the recently-launched <a href=\"http://9to5mac.com/tag/iphone-se\">iPhone SE</a>. Now, <em>MobileFun</em> has <a href=\"http://www.mobilefun.co.uk/blog/2016/04/the-lg-g5-se-a-smaller-g5-apparently-not/\">gotten its hands</a> on a shipment of QuickCover cases for the LG G5, which are apparently compatible with the unannounced LG G5 SE as well.</p>\n<p>If the cases are compatible with both the SE version and the standard G5, that would throw out the theory that LG is simply planning to call this year&#x2019;s smaller G5 variant the &#x201C;SE&#x201D; version, and would mean that perhaps LG is less guilty of copying the Cupertino company than we thought&#x2026;</p>\n\n<p>Korean site Kipris originally revealed the new trademark, and we found&#xA0;at least four separate versions of G5 SE that were applied for by LG CORP and/or LG Electronics Inc. &#x2014; some of which came eight days after Apple announced the iPhone SE on March 21st. However, one&#xA0;G5 SE trademark&#xA0;was applied for on&#xA0;<a target=\"_blank\">February 19th</a>, and an even earlier one is dated December 30th, 2015.</p>\n<p>While the obvious initial reaction would be to think that LG is simply copying Apple&#x2019;s branding, this case packaging is even more evidence that this might just be a coincidence. Of course it&#x2019;s possible that the company had information we didn&#x2019;t, but LG registered the name before the &#x2018;iPhone 5SE&#x2019; was first mentioned by us on&#xA0;<a href=\"http://9to5mac.com/2016/01/22/apple-readies-iphone-5se-not-6c-for-marchapril-with-curved-edges-live-photos/\" target=\"_blank\">January 22nd</a>. And this case suggests that the phone isn&#x2019;t even going to be the smaller version of the G5 we thought it might be.</p>\n<p>So that leaves the question: If the G5 SE is the same size as the G5, what is it? The first, and most likely, thought that comes to mind is that the G5 SE might just be a mid-range&#xA0;version of the G5 with lesser specs but the same form factor. Knowing that LG&#x2019;s modular design wouldn&#x2019;t exactly be the easiest thing to reengineer to a smaller form factor, it might make sense that the company is just going to repackage the phone with the same screen size.</p>\n<p><a href=\"https://9to5google.files.wordpress.com/2016/04/screenshot-2016-02-15-at-2-17-01-pm-e1455574688913.png\" rel=\"attachment wp-att-138259\"><img title=\"LG G5 QuickCover packaging confirms existence of a likely lesser-specced 'G5 SE'\" class=\"alignleft size-large wp-image-138259\" src=\"https://9to5google.files.wordpress.com/2016/04/screenshot-2016-02-15-at-2-17-01-pm-e1455574688913.png?w=1000&amp;h=501\" alt=\"screenshot-2016-02-15-at-2-17-01-pm-e1455574688913\" width=\"1000\"></a></p>\n<p>We reported just a couple of weeks ago about an &#x201C;LG G5 Lite&#x201D; that seems to have the same form factor as the standard G5. That phone&#xA0;downgrades to a Snapdragon 652 from a Snapdragon 820 and only has 3GB of RAM from 4GB. While the 652 is a solid octa-core processor,&#xA0;the GPU drops from a Adreno 530 to a 510.&#xA0;These specs line up with <a href=\"http://9to5google.com/2016/02/15/lg-g5-lite-benchmarks/\">leaked benchmarks</a> from February.</p>\n<p>Theoretically, this phone could be made of cheaper materials (all-plastic, anyone?) as well, all while maintaining the benefits of having a phone with a &#xA0;swappable battery. With cases already shipping that sport the G5 SE branding, it&#x2019;s probably only a matter of the company clicking &#x201C;publish&#x201D; on a press release. Regardless of what the phone turns out to be and how guilty LG is of copying Apple, the LG G5 SE seems all but official. It&#x2019;s not clear yet which regions will get the phone.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Stephen Hall", "url": "http://9to5google.com/2016/04/11/lg-g5-quickcover-packaging-confirms-existence-of-a-likely-lesser-specced-g5-se/", "short_url": "http://rdd.me/tgt7r1rd", "title": "LG G5 QuickCover packaging confirms existence of a likely lesser-specced ‘G5 SE’", "excerpt": "As we told you last week,&#xA0;LG recently registered a trademark for &#x201C;G5 SE,&#x201D; a decidedly coincidental &#x2014; or perhaps not-so-coincidental &#x2014; filing considering the&hellip;", "direction": "ltr", "word_count": 489, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5google.files.wordpress.com/2016/04/screenshot-2016-02-15-at-2-17-01-pm-e1455574688913.png?w=1000&h=501", "rendered_pages": 1, "date_published": "2016-04-11 16:29:17"}