{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>When the LG G5 <a href=\"http://9to5google.com/2016/02/21/lg-g5-official/\" target=\"_blank\">launched at MWC</a> in February, the Korean tech giant also unveiled a series of &#x2018;friends&#x2019;, or modules. These clip-on modules were designed to <a href=\"http://9to5google.com/2016/02/22/lg-g5-hands-on-video/\" target=\"_blank\">offer a unique experience</a> of one kind or another. Whether you wanted a more traditional camera experience, better audio or VR, LG had the answer. One of the most promising &#x2018;friends&#x2019; was the Hi-Fi Plus DAC unit, built through&#xA0;collaboration with B&amp;O. It offered much better quality audio.</p>\n<p>If you&#x2019;re in the US, however, it looks as though you might not even get the opportunity to order one&#x2026;</p>\n\n<p>Spotted by <em><a href=\"http://www.androidauthority.com/lg-hi-fi-plus-dac-module-availability-685502/\" target=\"_blank\">Android Authority</a></em>, LG&#x2019;s bespoke <a href=\"http://www.lg.com/us/lg-friends\" target=\"_blank\">&#x2018;Friends&#x2019; US page</a> and the <a href=\"http://www.lg.com/us/mobile-phones/g5#G5Modularity\" target=\"_blank\">LG G5 overview page</a> no longer reference the Hi-Fi Plus unit. As you can see in the header image, it&#x2019;s no longer in the product lineup. Compare that to the <a href=\"http://www.lg.com/uk/lg-friends\" target=\"_blank\">UK page</a>, where the Hi-Fi Plus is given second billing, next to the Tone Platinum headphones and CAM Plus.</p>\n<p>In response to the discovery, LG simply stated that it has &#x2018;nothing to share&#x2019; on release schedules for the DAC unit, and that it would follow up once it does.&#xA0;What&#x2019;s more, Korea, Canada and Puerto Rico markets will also be missing out on the module targeted at audiophiles.</p>\n<p>While this doesn&#x2019;t explicitly mean that the Hi-Fi Plus will never be available in the US, it doesn&#x2019;t look good. If the B&amp;O module was of high importance to the US market, LG would have presumably put every effort in to ensuring it was available right from the off.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/11/lg-g5-hi-hi-plus-dac-us-availability/", "short_url": "http://rdd.me/racdukpk", "title": "Bad news audio fans, looks like LG G5’s B&O; Hi-Fi Plus module won’t be available in the US", "excerpt": "When the LG G5 launched at MWC in February, the Korean tech giant also unveiled a series of &#x2018;friends&#x2019;, or modules. These clip-on modules were designed to offer a unique experience of&hellip;", "direction": "ltr", "word_count": 250, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 13:13:58"}