{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Apple is reportedly working with Chinese server vendor Inspur as it seeks to bring the infrastructure for its cloud services in-house.</p>\n<p>Apple&#xA0;currently relies on third-party companies to host its cloud content, most of the capacity currently provided by Microsoft and Amazon Web Services, with&#xA0;Google also&#xA0;<a href=\"http://9to5mac.com/2016/03/16/apple-icloud-google-cloud-platform/\" target=\"_blank\">recently joining</a> the roster. However, the company is said to be working on developing its own data network and infrastructure in a project <a href=\"http://9to5mac.com/2016/03/17/apple-building-own-cloud-infrastructure/\" target=\"_blank\">codenamed McQueen</a>.</p>\n<p>While part of the motivation will be cost, it was also recently reported that security is another significant consideration, Apple being concerned that servers received from third-parties may have been <a href=\"http://9to5mac.com/2016/03/23/apple-cloud-infrastructure-servers-snooping/\" target=\"_blank\">tampered with</a> prior to delivery &#x2026;</p>\n\n<p>The&#xA0;<em><a href=\"http://www.digitimes.com/news/a20160411PD200.html\" target=\"_blank\">Digitimes</a></em> report is lacking in detail, but the report has credibility given that Inspur has more than a 60% share of the Chinese server market and its client base includes many big players.</p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">Many IT players including Microsoft, LG Electronics, Ericsson, Intel, IBM, SAP, VMware, Nvidia and RedHat, have formed partnerships with the China-based server vendor, looking to quickly expand in China&#x2019;s server market.</span></p>\n</blockquote>\n<p>Inspur also has a Californian office, which includes both R&amp;D and production facilities.</p>\n<p>We <a href=\"http://9to5mac.com/2015/05/22/ios-9-os-x-10-11-to-bring-quality-focus-smaller-apps-rootless-security-legacy-iphoneipad-support/\" target=\"_blank\">first reported</a> that Apple was upgrading its cloud servers back in May of last year, with&#xA0;<em>Bloomberg</em> reporting the <a href=\"http://9to5mac.com/2015/06/08/apple-cloud-data-centers/\" target=\"_blank\">following month</a> that Apple was&#xA0;<span class=\"s1\">working on designing its own storage and network equipment, and building its own private fiber optic links, rather than relying exclusively on third-party companies.</span></p>\n<p><em>Image: <a href=\"http://en.inspur.com\" target=\"_blank\">Inspur</a></em></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/11/apple-icloud-in-house-inspur/", "short_url": "http://rdd.me/rkjgavly", "title": "Apple reportedly working with Chinese server vendor to help bring cloud services in-house", "excerpt": "Apple is reportedly working with Chinese server vendor Inspur as it seeks to bring the infrastructure for its cloud services in-house. Apple&#xA0;currently relies on third-party companies to host its&hellip;", "direction": "ltr", "word_count": 230, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 13:05:08"}