{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>LG has said that it <a href=\"http://english.yonhapnews.co.kr/news/2016/04/11/0200000000AEN20160411008800320.html?c4efb8b0\" target=\"_blank\">expects to announce</a> its best financial results in nearly two years when it unveils its final earnings results for Q1 2016. Thanks to the drop in television panel prices and strong appliance sales, LG will see a 66% year-on-year rise in profits. Its mobile division, however, is struggling to make money.</p>\n\n<p>LG is expecting a first-quarter profit of 505 billion won (approx $441M USD), which would mark its best quarter since Q2 2014, and is far&#xA0;higher than the 408 billion won <a href=\"http://www.reuters.com/article/us-lg-elec-results-idUSKCN0X80LY?feedType=RSS&amp;feedName=technologyNews\" target=\"_blank\">predicted by analysts</a>.</p>\n<p>While it&#x2019;s good news for LG as a whole, the mobile division is showing no signs of improving. The division in charge of its smartphone effort is expected to announce a third straight quarterly loss, no thanks to the&#xA0;pre-launch spend on marketing for the <a href=\"http://9to5google.com/tag/lg-g5\" target=\"_blank\">LG G5</a>.</p>\n<p>The company&#x2019;s latest smartphone hasn&#x2019;t been on the market long enough to make a noticeable positive impact on the company&#x2019;s mobile fortunes, but if it doesn&#x2019;t, it&#x2019;s hard to see how the mobile division can turn things around.</p>\n<p>LG&#x2019;s G5 is clearly one of the most unique flagships on the market, thanks to its novel approach to modular design. Whether or not that translates to strong consumer demand is yet to be seen. With the S7 and S7 Edge selling <a href=\"http://9to5google.com/2016/04/08/galaxy-s7-s7-edge-strong-sales-counterpoint-research-2016/\" target=\"_blank\">better than expected</a>, and HTC <a href=\"http://9to5google.com/2016/03/22/htc-10-online-only-april-12/\" target=\"_blank\">about to show its hand</a>, LG has some stiff competition.</p>\n\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/11/lg-q1-2016-prediction/", "short_url": "http://rdd.me/hbwgkmtj", "title": "LG profit rose 66% in Q1 but mobile business not yet improving", "excerpt": "LG has said that it expects to announce its best financial results in nearly two years when it unveils its final earnings results for Q1 2016. Thanks to the drop in television panel prices and strong&hellip;", "direction": "ltr", "word_count": 229, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 11:01:12"}