{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>HTC will finally unveil its next metal-bodied flagship during an <a href=\"http://9to5google.com/2016/03/22/htc-10-online-only-april-12/\" target=\"_blank\">online event tomorrow,</a> but, a couple of last minute leaks have seemingly confirmed past speculation. Perhaps most revealing is a <a href=\"http://v.youku.com/v_show/id_XMTUyNzgyMzMzNg==.html#paction\" target=\"_blank\">video on YouKu</a> (China&#x2019;s version of YouTube).</p>\n\n<p>The render video &#xA0;is a typical promo video used to show off the craftsmanship behind the <a href=\"http://9to5google.com/tag/htc-10\" target=\"_blank\">HTC 10</a>, and is rumored to be part of tomorrow&#x2019;s official announcement. In it, we see a laser shaping a rectangular block of metal in to the solid unibody HTC smartphone with a&#xA0;heavily chamfered&#xA0;rounded back. As we&#x2019;ve seen in previous leaks, it also has the USB Type-C connector on the bottom edge, as well as the textured power button below the volume rocker on the right edge.</p>\n<p>Presuming this is an official video as the leak&#xA0;claims, it will more than likely be joined by several others during tomorrow&#x2019;s announcement, each showing individual features. Whether it be the supposed <a href=\"http://9to5google.com/2016/02/25/htc-interview-camera-vive/\" target=\"_blank\">all-conquering camera</a>, or the new BoomSound technology.</p>\n\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\n\t\t\t\t\t\n\t\t\n\t\t\t\t\n\t\t\n\t\t\n\t\t\n<p>Alongside the leaked promo video, Dutch blog, <em>GSMHelpdesk</em> <a href=\"http://www.gsmhelpdesk.nl/nieuws/12553/exclusief-dit-is-de-htc-10-die-dinsdag-gepresenteerd-gaat-worden\" target=\"_blank\">got its hands on</a> images and specs from a source which it claims has been very accurate in the past. Both the images and the specifications published corroborate everything we&#x2019;ve read previously.</p>\n<p>The site claims that the device will feature a 5.2-inch Quad HD display, built on to a S-LCD 5 panel as well as a 2.2GHz <a href=\"http://9to5google.com/tag/snapdragon-820\" target=\"_blank\">Snapdragon 820</a> processor and 4GB RAM. A 12MP f/1.8 camera setup will ensure that, for once, HTC will be competitive on the photography front, while it&#x2019;s rumored that the front camera boasts 5 million pixels and is also equipped with OIS (Optical Image Stabilization). Other claimed specs include expandable storage up to 2TB, 32 or 64GB internal storage and a 3000mAh battery which supports Quick-Charge 3.0.</p>\n<p>Given the fact that we&#x2019;ve seen the device from pretty much every angle, and have heard the same list of specs over and over again, it&#x2019;s going to take something special from <a href=\"http://9to5google.com/tag/htc\" target=\"_blank\">HTC</a> to surprise us during tomorrow&#x2019;s event. The one area we can look forward to hearing more about is the new BoomSound. While we&#x2019;re fairly sure&#xA0;<a href=\"http://9to5google.com/2016/01/28/htc-one-m10-specs-leak/\" target=\"_blank\">there won&#x2019;t be</a> a dual front-facing speaker setup, it&#x2019;s been rumored for months that the BoomSound name is remaining. HTC themselves has <a href=\"http://9to5google.com/2016/03/23/htc-10-boomsound/\" target=\"_blank\">teased that very fact</a>. We just don&#x2019;t know what it means, technically.</p>\n<p>From the looks of things, it should be a very competitive phone, but it&#x2019;s unlikely that it will compete with the S7 and S7 Edge for serious market share.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/11/htc-10-video-specs/", "short_url": "http://rdd.me/uccrcxvf", "title": "HTC 10 promo video leaks early as rumored specs are corroborated", "excerpt": "HTC will finally unveil its next metal-bodied flagship during an online event tomorrow, but, a couple of last minute leaks have seemingly confirmed past speculation. Perhaps most revealing is a video&hellip;", "direction": "ltr", "word_count": 408, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 09:48:08"}