{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p>It is common for OEMs these days to launch more than one flagship device on the market, as rarely one model alone is able to satisfy every segment of it. Often, like in the case of the just announced <a href=\"http://9to5google.com/tag/huawei-p9\">Huawei P9</a> and P9 Plus, manufacturers simply create different sized versions of the same phone, while other companies opt to design&#xA0;entirely new&#xA0;lines to target different audiences and keep up with the fast upgrade cycles.</p>\n<p><a href=\"http://9to5google.com/tag/samsung\">Samsung</a> has long established this pattern with the Galaxy S phones and its Note lineup, which is why a <a href=\"http://9to5google.com/tag/galaxy-note\">Galaxy Note 6</a> is highly likely to launch worldwide come the last quarter of the year. Naturally, albeit being only April, the rumor mill has all but started, with various information already floating around. <a href=\"http://www.sammobile.com/2016/02/05/rumor-galaxy-note-6-will-come-to-europe-but-no-new-edge-handset/\">A report from SamMobile</a> claims that the forthcoming handset will inherit the <a href=\"http://9to5google.com/tag/galaxy-s7\">Galaxy S7</a>&#x2018;s water resistance capabilities, and&#xA0;may sport an iris scanner as well&#x2026;</p>\n\n<p>Given the usual process of introducing something new with the Galaxy S devices only to find it back (and, at times, improved) with the Notes towards the end of the year &#x2014; despite some <a href=\"http://9to5google.com/2016/03/22/galaxy-note-6-android-n-rumor/\">sketchy reports talking about a potential debut as early as July</a> &#x2014; the IP68 certification wouldn&#x2019;t come as a shocker, and despite SamMobile&#x2019;s &#x2018;confirmation&#x2019; we would expect it anyways.</p>\n<p>Where things get more interesting is in a <a href=\"http://www.galaxyclub.nl/2016/04/samsung-galaxy-note-6-irisscanner\">cited report from dutch site GalaxyClub</a>, who managed to discover that a previously unseen &#x201C;Iris Cam&#x201D; has been imported to India in one of the Korean giant&#x2019;s R&amp;D facilities. Of course, the actual name &#x201C;Galaxy Note 6&#x201D; is not listed anywhere, and neither is any other phone, but given the clear &#x201C;Samsung Mobile&#x201D; label it would be legitimate to expect them to at least be testing the new component on their most important upcoming smartphone.</p>\n<p>There is obviously no indication of what the iris scanner could be used for, but one thing that immediately pops into mind would be increased&#xA0;security in addition to fingerprint scanning, which could somehow extend to some of Samsung&#x2019;s apps other than the predictable lock screen bypass &#x2014; if not an entire system-wide support from <a href=\"http://9to5google.com/tag/google\">Google</a>, if we want to keep speculating. <a href=\"http://9to5google.com/tag/microsoft\">Microsoft</a>&#x2018;s <a href=\"http://9to5google.com/tag/windows\">Windows Hello</a> feature already offers this, and both the Lumia 950 and 950XL&#xA0;use&#xA0;this capability.</p>\n<p>Other rumors here reported claim that the device could sport a massive 5.8&#x2033; display, most likely AMOLED, as well as a monstrous 6GB of RAM, powered by Google&#x2019;s yet-to-be-finalized <a href=\"http://9to5google.com/tag/android-n\">Android N</a>; and,&#xA0;more importantly, the potential, <a href=\"http://9to5google.com/2015/12/04/galaxy-note-5-release-uk-europe/\">actual return of the Note lineup in Europe</a>. As always, albeit not being entirely improbable, you should still take these rumors with a grain salt.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Edoardo Maggio", "url": "http://9to5google.com/2016/04/08/galaxy-note-6-iris-scanner-water-resistance/", "short_url": "http://rdd.me/0ahfohzg", "title": "The Galaxy Note 6 may bring an iris scanner alongside water resistance", "excerpt": "It is common for OEMs these days to launch more than one flagship device on the market, as rarely one model alone is able to satisfy every segment of it. Often, like in the case of the just announced&hellip;", "direction": "ltr", "word_count": 431, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-08 19:54:29"}