{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>After lackluster PRIV sales last quarter and a <a href=\"http://9to5google.com/2016/04/06/blackberry-priv-price-cut/\">subsequent price cut</a>,&#xA0;BlackBerry&#xA0;will be launching two&#xA0;mid-range devices later this year. Speaking to <em><a href=\"http://www.thenational.ae/business/technology/blackberry-switches-focus-back-on-mid-range-smartphone-market\">The National</a></em>, CEO John Chen said their first device running Android&#xA0;&#x201C;was too high-end a product&#x201D; even for the enterprise market.</p>\n\n<p>Confirming its commitment to Android, one device will have a physical keyboard and the other a full touchscreen. In the interview, Chen said enterprise customers were interested to BlackBerry&#x2019;s approach of securing Android. The company has no&#xA0;other choice app-wise, as Facebook and WhatsApp announced they would drop support for BB10.</p>\n<p>The device with a physical keyboard might be&#xA0;the previously <a href=\"http://9to5google.com/2015/11/11/blackberry-vienna-android/\">leaked Vienna</a> that has a similar form factor to classic BlackBerry devices.&#xA0;It retains the BlackBerry keyboard while dropping the PRIV&#x2019;s slider design. It would presumably launch with Android Marshmallow which the company is <a href=\"http://9to5google.com/2016/04/04/android-marshmallow-beta-blackberry-priv/\">already testing</a> on the PRIV.</p>\n<p>Chen mentioned $400 as a price point enterprise customers would find more appealing, but we&#x2019;ll have to see what hardware compromises BlackBerry will make to achieve that. For all the talk of the PRIV of being a high-end product, it had pretty standard Android specs. It&#x2019;s Snapdragon 808 processor is the same as found on the Nexus 5X and Nextbit Robin.</p>\n<p>Last quarter, the company only sold 600,000 PRIV devices with analysts forecasting nearer 850,000 phones. Chen has previously said the company will exit the hardware business if they cannot reach profitability by this year.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Abner Li", "url": "http://9to5google.com/2016/04/08/blackberry-mid-range-android/", "short_url": "http://rdd.me/ge5m3jaw", "title": "BlackBerry will launch two mid-range Android devices later this year", "excerpt": "After lackluster PRIV sales last quarter and a subsequent price cut,&#xA0;BlackBerry&#xA0;will be launching two&#xA0;mid-range devices later this year. Speaking to The National, CEO John Chen said&hellip;", "direction": "ltr", "word_count": 231, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-08 16:41:43"}