{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Having been on the market <a href=\"http://9to5google.com/2016/02/21/galaxy-s7-official-launch/\" target=\"_blank\">for a month</a>, the analysts over at Counterpoint Technology Market Research crunched some numbers, and found that the Galaxy S7 and S7 Edge are <a href=\"http://www.counterpointresearch.com/galaxys7sales1q2016\" target=\"_blank\">outselling their predecessors</a> fairly comfortably, despite the increasingly harsh competitive market.</p>\n\n<p>Overall, the Galaxy S7 and <a href=\"http://9to5google.com/tag/galaxy-s7-edge\" target=\"_blank\">S7 Edge</a> are experiencing sales of around 25% higher during their opening month than the S6 and S6 Edge did last year.&#xA0;Sales are up 30% in the US, 20% in Western Europe and 10% in China. While some other markets have seen an increase as high as 50%, the company&#x2019;s home country of Korea has seen relatively flat sales with little growth on last year&#x2019;s device sales. In a landscape where Apple&#x2019;s global iPhone <a href=\"http://9to5mac.com/2016/01/27/peak-iphone-future-opinion/\" target=\"_blank\">sales are virtually flat</a> year-on-year, that performance is not to be sniffed at.</p>\n<p>While the improved battery life, water-proofing and re-addition of expandable storage undoubtedly has something to do with the strong performance, it&#x2019;s also partly down to better management of inventory.</p>\n<blockquote><p>Adding further comments on demand for S7 models, James Yan, Research Director in China for Counterpoint said. &#x201C;Last year, demand for the Galaxy S6 Edge model was high but because of supply constraints, Samsung lost the window of opportunity. However, this year the sales mix is almost 47% Edge vs 53% flat models, thanks to a better supply situation for the popular curved edge display model.&#xA0; In addition, there has been a greater adoption to the edge display by consumers.&#x201D;</p></blockquote>\n<p>Counterpoint also notes that the plethora of strong carrier promotions has pushed sales with deals like buy-one-get-one promotions, free tablets, TVs and included VR headsets.</p>\n<p>It&#x2019;s not just the high end Galaxy S phones doing well, according to a report from <em>WSJ</em>, Samsung is experience some <a href=\"http://www.wsj.com/article_email/samsung-makes-aggressive-play-for-emerging-markets-1459997969-lMyQjAxMTA2NzAxNzMwMzcyWj\" target=\"_blank\">healthy growth</a> in the developing markets. While its flagship phones aren&#x2019;t easily attainable, it has added higher-end features to&#xA0;its low to mid-range devices, and it&#x2019;s working. In markets like India and China, where startups are launching very competitive entry-level products, <a href=\"http://9to5google.com/tag/samsung\" target=\"_blank\">Samsung</a> has decided to compete with&#xA0;them head on.</p>\n<blockquote><p>The Galaxy J series, which has gained traction in India and Indonesia, was redesigned to look more like Samsung&#x2019;s top-of-the-line Galaxy S series. For less than half the price of its flagship devices, the phones that cost $100 to $250 offer features like data-saving mode, which allows consumers to limit data usage&#x2014;an important feature in emerging markets where mobile data plans are often capped.</p></blockquote>\n<p>As you can imagine, introducing higher-end components and features costs money, and many analysts are worried that this isn&#x2019;t a healthy long-term strategy for the Korean tech giant. Selling devices for the same $100-$250 price range but with more expensive parts means that, although they will see improved market share and sales, profit margins will shrink.</p>\n<p>With that said, there&#x2019;s seemingly no alternative. In a competitive market where hundreds of smaller companies are cropping up world-wide and are able to build high-powered smartphones at low prices due to lower overheads, Samsung has had to use its position of market strength to compete. It may make less money, but at least it&#x2019;s competing.</p>\n\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/08/galaxy-s7-s7-edge-strong-sales-counterpoint-research-2016/", "short_url": "http://rdd.me/miwv8ebm", "title": "Galaxy S7/Edge first month sales comfortably higher than S6 YoY as Samsung gains ground in developing markets", "excerpt": "Having been on the market for a month, the analysts over at Counterpoint Technology Market Research crunched some numbers, and found that the Galaxy S7 and S7 Edge are outselling their predecessors&hellip;", "direction": "ltr", "word_count": 510, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-08 12:54:06"}