{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>According to a new report from <a href=\"http://techcrunch.com/2016/04/07/facebook-chatbots/\">TechCrunch</a>, Facebook is working with developers to build chatbots and Live Chat web plugins for business clients. The tools are said to be officially announced next week at the social network&#x2019;s F8 conference. Chatbots will allow for businesses to offer automated response systems for responding to inquires from potential customers.</p>\n\n<p>The report explains that instead of businesses having to develop their own communication systems, which many simply don&#x2019;t have the resources or knowhow to do, they can use Facebook&#x2019;s preexisting system. Chatbots will allow for businesses to respond with what Facebook calls &#x201C;Structured Messages,&#x201D; which can include things like &#x201C;a title, image, a description, a URL and calls to action such as visiting a website, viewing an e-commerce order or making a restaurant reservation.&#x201D; Essentially, this offers a way for consumers to communicate with businesses without having to interact with an actual human being.</p>\n<p>Additionally, Facebook is working with Live Chat developers to build &#x201C;Message Us&#x201D; contact buttons for business websites. While most businesses currently offer the ability for users to quickly contact them via email or phone, this initiative would allow for costumers to get a quicker and more thorough response.</p>\n<p>The report notes that when users would tap on the &#x201C;Message Us&#x201D; button on a website, they would then be redirected to the Messenger app on their phone or on the web to communicate with the businesses. All of the features Messenger users have come to love will be there, including read receipts and typing indicators.</p>\n<p>While Facebook hasn&#x2019;t officially announced chatbots or Live Chat web plugins, it has made a pair of official announcements today.</p>\n<p>First off, the company has <a href=\"https://www.facebook.com/messenger/posts/930151277104553\">announced&#xA0;Messenger Codes</a>, Messenger Usernames, and Messenger Links. Facebook says that these tools will make it easier&#xA0;for users to &#x201C;find the people (and businesses) that matter to you and be able to start conversations immediately with the launch of a simple set of tools that are built for the modern world.&#x201D;</p>\n<p>Messenger Codes are a lot like the Snapcodes feature that Snapchat launched a while back. Each user will now be assigned a unique Messenger Code that another user can scan to start communication. Messenger Links and Messenger Usernames are new personalized links that users can share anywhere online. &#x201C;You can send your Messenger Link directly to your contacts or friends. Tap or click any Messenger Link to open Messenger directly to a thread with that person or business,&#x201D; Facebook says.</p>\n<p>Facebook today has also <a href=\"http://newsroom.fb.com/news/2016/04/search-fyi-more-ways-to-discover-live-video/\">unveiled new ways to discover live video on Facebook Live</a>:</p>\n<blockquote>\n<h3><strong>Live Video in Trending Topics</strong></h3>\n<p>It&#x2019;s now easier to discover Live video in topics that are Trending on Facebook. If relevant Live video is available, it will be included in the Search results pages for these topics so you can get a direct, first-hand look at what&#x2019;s happening.</p>\n<h3><b>Video Search</b></h3>\n<p>Our team built a dedicated search experience for the new Live video destination that&#x2019;s coming to Facebook&#x2019;s mobile app. Here, you can easily find even more videos across Facebook&#x2014;just type a few keywords into the search bar at the top of the screen to discover all sorts of videos about things that matter to you, from chefs sharing their recipes to scientists explaining their breakthroughs to comedians trying out new jokes.</p></blockquote>\n<p>Facebook&#x2019;s F8 conference kicks-off in San Francisco on April 12th.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Chance Miller", "url": "http://9to5google.com/2016/04/07/facebook-messenger-codes-chatbot/", "short_url": "http://rdd.me/1qcjsa6p", "title": "Facebook unveils ‘Messenger Codes,’ will reportedly launch chatbot & live chat APIs next week", "excerpt": "According to a new report from TechCrunch, Facebook is working with developers to build chatbots and Live Chat web plugins for business clients. The tools are said to be officially announced next&hellip;", "direction": "ltr", "word_count": 553, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-07 23:45:56"}