{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>A KGI investment note seen by&#xA0;<em>9to5Mac</em> suggests that Apple Watch shipments will fall by more than 25% this year. The note estimates 2015 sales at 10.6M units, and predicts&#xA0;that full-year shipments this year will be below 7.5M units.&#xA0;The fall would be even more dramatic in real terms, as it would be comparing 12 months of sales in 2016 against 8 months of sales last year.</p>\n<p>The company&#xA0;cites two reasons for the forecast. First, that the wearable device market is still a fledgling one, not yet mature in terms of behaviour. But KGI&#x2019;s Ming-Chi Kuo also believes the Watch itself falls short &#x2026;</p>\n\n<p>Kuo argues that the device lacks killer applications as yet, and the form factor has room for improvement. He also believes that the limited battery life and reliance on the iPhone for functionality are&#xA0;holding back demand.</p>\n<p>KGI expects mass-production of the next Apple Watch to begin in the third quarter of this year, suggesting a likely launch alongside the iPhone 7, with better connectivity among the improvements. However, KGI believes this will effectively be an &#x2018;S model&#x2019; refresh, with little change to the form factor.</p>\n<p>The analyst believes that demand may improve on the back of a new design&#xA0;in 2017.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/11/apple-watch-sales-2015-2016/", "short_url": "http://rdd.me/kd9kokcm", "title": "KGI forecasts Apple Watch shipments will fall 25% year-on-year, be below 7.5M units vs. 10.6M in 2015", "excerpt": "A KGI investment note seen by&#xA0;9to5Mac suggests that Apple Watch shipments will fall by more than 25% this year. The note estimates 2015 sales at 10.6M units, and predicts&#xA0;that full-year&hellip;", "direction": "ltr", "word_count": 201, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-11 11:19:18"}