{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>In a blog post this morning, Google has announced that it plans to <a href=\"http://googleasiapacific.blogspot.co.uk/2016/04/laying-foundation-for-renewable-energy.html\" target=\"_blank\">provide seed funding</a> to the Center for Resource Solutions (CRS), with the aim to begin rollout&#xA0;of&#xA0;effective energy certification programs across Asia, starting in Taiwan.</p>\n\n<p>Google has long-aimed to power 100% of its operations <a href=\"http://9to5google.com/2015/12/03/google-renewable-energy-usage-2-gigawatt/\" target=\"_blank\">using renewable energy</a>. Whether that means wind or solar farms, the tech giant wants to ensure its huge data centers aren&#x2019;t using any non-renewable fossil fuels and &#x2014; in doing so &#x2014; causing&#xA0;damage to the environment.</p>\n<p>While that&#x2019;s relatively easy in developed markets like the US or Europe, it&#x2019;s a little trickier in Asia, mostly because the area doesn&#x2019;t have effective energy certification programs. Google currently has data centers in Taiwan and Singapore and wants to ensure it can &#x201C;begin laying the groundwork to establish such programs across Asia.&#x201D;</p>\n<p>What these programs do is help companies know that power being purchased is coming from renewable sources. Google explains it like this:</p>\n<blockquote><p>They work by &#x201C;tagging&#x201D; each MWh of energy generated from a source like wind or solar as renewable, which creates a renewable energy certificate (&#x201C;REC&#x201D;). This is especially important to us in Taiwan, where we are actively looking to purchase renewable energy for our data center.</p></blockquote>\n<p>By using these &#x2018;tagging&#x2019; systems, Google can know that when it buys power, it&#x2019;s buying it from a green source. This gives Google the assurance it needs to claim that it is, indeed, running all of its facilities on renewable energy. Without it, Google can&#x2019;t make those claims, and can&#x2019;t be sure that it is using energy from only renewable sources.</p>\n<p>With Google&#x2019;s funding, CRS will start by examining the best methods for structuring these programs across Asia. They&#x2019;re also going to build a &#x201C;coalition of international stakeholders from the public, private, and NGO sectors&#x201D; in order to push the efforts forwards. In short: Google isn&#x2019;t just putting its own money in, it&#x2019;ll build up a group of other investors to make sure the project is effective.</p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/opJMrzNauFQ?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/07/google-renewable-energy-investment-asia/", "short_url": "http://rdd.me/xru4plxe", "title": "Google funding efforts to bring more renewable energy to Asia", "excerpt": "In a blog post this morning, Google has announced that it plans to provide seed funding to the Center for Resource Solutions (CRS), with the aim to begin rollout&#xA0;of&#xA0;effective energy&hellip;", "direction": "ltr", "word_count": 329, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-07 13:34:28"}