{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p class=\"p1\"><span class=\"s1\"><a href=\"http://www.bluestacks.com/\" target=\"_blank\">BlueStacks</a>, the app that lets users play Android games on their PC, is today announcing integration with Twitch that it says will make it easier than ever before to live stream Android games.</span></p>\n\n<p class=\"p1\"><span class=\"s1\">With today&#x2019;s introduction of BlueStacks TV, users of the PC app will be able to both live stream and watch streams from others playing Android games. The company is using Twitch&#x2019;s recently launched mobile streaming APIs to offer the functionality. BlueStacks says it has around 130 million users. Compare that to the approximately 1.7 million users broadcasting on Twitch with mostly PC games. </span></p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">&#x201C;This was a natural combination,&#x201D; said BlueStacks CEO, Rosen Sharma. &#x201C;BlueStacks has mobile equivalents of the most popular games on the Twitch platform, midcore RPG titles especially. It used to be hard to stream a mobile game. It involved multiple devices: a tablet, a webcam and wires. We&#x2019;ve cut all of that out. From a PC it&#x2019;s easy to stream. It&#x2019;s why Twitch has become so popular so fast. BlueStacks users are already playing mobile games like Hearthstone, Castle Clash, Vainglory and others &#xAD; we just built a bridge between our platforms. This combines the power of two huge user bases.&#x201D;</span></p>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">There are already some options on Android for sharing gameplay videos and live streaming, but it usually requires the right mix of hardware for a fluid experience that not every user has access to. Nvidia&#x2019;s Shield gaming tablet can stream Android gameplay to Twitch, for example, and Android has its own system level <a href=\"http://9to5google.com/2016/03/14/android-gaming-gdc-2016-updates/\"><span class=\"s2\">screen recording APIs</span></a> to get gameplay video onto YouTube and elsewhere. And other gameplay recording <a href=\"http://9to5mac.com/2015/07/23/kamcord-gameplay-recording-live-stream-ios/\"><span class=\"s2\">platforms like Kamcord</span></a> are working on live streaming directly from Android devices.</span></p>\n<p class=\"p1\"><img title=\"BlueStacks TV integrates Twitch to allow Android gameplay live streaming with just a PC\" class=\"alignnone size-full wp-image-137967\" src=\"https://9to5google.files.wordpress.com/2016/04/3-get-ready-kritika1.png?w=1000&amp;h=569\" alt=\"3 get ready - Kritika\" width=\"1000\"></p>\n<p class=\"p1\"><span class=\"s1\">But BlueStacks notes its implementation&#xA0;of the Twitch APIs will make for one of the smoothest experiences, allowing users to stream games using only a PC without the need of &#xA0;any additional hardware or even a smartphone running Android.&#xA0;</span></p>\n<p class=\"p1\"><span class=\"s1\">You&#x2019;ll be able to access the live streaming features in the latest version of the BlueStacks for PC starting today. And the company is hosting a tournament with the game Hearthstone to celebrate the launch <a href=\"https://Twitch.tv/BlueStacksInc\" target=\"_blank\">on Twitch</a></span><span class=\"s1\">.</span></p>\n<p class=\"p1\"><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/bB1kZGbU1-s?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Jordan Kahn", "url": "http://9to5google.com/2016/04/07/bluestacks-twitch-pc-gameplay-streaming/", "short_url": "http://rdd.me/b4pilxb7", "title": "BlueStacks TV integrates Twitch to allow Android gameplay live streaming with just a PC", "excerpt": "BlueStacks, the app that lets users play Android games on their PC, is today announcing integration with Twitch that it says will make it easier than ever before to live stream Android games. With&hellip;", "direction": "ltr", "word_count": 351, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5google.files.wordpress.com/2016/04/3-get-ready-kritika1.png?w=1000&h=569", "rendered_pages": 1, "date_published": "2016-04-07 13:14:11"}