{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>The prosperous urban regions of <a href=\"http://9to5google.com/tag/china/\" target=\"_blank\">China</a> &#x2013; where almost all the emerging middle class are to be found &#x2013; is a key market for premium smartphone models, and the latest <a href=\"http://www.kantarworldpanel.com/global/smartphone-os-market-share/intro\" target=\"_blank\">figures</a> from Kantar Worldpanel suggest that local Android brands are taking market share from Apple.</p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">The latest smartphone OS data from Kantar Worldpanel ComTech for the three months ending February 2016 shows that Android increased its sales share in urban China to 76.4% from 73% in the same period a year ago. In the US and EU5, Android continued to make year-on-year gains.</span></p>\n</blockquote>\n<p>Apple saw the iPhone&#x2019;s market share drop 3.2% in the same period.</p>\n\n<p>Kantar said that Android gains were due to&#xA0;both older and newer Chinese brands.</p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">Huawei was able to recapture the top spot on the Smartphone brand leader board, capturing 24.4% of Smartphones sold in urban China, just ahead of Apple&#x2019;s 22.2% [&#x2026;]</span></p>\n<p class=\"p1\"><span class=\"s1\">Up-and-coming local brands Meizu and Oppo both showed strong year-on-year growth, each capturing about 6% of smartphone sales.</span></p>\n</blockquote>\n<p>Kantar does, though, believe that the <a href=\"http://9to5mac.com/tag/iphone-se/\" target=\"_blank\">iPhone SE</a>&#xA0;may provide Android smartphones with increased competition,&#xA0;offering an appealing option for those Android owners who would prefer an iPhone but have been constrained by the high purchase cost.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Ben Lovejoy", "url": "http://9to5google.com/2016/04/06/android-vs-ios-urban-china/", "short_url": "http://rdd.me/2z3kvrr3", "title": "Local brands help Android take market share from iOS in key urban China market", "excerpt": "The prosperous urban regions of China &#x2013; where almost all the emerging middle class are to be found &#x2013; is a key market for premium smartphone models, and the latest figures from Kantar&hellip;", "direction": "ltr", "word_count": 198, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-06 12:47:45"}