{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Alphabet is known for aiming for moon when with a lot of its efforts, and its Sidewalk Labs initiative&#xA0;appears to be no different. Sidewalk Labs has been around for about a year now and aims to improve WiFi availability and traffic in cities, but it looks like its plans don&#x2019;t stop there. Sidewalk CEO Dan Doctoroff hinted that the company may be looking to build a city from scratch while speaking in New York at an event held by <a href=\"https://www.theinformation.com/is-alphabet-going-to-build-a-city\">The Information</a>.</p>\n\n<p>When asked about reports that Sidewalk had hired consultants to explore the possibility of building a city from scratch, Doctoroff explained&#xA0;that it &#x201C;would be a great idea,&#x201D; while also saying that he couldn&#x2019;t elaborate any further.</p>\n<p>In an extensive report on the matter, The Information notes that building a city could allow Sidewalk Labs to &#x201C;rethink government, social policy, and data-driven management.&#x201D; Doctoroff explained that &#x201C;thinking about a city from the Internet up is really compelling,&#x201D; while also noting&#xA0;that &#x201C;cities&#xA0;are hard. You have people with vested interest, politics, physical space&#x2026;But the technology ultimately cannot be stopped.&#x201D;</p>\n<p>Ultimately, Sidewalk looks to be interested in developing a city from scratch so it would have a place to test initiatives that it could eventually&#xA0;rollout to other developed cities. &#x201C;If you could create a place, it&#x2019;d be a laboratory to experiment with these problems,&#x201D; Doctoroff said.</p>\n<p>Google has been working towards the idea of improving how <a href=\"http://9to5google.com/2014/09/18/google-x-old-hat-thinks-larry-page-proposes-google-y-for-even-bigger-challenges/\">cities work since 2014</a>, and the <a href=\"http://9to5google.com/2015/06/10/sidewalk-labs-google/\">launch of Sidewalk Labs last year</a> showed that the company was truly dedicated towards branching out to nearly every market possible. Sidewalk Labs works with other companies and government&#xA0;organizations like the Department of Transportation to offer new ways of going about improving age-old problems that cities face. Should the company actually build its own city, it would be able to go to existing areas with proof that its ideas work, thus expediting the rollout.</p>\n<p>Would you want to live in an Alphabet city?</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Chance Miller", "url": "http://9to5google.com/2016/04/05/alphabet-google-wants-to-build-a-city/", "short_url": "http://rdd.me/sw2aieff", "title": "Alphabet’s Sidewalk Labs wants to build a city from the ground up to test its ideas", "excerpt": "Alphabet is known for aiming for moon when with a lot of its efforts, and its Sidewalk Labs initiative&#xA0;appears to be no different. Sidewalk Labs has been around for about a year now and aims to&hellip;", "direction": "ltr", "word_count": 321, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-06 01:43:57"}