{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Drones have become very popular among consumers over the last few years, with various applications mainly in photography and videography, but their potential&#xA0;suggests that there soon could be a slew of additional uses that normal people could benefit from. Particularly, drones could turn out to be very helpful for delivery of&#xA0;<a href=\"http://9to5google.com/2015/10/13/google-two-delivery-drones-faa-testing-us-soil/\">physical objects</a> or perhaps&#xA0;<a href=\"http://9to5google.com/2016/02/01/google-solar-powered-drones-5g/\">an Internet connection</a>.</p>\n<p><a href=\"http://qz.com/655314/google-wants-to-call-drones-to-medical-emergencies-at-the-push-of-a-button/\">According to Quartz</a>, a <a href=\"http://pdfpiw.uspto.gov/.piw?PageNum=0&amp;docid=09307383&amp;IDKey=1B5166BDD3B7%0D%0A&amp;HomeUrl=http%3A%2F%2Fpatft.uspto.gov%2Fnetacgi%2Fnph-Parser%3FSect1%3DPTO2%2526Sect2%3DHITOFF%2526p%3D1%2526u%3D%25252Fnetahtml%25252FPTO%25252Fsearch-bool.html%2526r%3D9%2526f%3DG%2526l%3D50%2526co1%3DAND%2526d%3DPTXT%2526s1%3DGoogle.ASNM.%2526OS%3DAN%2FGoogle%2526RS%3DAN%2FGoogle\">new Google patent filed recently</a> is all about a potential medical use. While last year the idea of medical equipment-carrying drones had already been patented by the search giant, it looks like the company may have found a viable method via which users could contact the devices&#x2026;</p>\n\n<p>The patent shows a device similar to an old radio, featuring a series of buttons corresponding to the various medical emergencies as well as a screen, which seems to be used&#xA0;to show the drone&#x2019;s estimated time of arrival. When dealing with situations where the life of someone is at risk, every minute that is saved can prove to be fundamental &#x2014; and this exactly the message stressed.</p>\n<p>As per the patent:</p>\n<blockquote><p>For example, if it takes 8-9 minutes for an EMS unit such as an ambulance or fire truck to arrive at the site of the emergency under normal circumstances, the first 60-120 seconds of that time may involve the dispatch (e.g., calling 9-1-1, speaking to an operator, etc.). A UAV, on the other hand can be dispatched with an example system without the human interaction required for typical 9-1-1 emergency response, and may be able to travel faster than a ground vehicle because it does not face traffic conditions and will have less distance to cover since it can travel &#x201C;as the crow flies&#x201D; versus following roads.</p></blockquote>\n<p>While there is no mention of an app implementation &#x2014; presumably because <a href=\"http://9to5google.com/tag/google\">Google</a> wouldn&#x2019;t want drones to be summoned in just any area, especially crowded ones &#x2014; the filing does mention self-driving cars as being an alternate method of deployment &#xA0;were they to be more efficient than a drone in a particular&#xA0;moment, thus hinting at other potential use cases to be made for the company&#x2019;s <a href=\"http://9to5google.com/tag/self-driving-car/\">autonomous cars&#x2019; project</a>.</p>\n<div class=\"anno-right\">Certainly this patent alone cannot suggest that Google is actively working on a medical emergency drone system, but such a program would nonetheless be an intriguing feature to be added to the firm&#x2019;s <a href=\"http://9to5google.com/tag/project-wing\">Wing</a> project, which, according project leader Dave Vos, could see drones go live as soon as 2017.</div>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Edoardo Maggio", "url": "http://9to5google.com/2016/04/05/google-medical-equipment-drones/", "short_url": "http://rdd.me/2doeyetv", "title": "Google patent points to device for controlling drones with onboard medical equipment", "excerpt": "Drones have become very popular among consumers over the last few years, with various applications mainly in photography and videography, but their potential&#xA0;suggests that there soon could be a&hellip;", "direction": "ltr", "word_count": 402, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-06 00:41:53"}