{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>According to a new report from <a href=\"https://www.theinformation.com/google-sees-ar-not-vr-as-the-real-goal\">The Information</a>, behind closed doors Google is much more focused on augmented reality than it is on virtual reality. Google of course has <a href=\"http://9to5google.com/2016/02/29/google-store-cardboard-viewers/\">publicly marketed its Cardboard VR</a> product heavily, but that&#x2019;s apparently not the end-goal for the company, augmented reality is.</p>\n\n<p>According to the report, Google has recently formed a new virtual reality unit within the company headed by Clay Bavor. Within this group, however, it&#x2019;s reportedly common knowledge that the augmented, or &#x201C;mixed,&#x201D; reality has a much bigger market in the long run. This market would center around digital information and images being overlaid next to the real-world view.</p>\n<p>Google reportedly doesn&#x2019;t believe that in the public eye, people will be willing to invest in virtual reality solutions that force them to wear massive headsets, such as the <a href=\"http://9to5google.com/2014/09/03/hands-on-meet-samsungs-oculus-powered-gear-vr-video/\">Oculus headset</a>&#xA0;or Gear VR. The company thinks that there&#x2019;s a much bigger profit opportunity in the long run in augmented reality versus virtual reality.</p>\n<p>Google of course has its augmented reality Project Tango initiative and earlier this year announced the first&#xA0;<a href=\"http://9to5google.com/2016/01/07/levono-project-tango-device/\">consumer-ready device in partnership with Lenovo</a>. While unveiling the device, Lenovo and Google showed off&#xA0;how they could instantly map out the stage and reconfigure it with furniture such as a couch and a refrigerator.&#xA0;Project Tango uses real-time mapping technology paired with a complex setup of cameras and sensors to map the 3D space around users in real-time.</p>\n<p>Personally, I happen to agree with Google on this one. I&#x2019;m not a huge fan of virtual reality products, but something like Project Tango offers incredibly useful real-world applications that could push it towards mainstream popularity. I wrote on <a href=\"http://9to5mac.com/2016/01/27/opinion-vr-apple-tim-cook/\">9to5Mac earlier this year</a> that Apple should focus primarily on augmented reality as opposed to virtual reality for this very same reason.</p>\n<p>What do you think? Should Google focus more on augmented reality or Oculus-like virtual reality products?</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Chance Miller", "url": "http://9to5google.com/2016/04/05/google-augmented-reality-versus-virtual-reality/", "short_url": "http://rdd.me/woao0rnf", "title": "Report: Google’s main focus in the long run is augmented reality, not VR", "excerpt": "According to a new report from The Information, behind closed doors Google is much more focused on augmented reality than it is on virtual reality. Google of course has publicly marketed its&hellip;", "direction": "ltr", "word_count": 309, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 23:13:37"}