{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>On the eve of&#xA0;the <a href=\"http://9to5google.com/2016/03/09/huawei-p9-april-6-launch-invites/\">P9 event</a>&#xA0;in London, the <a href=\"http://www.wsj.com/articles/huawei-makes-push-to-get-ahead-of-apple-samsung-in-smartphone-market-1459878744\"><em>Wall Street Journal</em> is reporting</a> that Huawei plans to launch a flagship phone in the US later this year. Entering the US market is a part of its&#xA0;broader plan to compete&#xA0;in the premium phone market and shed its image of making low-end devices.</p>\n\n<p>The comment&#xA0;comes from consumer electronics head Richard Yu, but doesn&#x2019;t include any other details.&#xA0;Huawei is in the midst of transforming itself to compete with Samsung and Apple&#xA0;in the high-end smartphone market. While it&#x2019;s already the third-largest handset maker by shipments, the company is&#xA0;10.9% away from second place Apple.</p>\n<p>Huawei is spending massive amounts on research and development, as well as marketing. The <em>WSJ</em> article notes that the company might have a hard time entering the US market due to being effectively banned from selling networking hardware&#xA0;over&#xA0;spying fears. In the past, the company was successful in overcoming reluctance from&#xA0;European retailers and carriers to sell its&#xA0;devices.</p>\n<p>On the R&amp;D front, Huawei spent&#xA0;$9.2&#xA0;billion last year. Tomorrow&#x2019;s P9 will showcase a <a href=\"http://9to5google.com/2016/02/25/huawei-leica-partnership/\">year-long partnership</a> with Leica to create a <a href=\"http://9to5google.com/2016/04/04/huawei-p9-leica/\">camera</a> that has&#xA0;&#x201C;better color and sharper contrasts even in lowlight conditions.&#x201D; Other specs are rumored to be a 1080p 5.2-inch display,&#xA0;Kirin 950 processor, 32GB of storage, and 3GB of RAM. Design-wise, it will share many similarities with the Nexus 6P including a metal body, similar camera visor, and rear fingerprint sensor.</p>\n<p><em>9to5Google</em> will be reporting live from the event tomorrow, so stay tuned for more coverage.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Abner Li", "url": "http://9to5google.com/2016/04/05/huawei-us-flagship-2016/", "short_url": "http://rdd.me/sqa8qkoj", "title": "Report: Huawei will release a flagship device for the US later this year", "excerpt": "On the eve of&#xA0;the P9 event&#xA0;in London, the Wall Street Journal is reporting that Huawei plans to launch a flagship phone in the US later this year. Entering the US market is a part of&hellip;", "direction": "ltr", "word_count": 240, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 23:22:47"}