{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Today, <a href=\"https://play.google.com/store/apps/details?id=com.whatsapp&amp;hl=en_GB\">WhatsApp</a> is announcing that all messages, photos, phone calls and videos sent over its messaging app will be <a href=\"https://www.whatsapp.com/security/\">encrypted end-to-end</a>.&#xA0;This means that no one can access&#xA0;any communications apart from the people in the conversation. This means if WhatsApp is subpoenaed by government for information, WhatsApp will not be able to help them as it simply cannot help them.</p>\n\n<p>WhatsApp has rolled out end-to-end encryption in various forms over the last few years, but has never fully&#xA0;deployed a solution. The announcement today applies to all platforms, allowing WhatsApp users on Android, iOS, Windows Phone and more to communicate&#xA0;with no fear of their messaging being intercepted.</p>\n<p>By most reports, WhatsApp is the&#xA0;largest&#xA0;messaging service in the world with over a billion users.&#xA0;Going forward, all of&#xA0;the private communications taking place on the service will be truly private.</p>\n<p>As&#xA0;WhatsApp is owned by Facebook, many people never expected the company to&#xA0;add such security features ever.&#xA0;The move shows the company is truly running autonomous of its parent company. In <a href=\"http://www.wired.com/2016/04/forget-apple-vs-fbi-whatsapp-just-switched-encryption-billion-people/\">the&#xA0;interview with Wired</a>, WhatsApp founder&#xA0;Brian Acton&#xA0;said its all about&#xA0;freedoms to let people express themselves.</p>\n<blockquote><p>&#x201C;Building secure products actually makes for a safer world, (though) many people in law enforcement may not agree with that,&#x201D; says Acton, who was employee number forty-four at Internet giant Yahoo before co-founding WhatsApp in 2009 alongside Koum, one of his old Yahoo colleagues. With encryption, Acton explains, anyone can conduct business or talk to a doctor without worrying about eavesdroppers. With encryption, he says, you can even be a whistleblower&#x2014;and not worry.</p></blockquote>\n<p>The secure update is rolling out to all WhatsApp platforms now. <a href=\"https://play.google.com/store/apps/details?id=com.whatsapp&amp;hl=en_GB\">Download WhatsApp for free from the Google Play Store</a>.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Benjamin Mayo", "url": "http://9to5google.com/2016/04/05/whatsapp-rolls-out-end-to-end-encryption-for-all-messages-photos-and-videos-shared-on-the-service/", "short_url": "http://rdd.me/cyz9txxd", "title": "WhatsApp rolls out end-to-end encryption for all messages, photos and videos shared on the service", "excerpt": "Today, WhatsApp is announcing that all messages, photos, phone calls and videos sent over its messaging app will be encrypted end-to-end.&#xA0;This means that no one can access&#xA0;any&hellip;", "direction": "ltr", "word_count": 269, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 15:53:45"}