{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>While we love new technology and where it&#x2019;s headed here at <em>9to5Google,</em>&#xA0;nothing quite tickles our nerd bone than when someone manages to equip an old nostalgic piece of everyday tech with modern day features. In this case, that&#x2019;s a 1978 tube TV with a built-in <a href=\"http://9to5google.com/tag/chromecast\" target=\"_blank\">Chromecast</a>&#x2026;</p>\n\n<p>YouTuber, <a href=\"https://www.youtube.com/channel/UCR4HJ4kVGCoJEfkUIPdiXEQ\" target=\"_blank\">Dr. Moddnstine</a>, published a couple of videos this week showing off his old-school television&#x2019;s new-found ability. It wasn&#x2019;t just a case of finding all the right adapters and modules to convert modern audio/video signals in to old ones, but also building them in to the actual TV box to ensure nothing was hanging out of the the TV. The result is pretty incredible.</p>\n<p>Depending on which connectors you have on your TV the process can differ, but for this particular set, it involved connecting a 300ohm twin-lead VHF connectors to a single 75ohm VHF connector. That in turn was connected to an RF modulator using a standard coaxial cable, which then connects to composite video connectors. Both coaxial TV inputs and composite inputs are both still commonly used on TVs, but with Chromecast being HDMI only, there also needed to be an HDMI to composite adapter.</p>\n<p>While finding and connecting all the right adapters and modules isn&#x2019;t exactly rocket science, fitting it all in to a TV case is pretty impressive. Perhaps even more so is the fact that Dr. Moddnstine has managed to build in a separate system which powers up the old TV as soon as he casts content to the Chromecast inside. Sadly, due to safety fears, he chose not to reveal his methods for achieving this.</p>\n<p>You can watch the short demo video below, or go watch his <a href=\"https://www.youtube.com/watch?v=1qBWSeGnOAs\" target=\"_blank\">much longer one</a> which shows how all the adapters and modules work together, and fit inside the old tube TV set.</p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/Bkuh3pqbn9o?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/05/chromecast-tube-tv-hack/", "short_url": "http://rdd.me/mszmqv0v", "title": "YouTuber turns old 70’s tube TV in to Chromecast-compatible screen [Video]", "excerpt": "While we love new technology and where it&#x2019;s headed here at 9to5Google,&#xA0;nothing quite tickles our nerd bone than when someone manages to equip an old nostalgic piece of everyday tech with&hellip;", "direction": "ltr", "word_count": 299, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 12:42:28"}