{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p class=\"p1\"><span class=\"s1\">T-Mobile is adding more services to its Binge On and Music Freedom features, which allow its customers to stream video and audio content from certain apps without eating into their wireless plan&#x2019;s data allowance.</span></p>\n<blockquote>\n<p class=\"p1\">&#x201C;It&#x2019;s a fact &#x2026; Un-carrier Data is different than Carrier Data. It&#x2019;s better! Nobody does data like T-Mobile!&#x201D; said Legere. &#x201C;Un-carrier Data is not only faster, it lasts a lot longer than the other guys&#x2026; As of today, you stream unlimited music and video from over 100 providers &#x2013; without ever touching your Un-carrier Data or worrying about overages&#x2014;and you can stash what you don&#x2019;t use for later. Try that with Carrier Data. It&#x2019;s gone in a flash, and you&#x2019;re getting hit with penalties&#x2014;or they repossess it after a month or two. Ridiculous!&#x201D;</p>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">Among the 16 total new services being added today, users can now stream audio data-free from Amazon Music, Chilltrax, ESPN Radio, OHIO.FM, PreDanz and Uforia.</span></p>\n<p class=\"p1\"><span class=\"s1\">And for video, services officially added to the list today includeDailymotion, EPIX, OVGuide, OWNZONES, Viki, YipTV, 120 Sports, Nickelodeon, Spike, and TV Land.</span></p>\n<p class=\"p1\"><span class=\"s1\">T-Mobile shared some stats about the Binge On and Music Freedom initiatives noting that users have streamed approximately 90 billion songs without using data since launch (around 210 million songs a day). It also pointed out that its users &#x201C;are watching 2x more from free streaming sites on plans with limited data and have streamed over 190 million hours of video for free.&#x201D;</span></p>\n<p class=\"p1\"><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/RP5k4aGDm_0?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<p class=\"p1\"><span class=\"s1\">The addition of the new services today brings up the number of audio and video services supported by Binge On and Music Freedom to 100 total. You can view a full list of supported services <a href=\"http://www.t-mobile.com/offer/free-music-streaming.html\"><span class=\"s2\">on T-Mobile&#x2019;s website</span></a>.</span></p>\n\n\t<ins class=\"adsbygoogle author_ad\"></ins>\n\n\t\t\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Jordan Kahn", "url": "http://9to5google.com/2016/04/05/t-mobile-binge-on-music-freedom-amazon-espn-spike/", "short_url": "http://rdd.me/7w2fffrm", "title": "T-Mobile adds 16 more services to Binge On & Music Freedom data-free streaming incl. Amazon Music, EPSN Radio, Spike, more", "excerpt": "T-Mobile is adding more services to its Binge On and Music Freedom features, which allow its customers to stream video and audio content from certain apps without eating into their wireless&hellip;", "direction": "ltr", "word_count": 275, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 13:55:37"}