{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Recent reports have painted a dire picture for Nest, with <a href=\"http://9to5google.com/2016/04/01/report-nest-exodus-continues-with-the-loss-of-two-important-execs/\">executives reportedly leaving</a>, <a href=\"http://9to5google.com/2016/03/30/nest-future-lose-funding-fadell/\">funding potentially on the verge of being cut</a>, and much more. Now, a Nest engineer has taken to <a href=\"https://np.reddit.com/r/Nest/comments/4dbbgh/is_anyone_concerned_about_the_future_of_nest/\">Reddit</a> to voice some frustrations. The engineer, who didn&#x2019;t disclose his or her name, says that the company is &#x201C;on deathwatch&#x201D; thanks to &#x201C;dire&#x201D; sale and growth figures and no new innovation since the acquisition occurred.</p>\n\n<p>The engineer claims that &#x201C;Tony [Fadell] and his goons&#x201D; place such time goals on everything that timelines essentially mean nothing. The engineer says that higher-ups will come in at the last-minute, totally reverse everything, and call the teams &#x201C;incompetent&#x201D; for not keeping up with the ever-changing schedule. &#x201C;I waste most of my time in pointless meetings, or defending my teams so they don&#x2019;t flip their desks and walk out,&#x201D; the engineer writes.</p>\n<p>Furthermore, painting an even more dire picture than any previous report has, this engineer claims that &#x201C;people fall asleep in corners and cry in the bathrooms&#x201D; and that the &#x201C;health and marriages are suffering.&#x201D;</p>\n<p>It doesn&#x2019;t stop there, however, as the engineer goes on to call out Tony Fadell for all sorts of shady behind-the-scenes practices, including things such as planned obsolescence, lying about unit sales and&#xA0;subscription information, and much more:</p>\n<blockquote><p>Tony, you can&#x2019;t hide anything from engineers. We know how many units are actually being sold, how many subscriptions lapse, how many fail or get returned. We know about that time-bomb flaw you ignored so people will have to upgrade. We can see the data in those executive dashboards you think we don&#x2019;t know about. But go ahead, keep trashing us in public. We dare you to tell everyone just how much of that $340M was due to a simple Dropcam rebrand, and not the thermostats and smoke alarms. Good luck shipping that critical new project after restarting it for the umpteenth time.</p></blockquote>\n<p>While unfortunately there&#x2019;s no way to 100 percent verify that this information is legitimate and coming from an actual Nest engineer, it certainly speaks volumes to the image of Nest right now that something like this would even get posted. According to a former Nest intern&#xA0;that 9to5Google contacted, things aren&#x2019;t as dire as this specific Reddit post paints, but&#xA0;even if they&#xA0;are half as bad as this engineer says, they are pretty&#xA0;horrendous.</p>\n<p>And the fact that all of Nest&#x2019;s internal struggles are quickly making their way into the public eye does not help the company&#x2019;s public image. A report earlier this year said that Nest <a href=\"http://9to5google.com/2016/03/30/nest-future-lose-funding-fadell/\">could be losing some $500 million in funding from</a> Google at the end of this year because it continues to fail to hit sales goals. Additionally, the <a href=\"http://9to5google.com/2016/04/01/report-nest-exodus-continues-with-the-loss-of-two-important-execs/\">company recently lost a pair of important</a> veterans.</p>\n<p>Tony Fadell has also been involved in a public war of words with former Dropcam CEO Greg Duffy.&#xA0;<a href=\"http://9to5google.com/2016/03/24/dropcams-founder-says-that-tony-fadell-runs-nest-like-a-tyrant-bureaucrat/\">Duffy said that</a>&#xA0;Tony Fadell ran Nest like a &#x201C;tyrant bureaucrat,&#x201D; while more than&#xA0;<a href=\"http://9to5google.com/2016/03/24/dropcams-founder-says-that-tony-fadell-runs-nest-like-a-tyrant-bureaucrat/\">half of&#xA0;Dropcam employees have left</a>&#xA0;since the acquisition occurred. Fadell then&#xA0;<a href=\"http://9to5google.com/2016/03/29/former-dropcam-ceo-fires-back/\">shot back and said</a>&#xA0;that &#x201C;a&#xA0;lot of the employees were not as good as we hoped,&#x201D; which prompted&#xA0;<a href=\"http://9to5google.com/2016/03/29/former-dropcam-ceo-fires-back/\">Duffy again to fire back</a>&#xA0;and defend the Nest team, noting that everyone that left did so because &#x201C;they felt their ability to build great products being totally crushed.&#x201D;</p>\n<p>Whatever is going on behind-the-scenes at Nest, it&#x2019;s not good and its future is growing increasingly unclear. And that certainly won&#x2019;t help it hit sales goals.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Chance Miller", "url": "http://9to5google.com/2016/04/04/nest-engineer-describes-working-there/", "short_url": "http://rdd.me/easaxo86", "title": "Alleged Nest engineer: Company is on ‘deathwatch,’ employees ‘crying in bathrooms’", "excerpt": "Recent reports have painted a dire picture for Nest, with executives reportedly leaving, funding potentially on the verge of being cut, and much more. Now, a Nest engineer has taken to Reddit to&hellip;", "direction": "ltr", "word_count": 559, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 01:55:44"}