{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Google has announced on its <a href=\"http://android-developers.blogspot.com/2016/04/a-new-method-to-measure-touch-and-audio.html\">Android Developers blog</a> that it is open sourcing its WALT Latency Timer. The company says&#xA0;that it has been using the tool in its Chrome OS and Android divisions to measure and minimize touch and audio latency, but now all developers will be able to take advantage of the tool.</p>\n\n<p>Latency is essentially the time between you tapping on something on your display and whatever you tapped actually occurring. So by reducing latency, Google is able to make more a much faster and smoother experience for the end-user:</p>\n<blockquote><p>When you use a mobile device, you expect it to respond instantly to your touch or voice: the more immediate the response, the more you feel directly connected to the device. Over the past few years, we have been trying to measure, understand, and reduce latency in our Chromebook and Android products.</p>\n<p>Before we can reduce latency, we must first understand where it comes from. In the case of tapping a touchscreen, the time for a response includes the touch-sensing hardware and driver, the application, and the display and graphics output. For a voice command, there is time spent in sampling input audio, the application, and in audio output. Sometimes we have a mixture of these (for example, a piano app would include touch input and audio output).</p></blockquote>\n<p>One notable feature of WALT is that it synchronizes external hardware clock with the Android or Chrome OS device within a millisecond, which allows for input and output latencies to be measured separately.</p>\n<p>While the code of WALT is now available on <a href=\"https://github.com/google/walt\">GitHub</a>, it&#x2019;s important to note that there&#x2019;s some hardware that goes into the testing. Google says, however, that users can build their own hardware for under $50 and a little ingenuity.</p>\n<p>More information regarding the open-souring of WALT is available on the Android Developers blog.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Chance Miller", "url": "http://9to5google.com/2016/04/04/walt-open-source-touch-latency/", "short_url": "http://rdd.me/01ql66ib", "title": "Google’s tool for measuring touch and audio latency on Android and Chrome OS is now open source", "excerpt": "Google has announced on its Android Developers blog that it is open sourcing its WALT Latency Timer. The company says&#xA0;that it has been using the tool in its Chrome OS and Android divisions to&hellip;", "direction": "ltr", "word_count": 306, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 00:16:12"}