{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Casio&#x2019;s ultra-rugged WSD-F10 might be the most durable Android Wear device on the market, but it looks like only a handful of people will be able to get their hands on the device. Speaking to <a href=\"http://www.wareable.com/casio/no-plans-for-casio-wsd-f10-smartwatch-launch-outside-us-or-japan-2540\">Wearable.com</a>, Casio stated that the company currently does not have plans to bring the smartwatch to any additional countries. Currently, the WSD-F10 is available in the United States and Japan only.</p>\n\n<p>&#x201C;At the moment there are only plans for the WSD-F10 to be stocked in the United States&#xA0;and Japan, with no confirmed date for UK release,&#x201D; a Casio spokesperson said. Casio&#x2019;s reasoning for limiting the launch is unclear at this point, but it&#x2019;s certainly a puzzling decision seeing that the United States and Japan represent only a fraction of the world&#x2019;s population.</p>\n<p>We went <a href=\"http://9to5google.com/2016/01/08/casio-android-wear-video/\">hands-on with the Casio&#xA0;WSD-F10 back at CES</a> in January and noted that it&#x2019;s the most durable and rugged smartwatch we&#x2019;ve seen. The device is certified to military grade standards and can survive depths of up to 50 meters. Furthermore, the watch is full of sensors, including a pressure sensor, magnetic censor, accelerometer, and gyroscope. Perhaps most notably, though, the device has both a color and monochrome screen, with the later option providing up to 30 days of battery life.</p>\n<p>Despite its unique features, the WSD-F10 looks like it will only be available in the United States and Japan. The watch is <a href=\"http://www.amazon.com/Casio-WSD-F10-Smart-Outdoor-Watch/dp/B01CY1QYG6?ie=UTF8&amp;ref_=sr_1_1&amp;sr=8-1&amp;keywords=WSD%2520F10&amp;tag=9to5g-20&amp;qid=1459809510\">available now in those markets for $500.</a></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Chance Miller", "url": "http://9to5google.com/2016/04/04/casio-wsd-f10-availability/", "short_url": "http://rdd.me/uvvmndsp", "title": "Casio’s ultra-rugged WSD-F10 smartwatch to remain restricted to the United States and Japan", "excerpt": "Casio&#x2019;s ultra-rugged WSD-F10 might be the most durable Android Wear device on the market, but it looks like only a handful of people will be able to get their hands on the device. Speaking to&hellip;", "direction": "ltr", "word_count": 236, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-04 22:44:14"}