{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>While the previous version of Google Glass is&#xA0;<a href=\"http://9to5google.com/2016/01/13/all-google-glass-units-affected-by-problem-causing-units-to-become-unusable/\">dead and dying</a>, it is still an Android device. And that means it&#x2019;s hackable, mod-able, and will probably be tinkered with for years to come.&#xA0;Similar to how other aging&#xA0;devices still have&#xA0;<a href=\"http://www.xda-developers.com/and-it-goes-on-htc-hd2-receives-lollipop-port/\">developer support</a>,&#xA0;Reddit user&#xA0;jtxdriggers has <a href=\"https://www.reddit.com/r/googleglass/comments/4d5e1r/experimenting_with_aosp_on_glass/\">managed to install</a> 4.4 KitKat&#xA0;on&#xA0;Glass.</p>\n\n<p>While not yet &#x201C;usable&#x201D;,&#xA0;jtxdriggers hopes to upload the source on GitHub for others to install when he&#x2019;s &#x201C;comfortable with the functionality.&#x201D;&#xA0;Currently, most navigation is done with&#xA0;Glass tethered to a computer and through&#xA0;ADB commands from a terminal prompt. One possible input method in the future could involve pairing a Bluetooth keyboard.</p>\n<p>As expected there are a&#xA0;few bugs, including the touchpad sometimes acting as the touchscreen and the device&#x2019;s built-in speaker being disabled when plugging in the USB earbud. Additionally, such things as notifications have to be reworked, though the bigger issue is&#xA0;replying to actionable messages.</p>\n<p>It&#x2019;s running KitKat at the moment, but the developer hopes to get&#xA0;Marshmallow up and running to improve battery life and performance by switching to the new Android Runtime (ART). Jtxdriggers says that this hack&#xA0;is&#xA0;already using&#xA0;the Marshmallow OMAP4 processor tree to get KitKat on the device.</p>\n<blockquote><p>I&#x2019;ll upload the source when I&#x2019;m comfortable with the functionality. It has a few rather amusing bugs, which may or may not be intended. The touchpad acts as if it is the touchscreen itself, like if you drag from top to bottom then you are opening the notification drawer. The bone conducting speaker acts like the left speaker in a stereo setup and hooking up the USB earbud outputs the right side, while disabling the left.</p>\n<p>It&#x2019;s running KitKat at the moment, but I&#x2019;m actually using the Marshmallow OMAP4 tree (the processor that Glass uses), so hopefully there is a possibility of getting that to run. Marshmallow would provide amazing battery life improvements, and switching from Dalvik to ART should make the device snappier during normal usage.</p></blockquote>\n<p>The developer behind this effort previously created a <a href=\"http://forum.xda-developers.com/showthread.php?t=2564325\">Glass launcher app</a>&#xA0;and hopes&#xA0;&#x201C;to create an alternative ecosystem for Glass&#x201D; by freeing it from the previous Glass SDK.</p>\n<p>Currently, Glass is being reworked as <a href=\"http://9to5google.com/2015/11/16/project-aura-bringing-two-screen-less-head-mounted-devices/\">Project Aura</a> under Nest&#x2019;s Tony Fadell with a product still a year to two years away. In the mean time, Google is currently <a href=\"http://9to5google.com/2015/07/08/google-glass-enterprise-edition-brings-larger-prism-intel-atom-cpu-battery-life-external-battery-pack/\">testing an Enterprise Edition</a> with numerous partners. Most recently, <a href=\"http://9to5google.com/2016/03/30/google-glass-for-work-tesla/\">we reported about Tesla</a> trialing Glass for Work in its Fremont factory for various repair and assembly line tasks.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Abner Li", "url": "http://9to5google.com/2016/04/04/google-glass-kitkat-aosp/", "short_url": "http://rdd.me/haytvwgv", "title": "One developer has managed to install AOSP KitKat on Google Glass", "excerpt": "While the previous version of Google Glass is&#xA0;dead and dying, it is still an Android device. And that means it&#x2019;s hackable, mod-able, and will probably be tinkered with for years to&hellip;", "direction": "ltr", "word_count": 394, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-04 17:47:42"}