{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Google Play has seen its share of design refreshes since its launch four years ago, but <a href=\"http://officialandroid.blogspot.com/2016/04/a-new-look-for-google-play-family-of-apps.html\">starting today</a> all Play apps will be getting a new, more consistent look. The bright colors share the same design as this year&#x2019;s <a href=\"http://9to5google.com/2016/03/31/google-io-2016-countdown-watch-face/\">Google I/O teaser page</a> and might possibly hint at what design language the company is moving to.</p>\n\n<p>The new icons for the various Google Play apps have a consistent triangle background with an&#xA0;icon slightly peeking out. They also keep the same coloring, though have a much brighter shade. While&#xA0;Play Movies &amp; TV, Games, Books, and Newsstands look more or less the same, the Music icon drops the pair of headphones for a round vinyl with a music note in the center.</p>\n<p>In keeping the same Play&#xA0;icon for all five apps Google is trying &#x201C;to provide a consistent look across the entire family of Play apps.&#x201D;&#xA0;The Play Store app icon remains&#xA0;mostly the same, though the Play icon is much brighter.</p>\n<p>According to the blog post, the new Play icons will come to all devices and online in the coming weeks. Presumably, all the Google Play apps on both Android and iOS will receive an update in the coming weeks with the new design. Icons on the Play Store website and app will also be updated to reflect the new change.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Abner Li", "url": "http://9to5google.com/2016/04/04/google-play-store-new-icons/", "short_url": "http://rdd.me/gpc4pvpe", "title": "Google announces brightly colored refresh of Play Store icons and apps", "excerpt": "Google Play has seen its share of design refreshes since its launch four years ago, but starting today all Play apps will be getting a new, more consistent look. The bright colors share the same&hellip;", "direction": "ltr", "word_count": 217, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-04 17:36:20"}