{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>BlackBerry has opened up a new <a href=\"http://blogs.blackberry.com/2016/04/help-put-android-marshmallow-on-priv-by-joining-our-beta-program/?utm_source=twitter&amp;utm_medium=social&amp;utm_campaign=dv%7Cpriv%7Cengagement%7C%7Cpriv%7C\" target=\"_blank\">beta testing program</a> to give&#xA0;BlackBerry PRIV owners early access to the upcoming <a href=\"http://9to5google.com/tag/android-marshmallow\" target=\"_blank\">Android Marshmallow</a> software update. This news follows the announcement from the company&#x2019;s CEO last week that the 6.0 update would be <a href=\"http://9to5google.com/2016/04/01/android-marshmallow-blackberry-priv/\" target=\"_blank\">rolling out in late April</a>, or early May.</p>\n\n<p>As with every phone running Marshmallow, the PRIV will get &#x2018;Doze&#x2019; mode to extend battery life during standby as well as &#x2018;App Standby&#x2019; which limits how much power is drained by rarely-used apps. What&#x2019;s more, BBerry PRIV owners will get Google&#x2019;s Now On Tap, more granular app permissions controls and auto backup for apps.</p>\n<p>As well as the standard Marshmallow features, <a href=\"http://9to5google.com/tag/blackberry\" target=\"_blank\">BlackBerry</a> notes that the beta update might include future security patches before they&#x2019;re released to everyone else.&#xA0;If you want to sign up to the beta testing program, you&#x2019;ll need to register at <a href=\"https://www.blackberry.com/beta/android\" target=\"_blank\">BlackBerry&#x2019;s Beta Zone</a>. If registration is full, you can sign up to be placed on the waiting list.</p>\n<p>Once signed up and accepted on to the program, participants will test Android 6.0 via&#xA0;wireless software update to the 6.0 beta build, and can submit bug reports by using the included bug reporting app.</p>\n<p>If you want to be among the first wave of beta testers, you&#x2019;ll have a better chance if you bought your phone direct from ShopBlackBerry or from Amazon or Carphone Warehouse. You can also apply if you didn&#x2019;t buy from any of those three stores, but you&#x2019;ll not be accepted immediately.</p>\n<p>Registration is open for around two weeks from today, and testing will begin from the second week of April and last for between 4-8 weeks. Places on the beta program are limited, so if you want to get involved, you&#x2019;ll need to sign up as soon as possible.</p>\n\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/04/android-marshmallow-beta-blackberry-priv/", "short_url": "http://rdd.me/xsnpaxj5", "title": "BlackBerry opens Android Marshmallow beta program for PRIV owners", "excerpt": "BlackBerry has opened up a new beta testing program to give&#xA0;BlackBerry PRIV owners early access to the upcoming Android Marshmallow software update. This news follows the announcement from the&hellip;", "direction": "ltr", "word_count": 290, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-04 15:23:30"}