{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Google/Alphabet published its self-driving car report for March over the weekend, and besides of course the latest numbers (including the number of cars in each city, the total number of autonomous and manual driven miles, etc.), there are also some new details on the system the company&#xA0;uses to map the cars&#x2019; surroundings, and mention of a mundane accident that happened in Austin, Texas involving one of the company&#x2019;s Lexus vehicles&#x2026;</p>\n\n<p>Perhaps interesting in this month&#x2019;s&#xA0;update on car numbers, it seems the company has moved a couple of its prototype all-electric vehicles to Kirkland, Washington. Last month&#x2019;s report was the first time that the program officially listed its newest location, and at the time there was only one of the older Lexus model cars in Kirkland. In other minor updates, the report notes that the cars have now driven a total of&#xA0;1,498,214 miles in autonomous mode, and&#xA0;1,046,386 miles in manual mode.</p>\n<p>As you can see the quick chart that we put together below, the number of miles that the cars have driven in autonomous mode seems to be growing at a fairly linear pace. Our quick calculations put the number of autonomous miles driven somewhere in the realm of 48,000 miles per month. And in March, Google/Alphabet&#x2019;s cars drove an average of 853 autonomous miles per car, with a total of 54 cars on the rode across 3&#xA0;cities.</p>\n<p><a href=\"https://9to5google.files.wordpress.com/2016/04/google-cars-autosaved-2016-04-04-09-30-501.png\" rel=\"attachment wp-att-137479\"><img title=\"Google's March self-driving car report details mapping system, a boring accident in Austin\" class=\"aligncenter size-full wp-image-137479\" src=\"https://9to5google.files.wordpress.com/2016/04/google-cars-autosaved-2016-04-04-09-30-501.png?w=1000\" alt=\"Google Cars (Autosaved) 2016-04-04 09-30-50\"></a></p>\n<p>Typically Google likes to use these reports as an opportunity to update the public on some of the cars&#x2019; technologies. This month, the report details the mapping system that they use, which according to the company captures &#x201C;a much greater level of detail than you&#x2019;d find on Google Maps.&#x201D; Google&#xA0;says that as the cars drive around town,&#xA0;the vehicles&#x2019; LIDAR &#x201C;send out pulses of light that help paint a three-dimensional portrait of the world.&#x201D; After this, the mapping team&#xA0;categorizes&#xA0;the&#xA0;features on the road to help make this info useful for the car.</p>\n<div class=\"page\" title=\"Page 2\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<blockquote><p>This level of detail helps our car know exactly where it is in the world. As our cars drive autonomously on the road, our software matches what the car sees in real-time with the maps we&#x2019;ve already built, allowing the car to know its position on the road to within 10cm of accuracy. That means we don&#x2019;t have to rely on GPS technology, or a single point of data such as lane markings, to navigate the streets.</p></blockquote>\n<p>Finally, this month&#x2019;s report details a less-than-interesting accident that happened in Austin earlier in March. According to the report, a Lexus self-driving&#xA0;vehicle was sitting still and rear-ended by a car traveling 10 MPH. The driver &#x201C;appeared disoriented&#x201D; so the Google AV test driver called 911.</p>\n<div class=\"page\" title=\"Page 3\">\n<div class=\"section\">\n<div class=\"layoutArea\">\n<div class=\"column\">\n<blockquote><p>March 14, 2016: A Google Lexus-model autonomous vehicle (&#x201C;Google AV&#x201D;) travelling westbound on W. Anderson Ln. in Austin, TX in autonomous mode was rear-ended while stopped at a traffic light. The Google AV was stopped for approximately 3 seconds behind traffic waiting at a red light at Burnet Road, when a vehicle (Volkswagen Passat) approaching from behind collided with the rear bumper of the Google AV. The Google AV&#x2019;s speed at the time of the collision was 0 mph. The other vehicle&#x2019;s approximate speed at the time of the collision was 10 mph.</p></blockquote>\n<p>Last month, Google detailed the first accident the self-driving cars were involved in that was <a href=\"http://electrek.co/2016/02/29/google-self-driving-car-first-at-fault-accident/\">actually at the fault of the Mountain View company</a>. After that accident, <a href=\"http://9to5google.com/2016/03/09/video-photos-google-self-driving-car-accident/\">footage showing how it occurred and the extent of the damage</a>&#xA0;was published on YouTube. Up to today, our numbers show that the self-driving cars have been in a total of 19 accidents. With the exception of last month&#x2019;s incident, most of these have involved slow-speed fender benders caused at stoplights by human drivers.</p>\n<p>Also last month, Alphabet&#xA0;Executive Chairman&#xA0;Eric Schmidt said that&#xA0;<a href=\"http://9to5google.com/2016/03/10/google-self-driving-car-uk/\">Google is planning to soon bring its driverless cars to the UK</a>.&#xA0;Perhaps before making its way across the Atlantic, however,&#xA0;<a href=\"http://9to5google.com/2016/01/28/four-mysterious-cities-self-driving-cars-ann-arbor/\">three more stateside cities look to soon be getting Google&#x2019;s self-driving cars</a>, and of these&#xA0;Ann Arbor, Michigan seems to be one likely&#xA0;candidate.&#xA0;According to a <a href=\"http://9to5google.com/2016/02/15/alphabet-rd-self-driving-car-ann-arbor/\">report</a> from&#xA0;Crain&#x2019;s Detroit Business, Google/Alphabet is seeking an R&amp;D site for its self-driving cars in the state.</p>\n</div>\n</div>\n</div>\n</div>\n<p>The full report can be found <a href=\"https://static.googleusercontent.com/media/www.google.com/en//selfdrivingcar/files/reports/report-0316.pdf\">at Alphabet&#x2019;s self-driving car website</a>.</p>\n</div>\n</div>\n</div>\n</div>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Stephen Hall", "url": "http://9to5google.com/2016/04/04/googles-march-self-driving-car-report/", "short_url": "http://rdd.me/nmkilzec", "title": "Google’s March self-driving car report details mapping system, a boring accident in Austin", "excerpt": "Google/Alphabet published its self-driving car report for March over the weekend, and besides of course the latest numbers (including the number of cars in each city, the total number of autonomous&hellip;", "direction": "ltr", "word_count": 689, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5google.files.wordpress.com/2016/04/google-cars-autosaved-2016-04-04-09-30-501.png?w=1000", "rendered_pages": 1, "date_published": "2016-04-04 15:45:27"}