{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Following a <a href=\"http://9to5google.com/2016/04/01/lg-g5-teardown-plastic-build/\" target=\"_blank\">teardown video</a> which seemed to show a generous layer of gray plastic on the <a href=\"http://9to5google.com/tag/lg-g5\" target=\"_blank\">LG G5</a>&#x2018;s supposed all-metal uni-body build, the Korean manufacturer has hit back, stating that it&#x2019;s not plastic at all. According <a href=\"http://www.lgnewsroom.com/2016/04/statement-regarding-material-used-in-lg-g5-uni-body-2/\" target=\"_blank\">to LG</a>, the gray substance is just &#x2018;primer&#x2019; used to insulate the metal and act as a base for applying the final finish.</p>\n\n<p>In a statement published this morning, the popular smartphone maker attempts to set records straight by explaining the manufacturing process. In it, LG states that the unibody casing is composed of a &#x201C;special aluminum alloy&#x201D;. It&#x2019;s named LM201 and was developed by LG and the Korea Institute of Industrial Technology for use in sports cars, aircraft and consumer electronic goods.</p>\n<p>It&#x2019;s a die-cast metal, meaning it&#x2019;s melted and poured in to a die/mould to give its shape, before being cooled and finished. Other aluminum smartphones use a different method. Phones like the iPhone and the <a href=\"http://9to5google.com/tag/htc-one\" target=\"_blank\">HTC One</a> series normally have their unibody chassis machined out of a solid piece of aluminum using a CNC machine.</p>\n<p>Once LG has finished the die-casting, the &#x201C;antenna slit is applied directly to the aluminum casing followed by a coating of primer&#x201D;. This primer is then covered in a &#x201C;pigment containing tiny metal particles&#x201D;. In other words, the outer surface isn&#x2019;t solid metal, but the color/paint does contain tiny particles of metal.</p>\n<blockquote><p>While both anodized aluminum and microdized aluminum will scratch if enough pressure is applied, in the case of the G5 the gray primer beneath the pigment layer may be mistaken for plastic when the coloring is scratched off. We want to reassure our customers that the uni-body of the LG G5 is&#xA0;advanced aluminum alloy, not plastic.</p></blockquote>\n<p>It&#x2019;s an interesting and detailed&#xA0;statement from the Korean tech giant. From the teardown, we know there was clearly metal being used to create the shape and structure of the device. Our questions remain around marketing it as an all-metal and uni-body device. Technically speaking, this is a metal device,&#xA0;albeit one with a generous layering of paint/polymer.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/04/lg-g5-not-plastic/", "short_url": "http://rdd.me/2svwqil0", "title": "LG: G5’s uni-body is not made from plastic, it’s primer-coated aluminum alloy", "excerpt": "Following a teardown video which seemed to show a generous layer of gray plastic on the LG G5&#x2018;s supposed all-metal uni-body build, the Korean manufacturer has hit back, stating that&hellip;", "direction": "ltr", "word_count": 337, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-04 14:55:35"}