{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>This is a pretty cool tidbit to come out of Microsoft&#x2019;s Build conference. Probably thanks to some <a href=\"http://electrek.co/2016/04/01/tesla-model-3-everything-we-know-gallery/\">much more exciting news</a> from Tesla, it went under the radar entirely. Apparently, the Redmond, Washington-based company is planning to soon let a future version of Windows 10 mirror your Android phone&#x2019;s notifications by way of the Cortana app (via <a href=\"http://www.theverge.com/microsoft/2016/3/31/11340830/microsoft-action-center-in-the-cloud-android\">The Verge</a>)&#x2026;</p>\n\n<p>The new feature was briefly mentioned during a session on day 2 of Build 2016, where&#xA0;Microsoft&#xA0;described how it&#x2019;s going work &#x2014; apparently, the notifications will even be actionable. Assumably after begging for permission to see your phone&#x2019;s notifications in full, the Cortana app will sync them up to your Windows PC, where you can reply to them, dismiss them, and more.</p>\n<p>Microsoft says that the feature will be coming to Windows&#xA0;10 Mobile devices too (what are those?), although it won&#x2019;t be coming to iOS due to its tighter restrictions. The company reportedly said that the feature&#xA0;is coming in a &#x201C;future version of Windows,&#x201D; and it&#x2019;s not clear whether or not the <a href=\"https://play.google.com/store/apps/details?id=com.microsoft.cortana&amp;hl=en\">current Cortana app</a>&#xA0;supports it.</p>\n<p>Almost certainly this feature also has ties to Microsoft&#x2019;s plays with Cyanogen, the fork-of-Android software maker that <a href=\"http://9to5google.com/2015/09/11/cyanogen-is-bringing-os-level-microsoft-cortana-integration-to-android/\">recently decided</a> to build Microsoft&#x2019;s Cortana assistant into the OS by default. If you&#x2019;re not familiar with the Cortana voice assistant, be sure to <a href=\"http://9to5google.com/2015/07/20/cortana-beta-vs-google-now-how-does-microsofts-assistant-for-android-stack-up/\">check out our video</a> where we compared it to Google Now.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Stephen Hall", "url": "http://9to5google.com/2016/04/01/cortana-android-app-windows-notifications/", "short_url": "http://rdd.me/ltiinjx8", "title": "Cortana Android app will soon let Windows 10 mirror your phone’s notifications", "excerpt": "This is a pretty cool tidbit to come out of Microsoft&#x2019;s Build conference. Probably thanks to some much more exciting news from Tesla, it went under the radar entirely. Apparently, the Redmond,&hellip;", "direction": "ltr", "word_count": 225, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-01 18:52:32"}