{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>LG G5 proudly unveiled its <a href=\"http://9to5google.com/2016/02/21/lg-g5-official/\" target=\"_blank\">newest flagship</a> at an event in Barcelona last month and didn&#x2019;t hold back lauding its &#x2018;metal build&#x2019;. We didn&#x2019;t see anything at the time to question those claims. It seems, however, that those early claims of a metal build are &#x2014; at best &#x2014; a twist on the truth and &#x2014; at worst &#x2014; deliberately misleading&#x2026;</p>\n\n<p>When we <a href=\"http://9to5google.com/2016/02/22/lg-g5-hands-on-video/\" target=\"_blank\">got our hands on</a> the phone, it looked like an all-metal phone. We even permitted the insinuation that it was the first unibody metal phone with a replaceable battery, even though the bottom edge portion could be detached, technically meaning it is not unibody.</p>\n<p><em>JerryRigEverything</em>, a YouTube channel well-known for testing smartphone durability and tearing devices&#xA0;apart gave the new LG smartphone its own full teardown which reveals all the internal components as normal. More importantly however, he took a knife to the back of the G5 and it revealed that LG&#x2019;s supposed &#x2018;metal build&#x2019; contains a whole lot of plastic.</p>\n<p>Scraping away the metal-colored finish reveals a fairly substantial layer of gray plastic bonded to a thin aluminum shell.&#xA0;We could argue that, <em>technically</em>, the <a href=\"http://9to5google.com/tag/lg-g5\" target=\"_blank\">LG G5</a>&#x2018;s outer shell is given its strength, shape and structure&#xA0;by a sheet of metal, and so it does have metal build. And yet in today&#x2019;s market, with so many actual metal phones on the market, many &#xA0;of them true unibody, suggesting that the G5 is the same as those is a huge stretch.</p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/SyP_cEpp2Zo?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<p>The takeaway is this: When you go to buy an &#x2018;all metal&#x2019; phone, there&#x2019;s an expectation that you&#x2019;ll have a solid, premium feeling phone in your hand when you pick it up. You expect the cold, hard touch of aluminum. You expect the color and finish is applied by anodising that metal and bead-blasting it. With the LG, you don&#x2019;t get that. Instead, you&#x2019;re holding on to a layer of plastic, spray-painted with a metal finish.</p>\n<p>What do you think? Is LG within its rights to advertise the G5 as a metal phone, or is it taking liberties and bordering on false advertising?</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Cam Bunton", "url": "http://9to5google.com/2016/04/01/lg-g5-teardown-plastic-build/", "short_url": "http://rdd.me/vygcu6k4", "title": "LG G5 teardown reveals a whole lot of plastic in the supposed ‘metal build’ [Video]", "excerpt": "LG G5 proudly unveiled its newest flagship at an event in Barcelona last month and didn&#x2019;t hold back lauding its &#x2018;metal build&#x2019;. We didn&#x2019;t see anything at the time to&hellip;", "direction": "ltr", "word_count": 343, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-01 09:21:14"}