{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p class=\"p1\"><span class=\"s1\">Alphabet, obviously, has a lot of mainstream products that bring in a huge amount of revenue. Google&#x2019;s ads business is clearly the front runner by a long shot, but there&#x2019;s also Android, its hardware offerings (like the Nexus line, OnHub, etc.), Play Store digital content, as well as revenue from subsidiary companies like Nest (er.. Dropcam?), Google Fiber, and others.</span></p>\n<p class=\"p1\"><span class=\"s1\">But what usually excites people the most at Alphabet are the company&#x2019;s moonshots under the umbrella of &#x201C;X&#x201D; &#x2014;&#xA0;projects that usually cost hoards of money to keep alive and bring in nothing (or next to nothing) in return. The self-driving car project, <a href=\"http://9to5google.com/tag/proejct-loon\">Project Loon</a> for worldwide internet, <a href=\"http://9to5google.com/tag/project-titan\">Project Titan</a> drones, <a href=\"http://9to5google.com/tag/makani\">Makani</a>&#x2018;s wind turbines, and <a href=\"http://9to5google.com/tag/project-wing\">Project Wing</a> air-delivery are just a few, but there are even more exciting projects that have &#x201C;graduated&#x201D; to be their own unit at the company.</span></p>\n<p class=\"p1\"><span class=\"s1\">Google has often I/O as a showcase for its favorite moonshots. The company&#x2019;s huge <a href=\"http://9to5google.com/2012/06/27/sergey-brins-google-glass-skydiver-demo-from-io-keynote-video/\">Google Glass extravaganza</a> from 2012 is the most obvious example that comes to mind, but the company has used the stage at I/O to introduce to the world some just-as-exciting technologies with much less fanfare. Google ATAP, for example, gave a separate keynote at I/O 2015 introducing a handful of projects arguably more exciting than the things Google announced on the main stage. Technically not the same as the &#x201C;moonshots&#x201D; in the X division, but they&#x2019;re in the same category in my opinion.</span></p>\n<p class=\"p1\"><span class=\"s1\">While you might be familiar with some the following projects (and that wouldn&#x2019;t surprise me, considering they&#x2019;ve all already been announced), they&#x2019;re all ambitious experiments that have been recognized, announced, and made public-facing, but have since dropped off the radar; a lot of them have gone dormant, at least from our perspective. These are projects that excite me, and I want to hear what&#x2019;s new with them come next month&#x2019;s developer conference in Mountain View&#x2026;</span></p>\n\n<p class=\"p2\"><span class=\"s1\"><b>PROJECT ARA</b></span></p>\n<p class=\"p1\"><span class=\"s1\">The first project that I want to hear about &#x2014;&#xA0;and perhaps the one that I&#x2019;m most excited to hear about &#x2014;&#xA0;is Project Ara. This is Google&#x2019;s attempt at a modular smartphone, a project that <a href=\"http://9to5google.com/2013/10/29/motorolas-atap-team-plans-to-make-modular-phones-as-well-as-cartoons-were-just-not-sure-why/\">has its roots in a time when Google owned Motorola</a>. The project has evolved into something that could turn out to be very special in my opinion, and <a href=\"http://9to5google.com/2016/03/16/opinion-is-the-samsung-galaxy-s7-the-culmination-of-the-smartphone-1-0-era/\">as we&#x2019;ve written</a>, could usher in a 2nd era of what we know the smartphone to be. Google has a unique position in this space in that it has built Android mantra to be all about diversity and unique personal experiences, and a modular phone would be a natural extension of that philosophy.</span></p>\n<p class=\"p1\"><span class=\"s1\">Project Ara has been very quiet this year, with the last we heard from the Mountain View company being of a &#x201C;re-route&#x201D; <a href=\"https://twitter.com/ProjectAra/status/631902037710475264\">announced</a>&#xA0;last year. The project was slated to be getting a market pilot in Puerto Rico last year, but that simply didn&#x2019;t happen. Everything seemed to be on track when Regina Dugan and co. were talking up the project during the Google ATAP event at I/O 15, but there haven&#x2019;t been hardly any updates besides a new logo and a video look inside the group since.</span></p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/0V9U-ZFyKLw?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<p class=\"p1\"><span class=\"s1\">Perhaps our best clue as to the state of Ara was <a href=\"https://twitter.com/ProjectAra/status/633356613613555712\">a series of tweets</a> from the group in August of last year. They give us a pretty good look at the where, when, and why of what direction Ara hopes to take over the next year. &#x201C;Where are we headed next? We are looking at a few locations in the U.S.,&#x201D; the account teased. &#x201C;When? 2016.&#x201D; &#x201C;Why? Lots of iterations&#x2026; more than we thought.&#x201D;</span></p>\n<p class=\"p1\"><a href=\"https://9to5google.files.wordpress.com/2016/03/ara1.png\" rel=\"attachment wp-att-136792\"><img title=\"Opinion: I want Google to update us on these four projects come Google I/O 2016\" class=\"aligncenter size-large wp-image-136792\" src=\"https://9to5google.files.wordpress.com/2016/03/ara1.png?w=1000&amp;h=494\" alt=\"ara1\" width=\"1000\"></a></p>\n<p class=\"p1\"><span class=\"s1\">Most recently, some <a href=\"http://9to5google.com/2016/03/28/google-opinion-rewards-project-ara/\">new questions on Google Opinion Rewards</a> seemed to be polling the public on how much it might be willing to pay for Project Ara modules. They don&#x2019;t seem to make sense at first, but questions like &#x201C;Would you be willing to pay more money for a phone that after 6 months runs faster?&#x201D; could only be referencing one thing in my book. No phone is going to just suddenly begin running faster after 6 months of use, but a modular SoC upgrade sounds like it would fit the bill.</span></p>\n<p class=\"p2\"><span class=\"s1\"><b>PROJECT AURA</b></span></p>\n<p class=\"p1\"><span class=\"s1\">According to a <a href=\"http://9to5google.com/2015/11/16/project-aura-bringing-two-screen-less-head-mounted-devices/\">report</a> out of The Information in November of last year, Google has been quietly working on three devices under the umbrella of a Project called Aura (which has since been confirmed on Alphabet&#x2019;s &#x201C;solvewithx&#x201D; website. Within Aura, there&#x2019;s the next iteration of Glass (dubbed Enterprise Edition, which we extensively detailed all last year), and two screenless head-mounted devices that primarily use audio.</span></p>\n<p class=\"p1\"><span class=\"s1\">Reports from last year mentioned that these two audio-based devices use bone conduction just like Google Glass, but notably go without the screen. They&#x2019;re like &#x201C;headphones worn on your face,&#x201D; Jessica Lessin of <em>The Information</em> said. The team that&#x2019;s building the new devices (one of which is reportedly for &#x201C;sport&#x201D; users) is reportedly targeting a release sometime in 2016, so making the project official at I/O 2016 would make sense.</span></p>\n<p class=\"p1\"><a href=\"https://9to5google.files.wordpress.com/2015/12/google-glass-enterprise-edition.png\" rel=\"attachment wp-att-127978\"><img title=\"Opinion: I want Google to update us on these four projects come Google I/O 2016\" class=\"aligncenter size-large wp-image-127978\" src=\"https://9to5google.files.wordpress.com/2015/12/google-glass-enterprise-edition.png?w=1000&amp;h=519\" alt=\"google glass enterprise edition\" width=\"1000\"></a></p>\n<p class=\"p1\"><span class=\"s1\">If you know anything about me, you know that I&#x2019;m a huge fan of this little unit at Google. Previously the Glass unit, the Aura group &#x2014;&#xA0;which is headed by Ivy Ross and advised by the <a href=\"http://9to5google.com/2016/03/24/dropcams-founder-says-that-tony-fadell-runs-nest-like-a-tyrant-bureaucrat/\">under-fire Tony Fadell</a> &#x2014;&#xA0;seems to really value the concept of a wearable that has I/O as close as possible to the senses. Glass may not have worked out as a consumer product for a variety of reasons, but I still think there&#x2019;s potential for a wearable device that uses the voice, eyes, and ears as the primary interface &#x2014;&#xA0;contrasting the smartphones of today that are mostly touch based. And it sounds like that&#x2019;s what Aura is all about.</span></p>\n<p class=\"p1\"><span class=\"s1\">On a related note, Google is working on a second iteration of Glass dubbed the Enterprise Edition which I detailed&#xA0;<a href=\"http://9to5google.com/2015/07/03/next-google-glass-2-enterprise-edition-wider-testing-later-this-year/\">across</a>&#xA0;<a href=\"http://9to5google.com/2015/07/08/google-glass-enterprise-edition-brings-larger-prism-intel-atom-cpu-battery-life-external-battery-pack/\">several</a>&#xA0;<a href=\"http://9to5google.com/2015/07/13/google-distribute-glass-enterprise-edition-exclusively-through-glass-for-work-partners/\">exclusive</a>&#xA0;<a href=\"http://9to5google.com/2015/07/21/google-glass-enterprise-edition-is-foldable-water-resistant-rugged-for-the-workplace/\">reports</a>&#xA0;last year. This device sits under the umbrella of Aura, and while it&#x2019;s certainly never going to be a consumer-facing product, it would be really nice if Google could at least confirm its existence. We&#x2019;ve seen <a href=\"http://9to5google.com/2015/12/28/this-is-google-glass-enterprise-edition-in-the-flesh-gallery/\">leaked images from the FCC</a> and there has even been a <a href=\"http://9to5google.com/2016/03/19/ebay-unannounced-google-glass-enterprise-edition/\">unit that popped up on eBay</a>, but the Mountain View company still likes to pretend that this little Glass 2.0 doesn&#x2019;t exist. I&#x2019;m hoping they will by the time I/O 16 rolls around.</span></p>\n<p class=\"p1\">Pretty much the only thing that we know for sure about Aura is <a href=\"http://9to5google.com/2016/01/13/heres-a-first-look-at-the-logo-for-googles-forthcoming-project-aura/\">what the unit&#x2019;s logo looks like</a>.</p>\n<p class=\"p2\"><span class=\"s1\"><b>PROJECT SOLI</b></span></p>\n<p class=\"p1\"><span class=\"s1\">First <a href=\"http://9to5google.com/2015/05/29/google-atap-project-soli-jacquard/\">announced at I/O 2015</a>, Project Soli is a group within ATAP building miniature radar hardware that can provide a method of controlling your wearable device without touching it. Whether you&#x2019;re using a watch, a phone, or a tablet, Soli tries to differentiate between very fine motions in the hand gestures it can detect. It uses a tiny radar sensor &#x2014;&#xA0;that the company showed off for the first time last year at Google I/O 2015 &#x2014;&#xA0;and ATAP says that it&#x2019;s the world&#x2019;s first radar that&#x2019;s small enough to fit inside a wearable.</span></p>\n<p class=\"p1\"><span class=\"s1\">Sound exciting?</span></p>\n<p class=\"p1\"><span class=\"s1\">If not, then you probably need to watch the Project Soli announcement video. The implications of this project are huge, as wearables are still in a state of limbo in terms of usefulness. Many have already dubbed the Apple Watch a flop, and Android Wear devices just aren&#x2019;t selling that well. I&#x2019;ve written <a href=\"http://9to5google.com/2015/08/25/opinion-sadly-i-still-dont-have-a-reason-to-wear-my-android-wear-smartwatch/\">many times</a> about how I just don&#x2019;t have much use for a smartwatch, and many of my peers have echoed similar sentiments. Quite frankly, Android Wear just isn&#x2019;t that good yet &#x2014; but Project Soli could change everything.</span></p>\n<p class=\"p1\"><span class=\"s1\">On stage at I/O, Google showed off this little sensor that could evolve the way we interact with wearables. ATAP showed how the sensor could detect extremely precise motion of a finger even several inches above a wearable screen. Perhaps the demo that still sticks with me today was how the radar could be used to change the time on an imaginary device without touching the screen. Just as you would with a real watch, Soli lets you use your fingers to interact with the device in the air in 3D space rather than on a 2D touch screen panel.</span></p>\n<p class=\"p1\"><span class=\"s1\">Watch this video:</span></p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/0QNiZfSsPc0?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<p class=\"p1\"><span class=\"s1\">If ATAP shares updates on its projects at I/O this year (which they will), this is going to be the one to look for. And if Google somehow has managed to cram this into a prototype watch already, I&#x2019;ll probably jump up and down in excitement.</span></p>\n<p class=\"p2\"><span class=\"s1\"><b>PROJECT JACQUARD</b></span></p>\n<p class=\"p1\"><span class=\"s1\">Similar to Project Soli, ATAP&#x2019;s <a href=\"http://9to5google.com/2015/05/29/google-atap-project-soli-jacquard/\">Project Jacquard</a> aims to reimagine how we interact with our devices of all kinds &#x2014;&#xA0;but specifically wearables. But rather than detecting precise hand motions in open space using radar technology like Soli, Jacquard is more about weaving a very high-tech capacitive touch screen into the very low-tech fabrics that we wear on our bodies every day. It&#x2019;s a new take on what &#x201C;wearable&#x201D; means.</span></p>\n<p class=\"p1\"><span class=\"s1\">With Project Soli, Google wants to increase the bandwidth of interactions you have with a wearable device using your fingers in the air, but Jacquard rather intends to increase the surface area of the wearable without changing its hardware. Instead of touching the watch itself, for example, Jacquard would allow you to interact with a device on your wrist by touch the fabric on your shirt&#x2019;s collar.</span></p>\n<p class=\"p1\"><span class=\"s1\">If you&#x2019;re not familiar:</span></p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/qObSFfdfe7I?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<p class=\"p1\"><span class=\"s1\">This one doesn&#x2019;t make me as excited as Soli, but it&#x2019;s still a really neat concept. And, with everything in our lives getting smarter and internet-connected, it&#x2019;s only a matter of time before we have Bluetooth shirts, right? I have a really hard imaging that Jacquard would be practical in many situations, but it&#x2019;s still an ambitious project and one that we have heard exactly zero updates on since I/O 2015. I want to hear more.</span></p>\n<p class=\"p2\"><span class=\"s1\"><b>SOMETHING NEW</b></span></p>\n<p class=\"p1\"><span class=\"s1\">But beyond these four projects, I want to hear about something that we&#x2019;ve never heard about before. Glass came out of nowhere and quickly became a spectacle that Google probably regrets today, but it still brought excitement about the development of new and innovative technologies. I&#x2019;m sorry I keep talking about Glass (in this post and in general), but it&#x2019;s just my favorite example of what I love about Google. Because while it didn&#x2019;t work out, it was an embodiment of the company&#x2019;s &#x2014;&#xA0;or at least its X division&#x2019;s &#x2014;&#xA0;<a href=\"http://money.cnn.com/2015/03/18/technology/google-x-astro-teller-sxsw/\">&#x201C;fail fast&#x201D; mantra</a>. Glass attempted to solve of a problem of technology getting in the way of our lives, and it failed. And that&#x2019;s fine. I want more of that.</span></p>\n<p class=\"p1\"><span class=\"s1\">Google has had its self-driving car under development for many years now, and it&#x2019;s another example of initiative and dreaming at Google that blows my mind. The project, which had its roots more than a decade ago in a small team led by the co-inventor of Google Street View Sebastian Thrun, was so ridiculously far ahead of its time. Google didn&#x2019;t start talking much about the project publicly until much later in 2012, but there were many years of unseen and unheard tireless efforts that went into it before we got to see the second-generation all-electric &#x201C;prototypes&#x201D; that the company is driving around on roads today.</span></p>\n<p class=\"p1\"><span class=\"s1\">What moonshot projects might Google have up its sleeves to tell us about this year? Notably, this year marks the 10 year anniversary of the first Googleplex developer day, and the event will be held at Google&#x2019;s campus in Mountain View for the first time in many years. That may or may not make any difference at all in regards to what Google shows off this year, but regardless we&#x2019;re bound to hear about something the company is working on that we haven&#x2019;t heard about yet. Google loves the press it gets from I/O, and they usually deliver. That&#x2019;s exciting to me.</span></p>\n<p class=\"p1\">What about you? What Google projects do you want to hear more about?</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Stephen Hall", "url": "http://9to5google.com/2016/03/31/opinion-google-four-projects-io-2016/", "short_url": "http://rdd.me/klqghkvg", "title": "Opinion: I want Google to update us on these four projects come Google I/O 2016", "excerpt": "Alphabet, obviously, has a lot of mainstream products that bring in a huge amount of revenue. Google&#x2019;s ads business is clearly the front runner by a long shot, but there&#x2019;s also Android,&hellip;", "direction": "ltr", "word_count": 1946, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5google.files.wordpress.com/2015/12/google-glass-enterprise-edition.png?w=1000&h=519", "rendered_pages": 1, "date_published": "2016-03-31 22:46:58"}