{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p><a href=\"http://9to5google.com/tag/google-now\">Google Now</a> is a powerful tool. Combining the huge databases at the company&#x2019;s disposal alongside the incredible amount of information it can pull &#x2013; once granted access &#x2013; from a customer&#x2019;s usage of its many services, there are dozens of things that <a href=\"http://9to5google.com/tag/google\">Google</a> can help you with. Its power goes from answering to simple questions and completing easy requests to solving increasingly complex tasks that require a combination of the above to give more tailored and specific results.</p>\n<p>In a somewhat curious outcome, <a href=\"https://www.reddit.com/r/Android/comments/4cpabs/google_now_just_blew_my_mind_again/\">Reddit user barney13 asked Google</a> to show him some pictures from his trip to Nice, France, which while promptly showing the user&#xA0;correct results about his question also pulled out a snippet from an email which seemed oddly and yet particularly related to the request&#x2026;</p>\n\n<p>As barney13 explained in the comments, his father passed away in an unfortunate accident which took place during that trip in Nice. When asking Google to show him some related pictures, Now unexpectedly read out loud an extract from an email, which says:</p>\n<blockquote><p>Firstly let me express my deepest sympathy to you, your mum and the whole family at your loss. Your Dad was a fantastic man as I am sure you already know and&#x2026;</p></blockquote>\n<p>Further in the comments, the redditor made it clear that the email &#x2013; visible to him and him only &#x2013; was not picked at random, as at the time he was receiving &#x2018;a flurry&#x2019; of emails regarding his father&#x2019;s passing; most notably, however, he specifically mentioned that the email from which the extract had been taken was both quite long and personal, (referring to specific names, episodes and places) making the selected snippet&#xA0;weirdly adequate&#xA0;for a potentially unsettling situation.</p>\n<p>While it&#x2019;s easy to see that Google may have simply connected the dots using the available data &#x2013; and thus matching the location and the time of the photos with the email received &#x2013; it is still curious to see that it managed to pick such a specific and appropriate paragraph (not even the first one) from one of several emails. Were some specific&#xA0;criteria used, or is it just a bizarre coincidence?</p>\n<p>User barney13 also shot a demonstration video, which you can check out below.</p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/l6vPZx2VVp4?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5google.com", "author": "Edoardo Maggio", "url": "http://9to5google.com/2016/03/31/google-now-might-have-intentionally-shown-this-man-a-gesture-of-sympathy-video/", "short_url": "http://rdd.me/7eyrphsj", "title": "Google Now might have intentionally shown this man a gesture of sympathy [Video]", "excerpt": "Google Now is a powerful tool. Combining the huge databases at the company&#x2019;s disposal alongside the incredible amount of information it can pull &#x2013; once granted access &#x2013; from a&hellip;", "direction": "ltr", "word_count": 364, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-03-31 21:34:17"}