{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Following the release of the <a href=\"http://9to5mac.com/2016/04/07/reddit-iphone-app-ios-app/\">official Reddit iOS app last week</a>, Apple today has pulled a handful of third-party Reddit clients from the App Store. While the change appears to be unrelated to the launch of the official Reddit client, it&#x2019;s a surprise nonetheless. As for its reasoning for removing the apps, Apple says they violate clause 18.2 of the App Review Guidelines, which relates to NSFW content&#x2026;</p>\n\n<p>In a <a href=\"https://www.reddit.com/r/apple/comments/4edau1/psa_apple_pulled_narwhal_and_others_from_the_app/\">thread on Reddit</a>, users quickly pointed out that many third-party clients for browsing the service were removed from the App Store this evening with Apple citing that they contain &#x201C;user generated content that is frequently pornographic.&#x201D;</p>\n<p>While many were quick to speculate that perhaps Reddit had asked Apple to pull the apps from the App Store in an effort to drive usage of its official client, the developer behind popular Reddit client Narwhal says that is not the case. &#x201C;Reddit did not request this. This is solely because of Apple,&#x201D; he wrote.</p>\n<p>Aditoanlly, the developer behind the Eggplant Reddit client also had his app pulled. When he reached out to Apple, he was informed that he needed to remove the NSFW toggle that is within his app, as well as all NSFW content. By default, the displaying of NSFW content is disabled in Eggplant. Here is what Apple said to the developer of Eggplant:</p>\n<blockquote><p>It is not appropriate to display pornographic content. It would be appropriate to remove the toggle and pornography present within the app</p></blockquote>\n<p>On the other hand, however, Reddit itself was asked to update the two apps it is responsible for, Reddit Official and Alien Blue, to remove the &#x201C;Safe for Work Browsing&#x201D; toggle, but not the actual NSFW content. This is odd because Apple requested that Reddit add that toggle originally.</p>\n<p>From Reddit:</p>\n<div class=\"usertext-body may-blank-within md-container \">\n<div class=\"md\">\n<blockquote><p>We were asked to update our apps (AB and Reddit Official) to remove the &#x201C;Safe for Work Browsing&#x201D; toggle. This is a feature we previously refined with Apple&#x2019;s help. We were surprised by the notice.</p>\n<p>We just resubmitted our build. We were not informed that Apple would be removing other apps. We were very upset to see that they did. Honestly, if we were interested in getting rid of 3rd party apps (which we&#x2019;re not!!!), this would be the stupidest possible way to accomplish it.</p>\n<p>We suggest all 3rd party apps similarly remove settings for safe for work browsing.</p></blockquote>\n</div>\n</div>\n<p>It&#x2019;s odd that Apple would remove all of the third-party apps from the App Store, but not the official client. Nevertheless, it&#x2019;s good to see that Reddit itself was not behind the removal of the third-party apps.</p>\n<p>We&#x2019;ve reached out to Apple for comment and will update if we hear back.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/11/apple-removes-third-party-reddit-clients-from-the-app-store-due-to-nsfw-content/", "short_url": "http://rdd.me/qr5gvqo5", "title": "Apple removes third-party Reddit clients from the App Store due to NSFW content", "excerpt": "Following the release of the official Reddit iOS app last week, Apple today has pulled a handful of third-party Reddit clients from the App Store. While the change appears to be unrelated to the&hellip;", "direction": "ltr", "word_count": 446, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-12 04:21:29"}