{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p class=\"p1\"><span class=\"s1\">Microsoft is <a href=\"http://blogs.msdn.com/b/translation/archive/2016/04/07/microsoft-translator-now-offers-the-most-comprehensive-translation-solution-for-the-ios-ecosystem.aspx\" target=\"_blank\">updating</a> its Translator app today with some notable features, including support for offline translations, that could give it the upper hand on Google and the competition.</span></p>\n\n<p class=\"p1\"><span class=\"s1\">The standout feature of the update is support for offline translations, meaning you won&#x2019;t need an Internet connection at all, and the company notes the addition of that&#xA0;feature should make Microsoft Translator one of the better free offerings around.</span></p>\n<p class=\"p1\"><span class=\"s1\">Like similar offline features, you&#x2019;ll need to first download content packs that will store the necessary data to do the translations locally without Internet. Microsoft said you can expect &#x201C;near online-quality translations&#x201D; with the new feature. </span></p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">Until now, iPhone users needed an Internet connection if they wanted to translate on their mobile devices. Now, by downloading the Microsoft Translator app and the needed offline language packs, iOS users can get near online-quality translations even when they are not connected to the Internet. This means no expensive roaming charges or not being able to communicate when a data connection is spotty or unavailable.</span></p>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">In addition, the updated Microsoft Translator app is also getting support for webpage translations today via a new Safari extension:</span></p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">After you have turned your extension on, whenever you find yourself on a webpage in a language you don&#x2019;t understand, just click on &#x201C;Microsoft Translator&#x201D; from your list of available extensions and it will be translated automatically.</span></p>\n</blockquote>\n<p class=\"p1\"><span class=\"s1\">And lastly, the app gets support for 34 new languages alongside the new features today (<a href=\"https://www.microsoft.com/en-us/translator/languages.aspx\" target=\"_blank\">full list here</a>). </span><span class=\"s1\">You can download the updated <a href=\"https://geo.itunes.apple.com/us/app/microsoft-translator/id1018949559?mt=8&amp;at=11l3Qv\"><span class=\"s2\">Microsoft Translator app for iPhone</span></a>&#xA0;on the App Store now. </span></p>\n<blockquote>\n<h4>What&#x2019;s New in Version 2.13</h4>\n<p>&#x2013; Download language packages to access translation services without Internet connectivity in 40+ languages including Arabic, Chinese, Spanish, Portuguese, Japanese, and Korean.\n&#x2013; Translate text in web pages using our Safari Extension by turning it on in app settings</p></blockquote>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Jordan Kahn", "url": "http://9to5mac.com/2016/04/08/microsoft-translator-iphone-offline-safari-extension/", "short_url": "http://rdd.me/vwnkxbnz", "title": "Microsoft releases updated Translator app for iPhone w/ offline support & Safari extension", "excerpt": "Microsoft is updating its Translator app today with some notable features, including support for offline translations, that could give it the upper hand on Google and the competition. The standout&hellip;", "direction": "ltr", "word_count": 301, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-08 16:28:07"}