{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>SteelSeries is well known around Apple circles for its iOS and Apple TV gaming controllers, but the company specializes in other gaming-related hardware ventures as well, such as mice, headsets and keyboards.</p>\n<p>After browsing SteelSeries&#x2019; site to find some information on its <a href=\"http://9to5mac.com/2015/10/27/hands-on-steelseries-nimbus-first-made-for-apple-tv-game-controller/\">popular Nimbus controller</a>, I stumbled upon its keyboard line. Anyone that knows me understands that I have a special affinity for mechanical keyboards, and that&#x2019;s exactly&#xA0;what I found on the SteelSeries website.</p>\n<p>The Danish hardware manufacturer&#x2019;s marquee mechanical keyboard, the <a href=\"http://amzn.to/1Vc0Ho6\">SteelSeries Apex M800</a>, is not your ordinary mechanical keyboard. It&#x2019;s a fully customizable, gaming-centric experience that lets you assign an overwhelming variety of functionality and colors to individual keys. While the Apex M800 ships configured for Windows, it&#x2019;s fully compatible with the Mac, and even comes with OS X key cap replacements.\n\t<ins class=\"adsbygoogle author_ad\"></ins>\n\n\t\t\n</p>\n<h2>The Mechanics</h2>\n<p>Bells and whistles aside, the actual typing experience trumps everything else when its comes to mechanical keyboards. If a&#xA0;keyboard isn&#x2019;t any good from a typing standpoint, then&#xA0;nothing else matters.</p>\n<p>Fortunately, I can say that the SteelSeries Apex M800 is a pleasure to type on. It doesn&#x2019;t use the popular Cherry MX mechanical switches found in many of today&#x2019;s popular keyboards; instead, it uses SteelSeries&#x2019; own proprietary switches. The&#xA0;Cherry MX brown switches are my favorite mechanical switches, and these feel very similar.</p>\n<p>To be honest, it took some time for me to get used to typing on the Apex M800. That had less to do with the switches, and more to do with the six dedicated macro buttons found on the left side of the chassis.</p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/US70gJmVKvA?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<p>I have a slightly unorthodox typing style, and as a result,&#xA0;the presence of the macro keys threw me off a little bit. I figured out that by resting my pinky finger between the macro keys and the rest of the keyboard, I could regain my natural typing position. After that, it was business as usual and the typos&#xA0;started to drop off considerably.</p>\n<p>As I mentioned, the keyboard switches feel similar to the popular Cherry MX brown switches. SteelSeries has employed its own &#x201C;QS1&#x201D; switches which feature a 3mm throw depth, and 1.5mm reset and actuation with no deadline.</p>\n<p>That might not mean a lot to anyone who isn&#x2019;t really into mechanical keyboards, but let&#x2019;s just say that the Apex M800 is comfortable to type on and isn&#x2019;t too loud. The sound of the key presses are&#xA0;very much like Cherry MX brown switches, which is a good thing. It&#x2019;s definitely louder than typing on the MacBook&#x2019;s chiclet keyboard, but you&#x2019;re not going to annoy your family by the clicking sound of&#xA0;overly loud switches.</p>\n<h2>Customization</h2>\n<p>The SteelSeries Apex M800 is a customizer&#x2019;s dream keyboard. It features an insane amount of key binding customization, which allows you to reassign keys, assign OS-level functions to individual keys, create your own macros, launch apps directly from a single keypress, and much, much more.</p>\n<p>SteelSeries&#x2019; Engine 3 software, which is a requirement for customizing the Apex M800,&#xA0;makes it all possible.&#xA0;Not only can you customize the functionality of each of the six macros on the keyboard, but you can also customize every key on the keyboard&#x2019;s surface.</p>\n<p><img title=\"Review: SteelSeries Apex M800 mechanical keyboard with individual key LED illumination\" class=\"alignnone size-full wp-image-426647\" src=\"https://9to5mac.files.wordpress.com/2016/04/apex-m800-key-bindings.jpg?w=1000&amp;h=396\" alt=\"Apex M800 Key Bindings\" width=\"1000\"></p>\n<p>But customization doesn&#x2019;t stop with functionality. The most noticeable thing about this keyboard is its support for individual key RGB illumination. Yes, every single key (and even the logo) features its own individual LED that rests right beneath the center surface of the keycap. This gives the Apex M800 a uniform look when it comes to lighting.</p>\n<p>The same software used for assigning key bindings is used to configure key illumination. The experience of customizing the key colors is almost like Photoshop, in that you can copy, paste, and even use an eyedropper tool to pull properties from other keys to assign to another.</p>\n<p>You can select and color individual keys, multiple keys at once, and even the SteelSeries logo. You can then apply individual colors using a color palette, or by using hexadecimal values for more exact coloration. Needless to say, you can get extremely creative with the incredibly deep color customization process afforded by SteelSeries Engine 3.</p>\n<p><img title=\"Review: SteelSeries Apex M800 mechanical keyboard with individual key LED illumination\" class=\"alignnone size-full wp-image-426649\" src=\"https://9to5mac.files.wordpress.com/2016/04/apex-m800-illumination1.jpg?w=1000&amp;h=396\" alt=\"Apex M800 Illumination\" width=\"1000\"></p>\n<p>But it doesn&#x2019;t stop there. SteelSeries has included templates and effects that can make the keyboard stand out even more. For example, you can apply a breathe effect to make it look as if the keyboard is alive as it shifts through the gradient of colors that you assign to it.</p>\n<p>All of the settings, both key bindings and illumination, can be saved to configurations and switched to on the fly. This is handy for establishing specific templates for the apps or games that you play. You can even use SteelSeries&#x2019; CloudSync feature to ensure your configurations&#xA0;can move fluidly between computers.</p>\n<h2>Additional points of interest</h2>\n<p>The SteelSeries Apex M800 features some thoughtful design decisions. For one, the USB cable is braided for added durability and less tangles.&#xA0;The keyboard also includes an area beneath it for routing cables underneath without causing needless interface.</p>\n<p>For those of you particularly interested in its lighting effects, the M800 features LED accent lighting on its side for an even sleeker looking setup, especially when using it in dark environments.</p>\n<p><img title=\"Review: SteelSeries Apex M800 mechanical keyboard with individual key LED illumination\" class=\"alignnone size-full wp-image-426650\" src=\"https://9to5mac.files.wordpress.com/2016/04/steelseries-apex-m800-desktop.jpg?w=1000&amp;h=542\" alt=\"SteelSeries Apex M800 Desktop\" width=\"1000\"></p>\n<p>The Apex M800 is big. It&#x2019;s about six inches wider than the entire body of a 15&#x2033; MacBook Pro, and less than three inches shorter. It&#x2019;s heavy too, at a little over three pounds. Coupled with its braided wire that can take up to two USB ports on your Mac, it&#x2019;s not exactly minimalistic. True, most people don&#x2019;t buy mechanical wired keyboards because they&#x2019;re looking to be minimalistic, but it&#x2019;s something to keep in mind.</p>\n<h2>Gripes</h2>\n<p>The overall build quality of the Apex M800 is good, but I did want to mention the key caps in particular. I found the caps, which are removable by hand, to be a little lacking when compared to other mechanical keyboards that I&#x2019;ve tried in this price range.</p>\n<p>Instead of using a tool for removing the key caps, you simply pop them off by hand. The sound that&#x2019;s emitted as the caps pop off didn&#x2019;t exactly instill confidence in me with regard to build quality. I did notice that over time, the popping sound emitted when removing key caps wasn&#x2019;t as alarming. Perhaps they just need to be broken in.</p>\n<p>To be clear, the keys feel solid when installed on the switches, so this probably isn&#x2019;t a big deal for most. That said, it&#x2019;s something to be aware of if you plan on replacing or rearranging key caps often.</p>\n<p><img title=\"Review: SteelSeries Apex M800 mechanical keyboard with individual key LED illumination\" class=\"alignnone size-full wp-image-426645\" src=\"https://9to5mac.files.wordpress.com/2016/04/qs1-switches-apex-m800.jpg?w=1000&amp;h=561\" alt=\"QS1 Switches Apex M800\" width=\"1000\"></p>\n<p>The keyboard itself is all plastic, albeit solid plastic. At this price range, however, I wish that SteelSeries would have employed another material on at least some of the keyboard&#x2019;s surface. For instance, a magnesium alloy would have felt more justified at this price range.</p>\n<p>Lastly, the inclusion of USB ports is nice, but the ports are USB 2.0 only. I won&#x2019;t go as far as to label USB 2.0 as worthless, but it&#x2019;s not exactly something I&#x2019;d expect on a keyboard costing nearly $200. That significantly reduces the peripherals that you might be willing to use with such a connection. I&#x2019;m thinking mice, bluetooth dongles, and not much else.</p>\n<h2>It&#x2019;s not just for gamers</h2>\n<p>The conclusion of the matter is that the Apex M800 isn&#x2019;t just for gamers. Although it took me a day or so of typing to get fully used to it, I can say that I&#x2019;m truly enjoying the overall typing experience on this keyboard.</p>\n<p>The most important thing about a mechanical keyboard is without a doubt the switches and the way the key caps feel when interfacing with those switches. These aren&#x2019;t the popular Cherry MX switches, but SteelSeries&#x2019; custom QS1 switches make the Apex M800 a pleasure to type on.</p>\n<p>Yes, this keyboard was primarily designed with gaming in mind, but the customization element isn&#x2019;t just beneficial for gamers. I&#x2019;m finding that the key bindings while used in conjunction with the individual LED color assignments, make for a pretty awesome experience when using Mac apps like Final Cut Pro X and Logic Pro X. I now have dedicated macros with custom key colors for recording voiceovers, creating compound clips, applying specific effects, and more. Even for day to day functions like taking screenshots, I find this keyboard&#x2019;s dedicated macro keys and software to be useful.</p>\n<p>True, not everyone will like the idea of putting a massive keyboard on their desk, but if you have the real estate and the proper use-case-scenarios, the <a href=\"http://amzn.to/1Vc0Ho6\">SteelSeries Apex M800, at around $178 on Amazon</a>&#xA0;is certainly worth considering.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Jeff Benjamin", "url": "http://9to5mac.com/2016/04/08/review-steelseries-apex-m800-mechanical-keyboard-led-keys-macros/", "short_url": "http://rdd.me/fpowo8mq", "title": "Review: SteelSeries Apex M800 mechanical keyboard with individual key LED illumination", "excerpt": "SteelSeries is well known around Apple circles for its iOS and Apple TV gaming controllers, but the company specializes in other gaming-related hardware ventures as well, such as mice, headsets and&hellip;", "direction": "ltr", "word_count": 1417, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/apex-m800-key-bindings.jpg?w=1000&h=396", "rendered_pages": 1, "date_published": "2016-04-08 16:45:47"}