{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>The San Bernardino iPhone case over encryption may be over for now after the FBI managed to <a href=\"http://9to5mac.com/2016/03/28/fbi-accesses-data-on-terrorists-iphone-without-apple/\" target=\"_blank\">break into the iPhone 5c</a> used by one of the shooters, but the same isn&#x2019;t true for another high-profile case in New York involving an encrypted iPhone that cannot be unlocked. <em>Bloomberg</em> <a href=\"http://www.bloomberg.com/news/articles/2016-04-08/u-s-presses-ahead-with-appeal-in-brooklyn-iphone-privacy-case\" target=\"_blank\">reports</a>&#xA0;that the United States Department of Statement has decided to indeed continue its demand that Apple help unlock the encrypted iPhone of an alleged drug dealer.</p>\n<blockquote><p>The U.S. government is pressing a demand that Apple Inc. help it crack a drug dealer&#x2019;s phone in Brooklyn, New York, even after it said it successfully accessed a California shooter&#x2019;s iPhone without the company&#x2019;s help.</p></blockquote>\n\n<p>The decision comes after a&#xA0;magistrate judge in New York <a href=\"http://9to5mac.com/2016/02/29/apple-encryption-new-york/\" target=\"_blank\">decided back in February</a> that the government cannot force Apple to unlock the iPhone, something Apple has argued would require creating a new version of its iOS software that would put all its customers at risk.</p>\n<p>Then<a href=\"http://9to5mac.com/2016/03/07/doj-fighting-ny-ruling-that-said-all-writs-act-cant-be-used-to-force-apple-to-unlock-an-iphone/\" target=\"_blank\"> last month</a> we learned that the DOJ would indeed be continuing to pursuit&#xA0;the court&#x2019;s help in mandating that Apple unlock the iPhone in question against its will despite the previous ruling. It was unclear, however, if the development of the FBI unlocking the San Bernardino iPhone would spill over into the New York case and make the court case unnecessary.</p>\n<p>The FBI has since said as much that the exploit used to access the San Bernardino iPhone is only effective against the iPhone 5c (and presumably earlier) and not the iPhone 5s and later, which includes a Secure Element that increases hardware and software security.</p>\n<p>Today&#x2019;s development that the Department of Justice will indeed push forward on going through the court system to require Apple to unlock a different encrypted iPhone seems to&#xA0;<a href=\"http://9to5mac.com/2016/03/30/apple-fbi-new-york-case/\" target=\"_blank\">validate</a>&#xA0;the FBI&#x2019;s statement.</p>\n<p>While this case doesn&#x2019;t seem to be quite as heated as the San Bernardino iPhone one, the same principles apply and it&#x2019;s clear that the debate over encryption, privacy, and security isn&#x2019;t going anywhere anytime soon. We&#x2019;ll continue tracking the case.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Zac Hall", "url": "http://9to5mac.com/2016/04/08/doj-ny-iphone-encryption-case/", "short_url": "http://rdd.me/xhx3zznh", "title": "DOJ will pursue NY iPhone encryption case in court, suggesting FBI hacking method doesn’t apply", "excerpt": "The San Bernardino iPhone case over encryption may be over for now after the FBI managed to break into the iPhone 5c used by one of the shooters, but the same isn&#x2019;t true for another&hellip;", "direction": "ltr", "word_count": 332, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-08 15:27:25"}