{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>I said in the <a href=\"http://9to5mac.com/2016/04/05/iphone-se-diary-decision-time/\" target=\"_blank\">final part</a> of my <a href=\"http://9to5mac.com/tag/iphone-se-diary/\" target=\"_blank\">iPhone SE diary</a> that perceptions of iDevices are very personal, in part because of the role the product plays within our own personal Apple ecosystem &#x2013; and that&#x2019;s equally true here.</p>\n<p>For someone who likes to draw, or handwrite, Apple Pencil support makes the upgrade from an earlier iPad a no-brainer. You&#x2019;re getting a huge amount of additional functionality for your money. You could say that you&#x2019;re getting an iPad Air 2 plus a sophisticated electronic sketching device, all in one box.</p>\n<p>But I can&#x2019;t&#xA0;draw, and I haven&#x2019;t handwritten anything for years. So for me, the upgrade from my iPad Air is a less dramatic one. The question is whether the relatively modest enhancements can justify the fairly stiff increase in price &#x2026; ?</p>\n\n<p>Apple products hold their value well, but let&#x2019;s be honest here: any time you upgrade a year-old product for the latest model, you&#x2019;re going to take a financial hit. The resale value of last year&#x2019;s device will be decent, but you still need to throw in a non-trivial amount of&#xA0;cash to make up the difference.</p>\n<p>But&#xA0;anyone upgrading from the iPad Air 2 to the same-size iPad Pro is taking a double-hit: the depreciation on the old model, plus the fairly significant price hike on the new one.</p>\n<p>I talked <a href=\"http://9to5mac.com/2016/03/31/9-7-inch-ipad-pro-diary-day-one-first-impressions/\" target=\"_blank\">last time</a> about the differences between the two models, and my first impressions of each. This second diary piece is going to be relatively&#xA0;short by my standards because, in truth, I have little to add. The differences that impressed me last time continued to impress me, and &#x2013; with one exception I&#x2019;ll get to shortly &#x2013; the things I considered irrelevant to me remained irrelevant.</p>\n<p>Let&#x2019;s start with a brief recap of the things that impressed me &#x2026;</p>\n<p><img title=\"9.7-inch iPad Pro diary: Decision time, and my limited street cred is gone forever...\" class=\"aligncenter size-full wp-image-426697\" src=\"https://9to5mac.files.wordpress.com/2016/04/ipad-pro-9-7-17.jpg?w=1000&amp;h=158\" alt=\"ipad-pro-9.7-17\" width=\"1000\"></p>\n<p>The first was the four-speaker sound system. I tried it as a table-top Netflix device and yes, the speakers are more than up to the job. For music, the quality of course remains lo-fi &#x2013; this is a tablet, not a sound system &#x2013; but no-one could have any complaints about the volume.</p>\n<p>I remarked before on the non-symmetrical speaker grilles. When holding the iPad Pro in landscape mode with the Home button on the right, you have 24 holes on the left and 14 on the right. One reader wondered whether that would lead to unbalanced sound, and the answer is yes, slightly. My estimate of the mid-point of the sound is maybe 10% to the left of the centre of the screen. But that estimate was arrived at by sitting there listening for it. In everyday use, I didn&#x2019;t notice it at all.</p>\n<p>There&#x2019;s one other nice touch with the speakers. The iPad always directs the higher frequencies to the top speakers, whether you&#x2019;re holding it in landscape or portrait orientation. I can&#x2019;t think of a reason I&#x2019;d ever be listening to anything in portrait mode, but hey, it&#x2019;s technology!</p>\n<p><img title=\"9.7-inch iPad Pro diary: Decision time, and my limited street cred is gone forever...\" class=\"aligncenter size-full wp-image-426692\" src=\"https://9to5mac.files.wordpress.com/2016/04/ipad-pro-8.jpg?w=1000&amp;h=137\" alt=\"ipad-pro-8\" width=\"1000\"></p>\n<p>The reduced reflectivity made more of a difference than expected. I tried the two iPads side-by-side in a range of different environments, and for things like a window seat on a train, the lower reflective index of the iPad Pro was really noticeable.</p>\n<p>The increased brightness, however, had less of an impact&#xA0;than I&#x2019;d expected. I did think that it might enable me to use it on a lower brightness setting and thus boost battery-life, but in practice I ended up setting it only very slightly lower than my Air 2. Perhaps it&#x2019;s one of those things where, once you&#x2019;ve experienced the extra brightness, you don&#x2019;t want to give it up.</p>\n<p>Battery-life, then, was unchanged. I didn&#x2019;t run it down completely, but&#xA0;my rule of thumb for iPads has been around 10% of battery usage per hour, and that&#x2019;s what I continued to see on the Pro.</p>\n<p><img title=\"9.7-inch iPad Pro diary: Decision time, and my limited street cred is gone forever...\" class=\"aligncenter size-full wp-image-426693\" src=\"https://9to5mac.files.wordpress.com/2016/04/ipad-pro-51.jpg?w=1000\" alt=\"ipad-pro-5\"></p>\n<p>Apple claims that the latest screen has a wider color gamut. I&#x2019;m honestly not seeing it. What I reported last week was more saturated colors, and that&#x2019;s what I&#x2019;ve continued to see.</p>\n<p>I&#x2019;m not a great fan of over-saturated colors, especially as I do use my iPad as a mobile photo-viewing device.&#xA0;I wondered whether or not I&#x2019;d get used to it, and the answer is that yes, I did. I definitely wouldn&#x2019;t want to do any photo-editing on the Pro, as I think you&#x2019;d then end up with washed-out colors when viewed on most screens, but for viewing it proved fine. Cleverly, though, the iPad <a href=\"https://twitter.com/iMuggle/status/718434824114069504\" target=\"_blank\">disables</a> True Tone in photo-editing apps. I confirmed this works in Lightroom.</p>\n<p>But the screen enhancement that impressed me most on first use was the one that continued to impress me most: the True Tone feature, where the iPad automatically adjusts the color temperature of the screen to match the ambient lighting. For convenience, I&#x2019;ve inserted above the same photo I used to illustrate the difference last time. Under the yellow-ish halogen lighting, the Air 2 screen looks distinctly blue, while the Pro screen looks neutral.&#xA0;I found this applied in every lighting I experienced.</p>\n<p>Steve Jobs famously said that people don&#x2019;t know what they want until you show it to them, and True Tone is a fantastic example. If you&#x2019;d asked me what improvements I&#x2019;d want Apple to make to the Air 2, never in a million years would I have said &#x2018;match the color temperature of the screen to the environment.&#x2019; But now that I&#x2019;ve experienced it, I find it very slightly painful to go back.</p>\n<p><img title=\"9.7-inch iPad Pro diary: Decision time, and my limited street cred is gone forever...\" class=\"aligncenter size-full wp-image-426694\" src=\"https://9to5mac.files.wordpress.com/2016/04/um.jpg?w=1000&amp;h=521\" alt=\"um\" width=\"1000\"></p>\n<p>Ok, here&#x2019;s where we get to the embarrassing part. I said last time that the 12MP still camera and 4K video recording capability was completely irrelevant to me as I&#x2019;ve never taken a photo with an iPad in my life. But I would, I said, try some in the cause of science. This was a mistake.</p>\n<p>Zac already confessed to <a href=\"http://9to5mac.com/2016/04/06/ipad-pro-photography-tips/\" target=\"_blank\">taking photos with his</a>, but that was in the privacy of his own home. I, on the other hand, was doing it in public.&#xA0;Worse, a friend captured the evidence &#x2013; albeit in the form of a rather grainy low-light photo from her iPhone 5s.</p>\n<p>But, ashamed as I am to admit it, I actually found that the iPad makes rather a good camera. The large screen means it&#x2019;s like looking through a picture frame, or the glass plate of an old-fashioned <a href=\"https://en.wikipedia.org/wiki/View_camera\" target=\"_blank\">view camera</a>.</p>\n<p>While I do use my iPhone for everyday snaps, I still prefer to use a dedicated camera &#x2013; a DSLR when quality trumps all, and my very capable Sony a6000 APS-C compact camera&#xA0;the rest of the time. That&#x2019;s mostly for the selective focus and low-light capabilities, but also because I prefer a viewfinder to really see what I&#x2019;m shooting.</p>\n<p>The thing is, I quickly discovered, the iPad screen is as good as a viewfinder. It&#xA0;provides&#xA0;a great view of exactly what you&#x2019;re framing. Sure, it&#x2019;s a little awkward to handle, and it is highly embarrassing to be seen using it, but I actually became a bit of a fan.</p>\n<p>So perhaps there is method in Apple&#x2019;s madness in putting a 12MP camera into an iPad. The quality of the test shots I took was, as expected, identical to those from the iPhone 6s and iPhone SE.</p>\n<p><img title=\"9.7-inch iPad Pro diary: Decision time, and my limited street cred is gone forever...\" class=\"aligncenter size-full wp-image-426695\" src=\"https://9to5mac.files.wordpress.com/2016/04/example.jpg?w=1000&amp;h=381\" alt=\"example\" width=\"1000\"></p>\n<p><strong>Conclusions</strong></p>\n<p>My conclusions are largely the same as they were on day one. If you have an iPad older than the Air 2, the 9.7-inch iPad Pro is a great upgrade. If you have the Air 2 and like to draw or handwrite, it&#x2019;s likewise clearly worth the money.</p>\n<p>For an Air 2 owner uninterested in the Apple Pencil, it&#x2019;s a much smaller upgrade.&#xA0;For most people, I&#x2019;d say it&#x2019;s probably not worth the extra cash.</p>\n<p>For me, however, it is. Sure, the better sound, reduced reflectivity and that True Tone feature I never knew I wanted are all relatively small things. But the iPad plays a huge role in my personal Apple ecosystem. It&#x2019;s my go-to mobile data device. It&#x2019;s my ebook reader. It&#x2019;s my personal Netflix viewer. And I do a surprising amount of writing on it.</p>\n<p>So for me, I&#x2019;m happy to lay out the cash to have the iPad model I like the most. I just need to buy a hat and dark glasses to ensure nobody recognizes me if I start using it as a camera &#x2026;</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/08/9-7-inch-ipad-pro-diary-decision/", "short_url": "http://rdd.me/vba0rtnz", "title": "9.7-inch iPad Pro diary: Decision time, and my limited street cred is gone forever…", "excerpt": "I said in the final part of my iPhone SE diary that perceptions of iDevices are very personal, in part because of the role the product plays within our own personal Apple ecosystem &#x2013; and&hellip;", "direction": "ltr", "word_count": 1376, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/ipad-pro-9-7-17.jpg?w=1000&h=158", "rendered_pages": 1, "date_published": "2016-04-08 13:05:08"}