{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>The&#xA0;<em><a href=\"http://www.wsj.com/articles/roots-of-apple-fbi-standoff-reach-back-to-2008-case-1460052008\" target=\"_blank\">WSJ</a></em>&#xA0;has illustrated the stark contrast in Apple&#x2019;s attitude to assisting law enforcement to access iPhones before and after the <a href=\"http://9to5mac.com/tag/prism/\" target=\"_blank\">Snowden revelations</a> about mass surveillance of private data.&#xA0;It was already known that Apple had helped access more than 70 pre-iOS 8 iPhones, and the paper today reports that &#x2013; in the earliest known case &#x2013; the company went as far as drafting the language for the court order.</p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">Lawyers and investigators involved in the 2008 prosecution of Amanda and Christopher Jansen, a young married couple from Watertown, N.Y., remember it as one of the most horrific cases of child sex abuse they had ever seen.</span></p>\n<p class=\"p2\"><span class=\"s1\">History may remember it for another reason. It is believed to be the first case of a federal judge ordering Apple to assist the government in unlocking an iPhone&#x2014;and the technology giant not only complied; it helped prosecutors draft the court order requiring it to do so &#x2026;&#xA0;</span></p>\n</blockquote>\n\n<p>The court order was signed within hours, and a NY State Police investigator took the iPhone to Cupertino where Apple&#xA0;bypassed the passcode in the investigator&#x2019;s presence.</p>\n<p>Apple has long argued that its refusal to compromise the security of iOS by writing a special &#x2018;GovtOS&#x2019; version is motivated by the desire to protect customers from the risks of the exploit making it out into the wild rather than any wish to hinder investigations.</p>\n<p>While the legal battle between Apple and the <a href=\"http://9to5mac.com/tag/fbi/\" target=\"_blank\">FBI</a> over a work phone in the San Bernardino case fizzled out, the debate is <a href=\"http://9to5mac.com/2016/03/29/opinion-fbi-apple-not-over-yet/\" target=\"_blank\">far from over</a>. While the&#xA0;FBI is so far <a href=\"http://9to5mac.com/2016/04/06/fbi-san-bernardino-iphone-data/\" target=\"_blank\">being coy</a> about the method used&#xA0;to access that phone, it has confirmed that the approach <a href=\"http://9to5mac.com/2016/04/07/fbi-iphone-hack-method-secure-enclave/\" target=\"_blank\">doesn&#x2019;t&#xA0;work</a> with the iPhone 5s or later iPhones. There will undoubtedly be further legal attempts to gain access to more recent iPhones.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/08/apple-doj-unlock-iphone/", "short_url": "http://rdd.me/xu1w1dqz", "title": "Apple helped the DOJ write a court order compelling it to unlock an iPhone in 2008 – WSJ", "excerpt": "The&#xA0;WSJ&#xA0;has illustrated the stark contrast in Apple&#x2019;s attitude to assisting law enforcement to access iPhones before and after the Snowden revelations about mass surveillance of&hellip;", "direction": "ltr", "word_count": 291, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-08 11:40:46"}