{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Apple today has spoken out against a controversial new bill&#xA0;in Mississippi that was signed into law by the state&#x2019;s governor earlier this week. House Bill 1523 is spun as protecting&#xA0;religious freedom but has&#xA0;been criticized for&#xA0;enabling LGBT discrimination. Apple today has joined a variety of technology companies in voicing its opposition to the law.</p>\n\n<p>In a statement shared by <a href=\"http://www.clarionledger.com/story/news/2016/04/07/apple-disappointed-mississippi-religious-objections-law/82750144/\">The Clarion-Ledger</a>, Apple said that it believes the new law &#x201C;empowers discrimination,&#x201D; while also reiterating that its stores are open to anyone, as is the company as a whole:</p>\n<blockquote>\n<p class=\"\">&#x201C;We want Mississippians to know that our stores and our company are open to everyone, regardless of where they come from, what they look like, how they worship or who they love.&#x201D;</p>\n</blockquote>\n<p class=\"\">In addition to Apple, companies including HP, IBM, PayPal have spoken out against this controversial law and similar legislation&#xA0;in North Carolina.</p>\n<p class=\"\">Apple has been vocal about other laws similar to the Mississippi one, as well. A year ago, the company and CEO Tim Cook spoke out against <a href=\"http://9to5mac.com/2015/03/27/tim-cook-apple-lgbt-legislation/\">controversial religious freedom laws in Indiana</a>&#xA0;and Arkansas. Tim Cook even <a href=\"http://9to5mac.com/2015/03/30/tim-cook-on-religious-freedom-legislation/\">penned an open-letter</a> in the Washington Post to reiterate Apple&#x2019;s stance. Cook at the time said that the laws were &#x201C;dangerous&#x201D; and that they echoed the days of racial segregation. Additionally in&#xA0;2014, Apple <a href=\"http://9to5mac.com/2014/02/25/apple-joins-growing-call-for-arizona-to-veto-anti-gay-religious-discrimination-bill/\">joined a variety of companies</a> in urging the governor of Arizona to veto a religious freedom bill.</p>\n<p class=\"\">Tim Cook has spoken about racial equality and gay rights in several other instances as well. He took <a href=\"http://9to5mac.com/2014/10/27/tim-cook-talks-racial-equality-gay-rights-and-education-in-speech-at-alabama-capitol-video/\">time in 2014 while being inducted into the Alabama Academy of Honor</a> to say that many are &#x201C;still too slow&#x201D; when it comes to accepting people for who they are, while also noting that&#xA0;&#x201C;one of the greatest civil rights issues of our time&#x201D; is the lack of equal access to quality education.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/07/apple-mississippi-religious-freedom-bill/", "short_url": "http://rdd.me/ssojxukg", "title": "Apple speaks out against new Mississippi religious freedom law, says it ’empowers discrimination’", "excerpt": "Apple today has spoken out against a controversial new bill&#xA0;in Mississippi that was signed into law by the state&#x2019;s governor earlier this week. House Bill 1523 is spun as&hellip;", "direction": "ltr", "word_count": 295, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-07 22:15:07"}