{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t<p class=\"p1\"><span class=\"s1\">It looks like a normal ballpoint ink pen, and it is, but hidden away in Bond-esque, spy gadget-fashion is a built-in 1,000 mAh battery with a Lightning connector, a 16GB USB flash drive, and a stylus attachment that lets you go from paper to touchscreen.&#xA0;</span></p>\n\n<h3 class=\"p1\"><span class=\"s1\"><b> Design </b></span></h3>\n<p class=\"p1\"><span class=\"s1\">As you might expect, the pen is a bit chunkier than your average ink pen or stylus in order to fit in a whole lot of extra functionality with the built-in backup battery and 16GB USB drive, but it&#x2019;s still slim enough to feel comfortable while writing and not look entirely goofy while doing so. It&#x2019;s made out of stainless steel plus&#xA0;brass and finished in either shiny black or white with matte silver accents. I reviewed the black version. </span></p>\n<p class=\"p1\"><span class=\"s1\">Overall the build quality feels solid, although a normal pen of similar quality would be much cheaper without all the additional bells and whistles. The pen weighs 71 grams and measures in at 156mm in length. It&#x2019;s about as thick as <a href=\"http://amzn.to/1SCWnZ8\" target=\"_blank\">a Sharpie marker</a> where you grip it and gets slightly thicker towards the back.</span></p>\n<p class=\"p1\"><img title=\"Review: This James Bond-esque pen/stylus has a built-in battery w/ Lightning connector &amp; a 16GB USB flash drive\" class=\"aligncenter size-full wp-image-426607\" src=\"https://9to5mac.files.wordpress.com/2016/04/beyond-ink-stylus-02.jpg?w=1000&amp;h=523\" alt=\"Beyond-Ink-Stylus-02\" width=\"1000\"></p>\n<h3 class=\"p3\"><span class=\"s1\"><b>The Pen/Stylus</b></span></h3>\n<p class=\"p3\"><span class=\"s1\">The pen arrived in standard ballpoint pen mode, but unscrewing the tip allows you to screw on a stylus tip that is also included in the box. The rubber stylus tip seemed comparable to the tip on my less expensive <a href=\"http://amzn.to/1SCU9st\"><span class=\"s2\">Adonit Mark stylus</span></a> and similar products in that price range, but I wouldn&#x2019;t count on it as a main stylus for art or other precise input needs. However, it&#x2019;s more than sufficient for note-taking needs and casual drawing, etc. The pen uses <a href=\"http://amzn.to/1SCUGKY\"><span class=\"s2\">Lamy Ballpoint ink refills</span></a>, which means you&#x2019;ll be able to purchase replacement ink cartridges and easily swap them out.</span></p>\n<p class=\"p3\"><span class=\"s1\">Having to carry around the extra tip defeats the purpose of packing everything into one device a bit, but once you consider the other functionality &#x2014; a backup battery and flash storage &#x2014; you can still potentially reduce the number of devices you have to carry by quite a few.</span></p>\n<p class=\"p3\"><img title=\"Review: This James Bond-esque pen/stylus has a built-in battery w/ Lightning connector &amp; a 16GB USB flash drive\" class=\"aligncenter size-full wp-image-426608\" src=\"https://9to5mac.files.wordpress.com/2016/04/beyond-ink-pen-charging.jpg?w=1000&amp;h=511\" alt=\"Beyond-Ink-Pen-charging\" width=\"1000\"></p>\n<h3 class=\"p3\"><span class=\"s1\"><b>The backup battery</b></span></h3>\n<p class=\"p3\"><span class=\"s1\">Maybe the most handy feature that the Beyond Ink tries to cram into a traditional pen design is a built-in 1,000 mAh&#xA0;backup battery. That&#x2019;s not a whole lot &#x2014; around 50% charge or 5 hours extra talk time on your iPhone if you&#x2019;re lucky &#x2014; but it&#x2019;s certainly nice to have built into a pen you&#x2019;re already carrying for emergencies. The very short lightning cable attached to the pen for access to the back-up battery cleverly tucks away behind the pen&#x2019;s clip, which still functions as a normal pen clip too, and works well enough. I found it difficult to pull out the cable sometimes (and you might, too, if you have fat fingers), and the cord is a bit on the short side making it slightly awkward when plugged into your iPhone (as pictured above). Perhaps it could have avoided that issue with a longer and/or retractable cable or a design that allows the pen to be attached to the iPhone in some way while charging. An indicator light is also present to signal low and fully charged battery states, etc.</span></p>\n<p class=\"p1\"><span class=\"s1\">You charge the battery by plugging it in via the same USB connector used for the flash drive under the top cap. If plugged in one way you can access the storage. Reverse&#xA0;it and the pen charges over the same (reversible) USB connector.&#xA0;</span></p>\n<p class=\"p1\"><img title=\"Review: This James Bond-esque pen/stylus has a built-in battery w/ Lightning connector &amp; a 16GB USB flash drive\" class=\"aligncenter size-full wp-image-426615\" src=\"https://9to5mac.files.wordpress.com/2016/04/beyond-ink-usb-charging1.png?w=1000&amp;h=339\" alt=\"Beyond-Ink-usb-charging\" width=\"1000\"></p>\n<h3 class=\"p3\"><span class=\"s1\"><b>The flash storage</b></span></h3>\n<p class=\"p3\"><span class=\"s1\">Unscrew the top cap on the Beyond Ink pen and you&#x2019;ll find the hidden 16GB USB flash drive. The USB drive can&#x2019;t be removed from the rest of the pen, so you actually insert it as if the entire pen was a thumb drive, which looks a bit silly when hanging out of the side of your MacBook, for example. Due to the design and the reversible USB connector, it it sits rather loosely when inserted.&#xA0;That can be forgiven only by the coolness factor of having a flash drive built into an otherwise ordinary-looking pen. </span></p>\n<h3 class=\"p3\"><span class=\"s1\"><b>Should you buy it?</b></span></h3>\n<p class=\"p3\"><span class=\"s1\">If you don&#x2019;t want to feel like James Bond and have the coolest pen around, you should probably pass on the Beyond Ink pen. I also wouldn&#x2019;t recommend it as a main stylus for artists or professionals that rely on a stylus daily, but as an occasional note-taker, and with the built-in backup battery/thumb drive, it makes for a great gadget at the $50 discount price. Consider the cost of buying each of the gadgets it combines individually. It&#x2019;s also great gift idea material that you can assume the tech lover in your life probably won&#x2019;t already have (Father&#x2019;s Day is right around the corner). </span></p>\n<p class=\"p3\"><span class=\"s1\">You can <a href=\"http://amzn.to/1RGGsMV\"><span class=\"s2\"><b>buy the Beyond Ink pen for $50</b></span></a> using coupon code<strong> 9TO5MACC</strong> at checkout (Reg. $70) for a limited time before it goes back to normal price. It comes in black and white colors and you can opt for a built-in micro-USB cable instead of Lightning for the backup battery if you&#x2019;re buying for use with another device. </span></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Jordan Kahn", "url": "http://9to5mac.com/2016/04/07/review-beyond-ink-pen-stylus-battery-drive/", "short_url": "http://rdd.me/wbmupom9", "title": "Review: This James Bond-esque pen/stylus has a built-in battery w/ Lightning connector & a 16GB USB flash drive", "excerpt": "It looks like a normal ballpoint ink pen, and it is, but hidden away in Bond-esque, spy gadget-fashion is a built-in 1,000 mAh battery with a Lightning connector, a 16GB USB flash drive, and a stylus&hellip;", "direction": "ltr", "word_count": 826, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/beyond-ink-stylus-02.jpg?w=1000&h=523", "rendered_pages": 1, "date_published": "2016-04-07 18:26:33"}