{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Just over a week ago, the FBI revealed that it&#xA0;had <a href=\"http://9to5mac.com/2016/03/28/fbi-accesses-data-on-terrorists-iphone-without-apple/\">successfully unlocked</a> the iPhone 5c used by one of the San Bernardino gunmen without the help of Apple. To this day, the FBI has not publicly disclosed the method it used to gain access, and it&#x2019;s unclear if it ever will. The <a href=\"https://www.nationaljournal.com/s/622104\">National Journal</a>, however, reports today that the FBI has been briefing members of the Senate on how it was able to gain access to the locked iPhone.</p>\n\n<p>The report notes that the FBI has already briefed Senator Diane Feinstein (D-CA) on how it unlocked the device, while Senator Richard Burr (R-NC) will also be briefed within the coming weeks. This is notable as those two are both working on a new bill that would limit the ability of technology companies like Apple to use strong encryption on consumer devices.</p>\n<p>The Senate Intelligence Committee is <a href=\"http://9to5mac.com/2016/02/18/penalize-tech-companies-for-not-decrypting-devices/\">believed to be working on a bill</a> that would penalize companies that refused to decrypt user devices. The bill is expected to be revealed in the coming weeks and could be written as a modification to the Communications Assistance for Law Enforcement Act of 1994.&#xA0;This law suggests that companies develop their communication systems&#xA0;so that law enforcement agencies are able to gain access with a proper court order. Burr and Feinstein &#x2013; the two Senate members&#xA0;being briefed on the method used to unlock the iPhone 5c &#x2013; are reportedly taking the lead on creating the bill.</p>\n<p>Earlier today, <a href=\"http://9to5mac.com/2016/04/06/fbi-san-bernardino-iphone-data/\">the FBI said that</a> it is still &#x201C;too early&#x201D; to say whether or not anything useful is actually on the iPhone used by one of the San Bernardino gunmen. The organization also noted, however, that it may or may not make the end result public either.</p>\n<p>While in the long run it&#x2019;s unlikely that the FBI will formally reveal the method it used to gain access to the device, we have a feeling it&#x2019;s also pretty unlikely that it will come out and publicly state that it found nothing interesting on the device.</p>\n<p><em>Via <a href=\"http://www.theverge.com/2016/4/6/11380204/fbi-iphone-attack-san-bernardino-secret\">The Verge</a>&#xA0;</em></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/06/fbi-unlocked-iphone-without-apples-help-method/", "short_url": "http://rdd.me/hxq7nehz", "title": "Report: Senate members being briefed by FBI on method used to unlock San Bernardino iPhone 5c", "excerpt": "Just over a week ago, the FBI revealed that it&#xA0;had successfully unlocked the iPhone 5c used by one of the San Bernardino gunmen without the help of Apple. To this day, the FBI has not publicly&hellip;", "direction": "ltr", "word_count": 338, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-07 02:22:13"}