{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>If you consider your iPhone 6s to be a very good camera, then the 9.7-inch iPad Pro should equally be considered an acceptable camera in terms of quality. Both have 12&#x2011;megapixel iSight cameras on the back with True Tone flashes, 5-megapixel FaceTime HD cameras on the front with Retina Flash, and Live Photos on both sides, plus 4K video capture.</p>\n<p>The only difference is obviously the form factor of each device: the iPhone&#x2019;s candy bar shape makes it&#xA0;<em>look&#xA0;</em>like a digital camera, whereas the iPad may only be socially acceptable as a camera if no one realizes you&#x2019;re actually taking photos. That&#x2019;s kinda the trick for me; shoot with the iPad if I&#x2019;m already using&#xA0;it for something else, otherwise&#xA0;go for the iPhone first.</p>\n<p>That context is mostly around the house where no one can see (read: judge) me, but&#xA0;seriously using the 9.7-inch iPad Pro as a convenient camera has made me realize the iPad&#x2019;s Camera app has a few drawbacks compared to the same app on the iPhone. Part of it is size, but there are some software tricks too that you&#x2019;ll want to keep in mind to better utilize the newly improved camera system&#x2026;</p>\n\n<p>First, I&#x2019;ll start with a real life example of how I&#x2019;ve used the 9.7-inch iPad Pro&#x2019;s camera to snap and share a photo recently. I mentioned it&#xA0;on this week&#x2019;s <a href=\"http://9to5mac.com/2016/04/06/happy-hour-podcast-061/\" target=\"_blank\">episode of the 9to5Mac Happy Hour podcast</a>, so give it a listen for an expanded discussion around this topic and more if you&#x2019;re curious about the new 9.7-inch iPad Pro.</p>\n<p>It&#x2019;s silly, but like I said, it&#x2019;s a real life example. Earlier this week, my kid (she recently turned 3) was drawing a dinosaur at her art desk in my office with markers on printer paper. I know it was a dinosaur because she told me she was drawing one, then handed me the completed drawing and wow I could actually see it! Completely a dad moment, but I hung it up in the kitchen on the fridge then snapped a photo of it to show a few family members. Normally, I&#x2019;d use the iPhone over the iPad in every situation because the camera is just better, but now that they&#x2019;re on equal ground I didn&#x2019;t think twice about using the iPad that I was already holding. I took a screenshot at the time to remind myself in&#xA0;what context I had used the iPad camera.</p>\n<p><img title=\"How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro\" class=\"aligncenter size-large wp-image-426446\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0087.jpg?w=1000&amp;h=750\" alt=\"iPad camera app\" width=\"1000\"></p>\n<p>So there&#x2019;s my explainer for the Never Take iPad Photos crowd. A <a href=\"https://en.wikipedia.org/wiki/Stegosaurus\" target=\"_blank\">stegosaurus</a> from the imagination of a toddler. But there are obviously plenty of contexts where using the 9.7-inch iPad Pro&#x2019;s camera is ideal. Apple used a few examples during its keynote like &#x201C;scanning&#x201D; a document within an app where the higher resolution image is ideal, and iMovie for iPad can edit and export 4K video so now you can also shoot it on the same device.</p>\n<p>But if you&#x2019;re going to embrace the 9.7-inch iPad Pro&#x2019;s iSight and FaceTime HD cameras, there are a few tips I have that will generally help improve your experience:</p>\n<p><strong>Enable Camera Grid: Settings&#xA0;&#x2192; Photos &amp; Camera&#xA0;&#x2192; Toggle Camera Grid on</strong></p>\n<p><img title=\"How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro\" class=\"aligncenter size-large wp-image-426472\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0122.jpg?w=1000&amp;h=750\" alt=\"Camera grid setting\" width=\"1000\"></p>\n<p>I&#x2019;ve never noticed this problem before with the iPad Camera app, but the right-aligned transparent action bar is visually misleading when trying to center a subject for a still shot. Enabling the Camera Grid option doesn&#x2019;t completely resolve the issue, but it does help give you a sense of what the actual center of your photo will be.</p>\n<p><strong>Double-tap video&#xA0;viewfinder&#xA0;to see full preview</strong></p>\n<p><img title=\"How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro\" class=\"aligncenter size-large wp-image-426476\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0111.jpg?w=1000&amp;h=750\" alt=\"iPad video full preview\" width=\"1000\"></p>\n<p>The iPhone doesn&#x2019;t have this issue because of the display aspect ratio, but by default video preview in the viewfinder is cropped to fill the screen even though the iPad camera is actually capturing more than you see during filming. Simply double-tap the preview before or during recording to zoom out and see the full video.&#xA0;You&#x2019;ll notice letterboxes above and below the video, but these won&#x2019;t show up in your video and you can see exactly what you&#x2019;re capturing.</p>\n<p><strong> Camera&#xA0;&#x2192; Timer icon off&#xA0;&#x2192; 3s or 10s&#xA0;&#x2192; Tap shutter button &amp; wait</strong></p>\n<p><img title=\"How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro\" class=\"aligncenter size-large wp-image-426479\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0134.jpg?w=1000&amp;h=562\" alt=\"IMG_0134\" width=\"1000\"></p>\n<p>Apple&#x2019;s Camera app has a built-in timer mode that lets you tap the shutter button then snap the photo either 3 seconds or 10 seconds later. There&#x2019;s even an on-screen countdown with large numbers and a pulsating flash to let you know how long to hold your grin and say cheese. This works especially well for selfies when using the FaceTime HD camera since the shutter button is placed awkwardly; it&#x2019;s also useful for framing a shot on the iSight camera without worrying about losing focus when tapping the screen or clicking a volume button to take a snap.</p>\n<p><strong>AE/AF LOCK: Tap and hold on subject when focused&#xA0;&#x2192; &#xA0;Tap again and slide up or down to adjust&#xA0;exposure</strong></p>\n<p><img title=\"How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro\" class=\"aligncenter size-large wp-image-426481\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0102.jpg?w=1000&amp;h=750\" alt=\"AE/AF LOCK\" width=\"1000\"></p>\n<p>Speaking of focus, the auto-exposure/auto-focus lock trick works really well when used with the timer mode. This prevents the iPad camera from thinking it&#x2019;s outsmarting you and focusing on the wrong subject while giving you a dose of manual control by adjusting the exposure level and locking it.</p>\n<p><strong>Bonus: Flash light mode: Camera&#xA0;&#x2192; Video mode&#xA0;&#x2192; &#xA0;Flash on</strong></p>\n<p><img title=\"How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro\" class=\"aligncenter size-large wp-image-426480\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0108.jpg?w=1000&amp;h=750\" alt=\"Flashlight\" width=\"1000\"></p>\n<p>Curiously, iOS 9.3 for the 9.7-inch iPad Pro doesn&#x2019;t yet have a flashlight toggle in Control Center like iPhones have even though the new hardware features the same flash on the rear side. The App Store has tons of (really spammy) flashlight apps, but versions that you&#x2019;ll find for iPad just light up the front display since they were made before iPads had flashes. You can search for iPhone Only apps, which actually work, but they&#x2019;re not very convenient. So as a bonus tip, I&#x2019;m including a non-photography trick that uses the camera. Just go to video mode and set the flash to on, then you can use your iPad to illuminate a dark closet just like you can on the iPhone. Not as convenient as a flashlight toggle in Control Center, but maybe we&#x2019;ll see one in the future.</p>\n<p><img title=\"How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro\" class=\"aligncenter size-large wp-image-426482\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0116.jpg?w=1000&amp;h=750\" alt=\"iPad shot\" width=\"1000\"></p>\n<p><em>Have your own iPad photography tips and tricks? Let us know in the comments.&#xA0;</em></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Zac Hall", "url": "http://9to5mac.com/2016/04/06/ipad-pro-photography-tips/", "short_url": "http://rdd.me/01qgcgb2", "title": "How-To: Take better photos, videos, and selfies with the 9.7-inch iPad Pro", "excerpt": "If you consider your iPhone 6s to be a very good camera, then the 9.7-inch iPad Pro should equally be considered an acceptable camera in terms of quality. Both have 12&#x2011;megapixel iSight cameras&hellip;", "direction": "ltr", "word_count": 997, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/img_0087.jpg?w=1000&h=750", "rendered_pages": 1, "date_published": "2016-04-06 18:54:58"}