{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>IDC has today <a href=\"http://www.idc.com/getdoc.jsp?containerId=prUS41176916\">published</a> its latest report concerning the PC market, and once again, it shows Apple outpacing the rest of the industry, albeit at a slightly slower pace this time around. According to the data, Apple saw its total market share increase during the first quarter of 2016, though it actually saw total sales fall year-over-year.</p>\n\n<p>The report says that total PC shipments worldwide hit 60.6 million during the first quarter of 2016, which is a decline of 11.5 percent year-over-year. This is a slightly worse drop than analyst predictions of 11.3 percent. Specifically in the United States, shipments fell 5.8 percent to 13.6 million units.</p>\n<blockquote><p>Worldwide PC shipments totaled 60.6 million units in the first quarter of 2016 (1Q16), a year-on-year decline of 11.5%, according to the International Data Corporation (IDC) Worldwide Quarterly PC Tracker. Shipments were in line with conservative expectations for a decline of 11.3%, and anticipated a relatively weak environment during the first half of 2016 as Windows 10 enterprise upgrades largely remained in pilot phase while consumer demand remains weak. The volatility in stocks, commodities and currencies also helped depress shipments</p></blockquote>\n<p>In terms of Apple specifically, the company saw shipments rise 5.6 percent year-over-year to 1.8 million in the United States, although its global shipments fell 2.6 percent year-over-year. Despite global shipments falling, however, Apple gained in terms of market share, increasing its share to 7.4 percent worldwide to 13 percent in the United States.</p>\n<p>With it now holding 7.4 percent of the worldwide PC market, Apple is now the&#xA0;holds the fourth spot in the industry as it continues to outpace the rest of the market, despite its annual decline in worldwide shipments.</p>\n<p>Apple is expected to introduce a refreshed Mac lineup at some point in the near future, although specific details are unclear. In the most recent OS X Server build, <a href=\"http://9to5mac.com/2016/03/23/2016-macbook-os-x-server/\">there were references</a> to an &#x201C;early 2016 12-inch MacBook,&#x201D; though Apple has made no official announcements regarding its Mac lineup yet. Some rumors have suggested Apple will work to make the rest of the MacBook lineup much thinner, while the 12-inch MacBook will get an under-the-hood refresh.</p>\n<p>Last month, <a href=\"http://9to5mac.com/2016/03/17/idc-apple-watch-smartwatch-market/\">IDC predicted that Apple Watch</a> will lead the smartwatch market through 2020, while noting that Android Wear was starting to close the gap.&#xA0;In 2020, IDC expects Apple Watch will sell 31 million units for 37.6% of the market while it estimates Android Wear to sell 28 million units and grab 35% market share.</p>\n<div class=\"tiled-gallery type-rectangular tiled-gallery-unresized\"> <div class=\"gallery-row\"> <div class=\"gallery-group images-1\"> <div class=\"tiled-gallery-item tiled-gallery-item-large\"> <a href=\"http://9to5mac.com/2016/04/11/apple-mac-market-numbers-idc/screen-shot-2016-04-11-at-9-01-47-pm/\" border=\"0\"> <img src=\"https://9to5mac.files.wordpress.com/2016/04/screen-shot-2016-04-11-at-9-01-47-pm.png\" width=\"513\" title=\"Screen Shot 2016-04-11 at 9.01.47 PM\" alt=\"Screen Shot 2016-04-11 at 9.01.47 PM\"> </a> </div> </div>  <div class=\"gallery-group images-1\"> <div class=\"tiled-gallery-item tiled-gallery-item-large\"> <a href=\"http://9to5mac.com/2016/04/11/apple-mac-market-numbers-idc/screen-shot-2016-04-11-at-9-01-52-pm/\" border=\"0\"> <img src=\"https://9to5mac.files.wordpress.com/2016/04/screen-shot-2016-04-11-at-9-01-52-pm.png\" width=\"479\" title=\"Screen Shot 2016-04-11 at 9.01.52 PM\" alt=\"Screen Shot 2016-04-11 at 9.01.52 PM\"> </a> </div> </div>  </div>  </div>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/11/apple-mac-market-numbers-idc/", "short_url": "http://rdd.me/t8doh8xi", "title": "IDC: Apple continues to gain in PC market share despite year-over-year shipment drop", "excerpt": "IDC has today published its latest report concerning the PC market, and once again, it shows Apple outpacing the rest of the industry, albeit at a slightly slower pace this time around. According to&hellip;", "direction": "ltr", "word_count": 409, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/screen-shot-2016-04-11-at-9-01-47-pm.png", "rendered_pages": 1, "date_published": "2016-04-12 01:06:02"}