{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Tim Cook has long been a support of the Robert F. Kennedy Center for Justice and Human Rights nonprofit organization, and today the Apple CEO has officially joined the group&#x2019;s board. Cook has specifically voiced that Robert F. Kennedy is among his personal heroes; the Apple CEO has also<a href=\"http://9to5mac.com/2015/05/06/tim-cook-charity-auction-results/\" target=\"_blank\"> raised money for the group </a>in the past&#xA0;through charity auctions. This past December, Tim Cook was the recipient of the nonprofit organization&#x2019;s<a href=\"http://9to5mac.com/2015/12/09/tim-cook-rfk-award-speech/\" target=\"_blank\"> Ripple of Hope Award</a>&#xA0;where he voiced his beliefs on the refugee crisis dominating the headlines at the time as well as education and social equality in America. Read the full announcement below:</p>\n\n<div class=\"press-release\">\n\n<p>Announcing&#xA0;the appointment, Kerry Kennedy, President and CEO of&#xA0;Robert F. Kennedy Human Rights, said,&#xA0;&#x201C;Tim knows&#xA0;the importance of advocating for and representing&#xA0;people who have not been&#xA0;heard. He has integrity and does not shy away from challenging issues when he&#xA0;knows they are right and just. Tim is deeply committed to the&#xA0;social justice&#xA0;work that he is helping Robert F. Kennedy Human Rights accomplish.&#x201D;</p>\n<p>Robert F. Kennedy Human Rights&#xA0;is an&#xA0;international human rights organization founded by Robert Kennedy&#x2019;s family and&#xA0;friends nearly 50 years ago. In December 2015, Tim&#xA0;Cook received the&#xA0;Ripple of Hope&#xA0;Award during the&#xA0;organization&#x2019;s gala in New York City. The award was granted for Mr. Cook&#x2019;s&#xA0;commitment to sustainable business practices&#xA0;and his lifelong commitment to&#xA0;human rights.</p>\n<p>Robert F. Kennedy Human Rights&#xA0;is governed&#xA0;by its board of directors, a diverse group of experts representing business,&#xA0;finance, academia, government, entertainment,&#xA0;education, and civil society. The&#xA0;organization is dedicated to carrying on Robert Kennedy&#x2019;s unfinished work of&#xA0;standing with those who stand against oppression, and is&#xA0;comprised of students&#xA0;and activists, lawyers and business leaders, teachers and advocates, all&#xA0;working towards a common goal: achieving Robert Kennedy&#x2019;s dream of a more&#xA0;just&#xA0;and peaceful world.</p>\n<p>Tim Cook&#xA0;has counted&#xA0;Robert F. Kennedy as a personal hero and inspiration since growing up in rural&#xA0;Alabama. As CEO, Cook has continued to advocate for equality in&#xA0;everything he&#xA0;does and, under his leadership, Apple is determined to leave the world better&#xA0;than they found it. In 1966, Robert F. Kennedy said &#x201C;everywhere new technology&#xA0;and communications bring men and nations closer together; the concerns of one&#xA0;inevitably become the concerns of all.&#x201D; Every day, Tim Cook relentlessly works&#xA0;to create&#xA0;products that will change lives, products that change the world,&#xA0;empower the poorest communities though education, and protect our privacy.</p>\n<p>&#x201C;Growing up, I was&#xA0;inspired by Robert Kennedy&#x2019;s infinite hope for humanity and his belief that&#xA0;people at their core are good,&#xA0;sharing universal goals for themselves and the&#xA0;world in which we live,&#x201D; said Cook. &#x201C;Robert Kennedy spoke to our highest&#xA0;aspirations, calling Americans from all walks of life to fight for something&#xA0;better. He was and is a hero and role model to me, and I&#xA0;am honored to serve&#xA0;alongside Kerry and the rest of the board to advance his message of justice and&#xA0;equality.&#x201D;</p>\n<p>Ethel Kennedy, founder and board member&#xA0;of Robert F. Kennedy Human Rights, said, &#x201C;We are honored to have Tim Cook on&#xA0;our board. I love that he is inspired&#xA0;to &#x201C;make&#xA0;gentle the life of the&#xA0;world&#x201D; and stands with human rights defenders around the globe championing&#xA0;the causes and people Bobby cared about.</p>\n<p>Robert F.&#xA0;Smith,&#xA0;Chair&#xA0;of Robert F. Kennedy Human Rights&#x2019; board of directors and Founder, Chairman and&#xA0;CEO of Vista Equity Partners, said,&#xA0;&#x201C;The challenges we face in the&#xA0;world today are distressingly&#xA0;not dissimilar to those of 1968. The inequality, inequity, and inhumanity we&#xA0;read about every day demand the same values, courage, inspiration, and&#xA0;leadership of&#xA0;Robert F. Kennedy. As a technology visionary and a man who&#xA0;understands how people want to interact, engage, and live, Tim will bring this&#xA0;deep&#xA0;understanding to help advance the mission and relevance of Robert F.&#xA0;Kennedy Human Rights, which is needed now more than ever. We are thrilled by&#xA0;his commitment &#x201C;to&#xA0;bend the arc of history for future generations.&#x201D;</p>\n<p><strong><u>About&#xA0;Robert F. Kennedy Human Rights</u></strong></p>\n<p>Robert F. Kennedy Human Rights takes a&#xA0;three-pronged approach to creating change. Through our advocacy and litigation&#xA0;efforts, we secure lasting legal change, bringing the&#xA0;arm of the law to the&#xA0;defense of the powerless. We engage the business community to be a force for&#xA0;change and prove that investors do well by doing good. We train and&#xA0;educate&#xA0;current and future human rights defenders to build capacity from the ground up&#xA0;to help prevent abuses before they occur.</p>\n</div>\n<p><em>Via&#xA0;<a href=\"http://recode.net/2016/04/06/apple-ceo-tim-cook-joins-board-of-rfk-human-rights-organization/\" target=\"_blank\">Recode</a></em></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Zac Hall", "url": "http://9to5mac.com/2016/04/06/tim-cook-rfk-human-rights-board/", "short_url": "http://rdd.me/qxoane64", "title": "Longtime RFK Human Rights supporter Tim Cook joins group’s board", "excerpt": "Tim Cook has long been a support of the Robert F. Kennedy Center for Justice and Human Rights nonprofit organization, and today the Apple CEO has officially joined the group&#x2019;s board. Cook has&hellip;", "direction": "ltr", "word_count": 676, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-06 16:09:32"}