{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>I <a href=\"http://9to5mac.com/2016/03/25/3d-touch-future-opinion/\" target=\"_blank\">mused&#xA0;recently</a> about the limited support for 3D Touch, not just from third-party developers but even by Apple itself. That&#x2019;s not something I consider a huge deal: the novelty appeal of 3D Touch soon wore off for me, and I decided I could happily live without it when switching from the iPhone 6s <a href=\"http://9to5mac.com/2016/04/05/iphone-se-diary-decision-time/\" target=\"_blank\">to the iPhone SE</a>. It was just something that struck me as odd.</p>\n<p>But exactly the same issue exists with Touch ID, and that&#x2019;s something I <em>do</em> think is a big deal.</p>\n<p>Passwords are horrible. They were fine way back in the days when we only needed a handful of them, but&#xA0;these days you need a password to do everything from transferring photos from a camera to an iPad through to ordering a pizza. We probably each have hundreds of the darned things.</p>\n<p>And passwords&#xA0;are <em>especially</em>&#xA0;horrible on iOS devices &#x2013; where we have to switch an on-screen keyboard between letters, numbers and symbols multiple times to type a single password.&#xA0;That&#x2019;s a problem that ought to have been almost completely solved by Touch ID &#x2013; yet that&#x2019;s not the case &#x2026;</p>\n\n<p>Keychain and password managers help with websites (check out our <a href=\"http://9to5mac.com/2013/10/10/how-to-use-a-password-manager-to-have-strong-unique-passwords-for-each-website/\" target=\"_blank\">how-to guide</a> if you&#x2019;re not yet using one), but they are still not a 100% reliable way to login &#x2013; and&#xA0;these days it&#x2019;s often apps, rather than websites, to which we need to login.</p>\n<p>Some apps support Touch ID, of course. I can remember breathing a sigh of relief when my bank did. Instead of having to type random characters from my password and then answer a security question (which I used as an opportunity for a secondary password rather than an actual answer to the question because memorable questions <a href=\"http://9to5mac.com/2014/09/03/opinion-after-the-celebrity-hacks-the-vulnerability-that-still-exists-and-what-needs-to-be-done/\" target=\"_blank\">are horrible too</a>), now I just put my thumb on the sensor and I&#x2019;m in.</p>\n<p>But many apps still don&#x2019;t. Implementing Touch ID in an app isn&#x2019;t difficult, yet a great many developers haven&#x2019;t bothered. Indeed, as with 3D Touch, not even Apple has implemented it fully in its own apps.</p>\n<p>It&#x2019;s only in iOS 9.3 that we got secure notes &#x2013; and with that&#xA0;the <a href=\"http://9to5mac.com/2016/03/29/how-to-set-up-use-password-protected-notes-ios-9-3-video/\" target=\"_blank\">ability to use Touch ID</a> to open them.&#xA0;And&#xA0;while iOS 8 introduced the ability to hide photos,&#xA0;there&#x2019;s no protection of that &#x2018;hidden&#x2019; photo album. Indeed, if you did let anyone look through your photos, that album would be the first place anyone would look for any &#x2018;interesting&#x2019; ones. That, surely, is the poster child for Touch ID protection in one of Apple&#x2019;s own apps?</p>\n<p>So I think there are three things Apple needs to do to realize the full potential of Touch ID.</p>\n<p><img title=\"Opinion: The three things I think Apple needs to do to unlock the full potential of Touch ID\" class=\"aligncenter size-full wp-image-426397\" src=\"https://9to5mac.files.wordpress.com/2016/04/own-apps.png?w=1000&amp;h=214\" alt=\"own-apps\" width=\"1000\"></p>\n<p>First, fully implement Touch ID in its own apps. While Touch ID protects the&#xA0;device as a whole, it&#x2019;s not unusual for people to allow family and friends to use it &#x2013; including kids.&#xA0;There may be plenty of sensitive data on an iPhone besides hidden photos.</p>\n<p>Find My iPhone is a case in point. If you&#x2019;re already signed-in, anyone using your device could use it to remotely wipe any of your other devices. Anyone have any teenage kids who might think that was amusing?&#xA0;Find My Friends, too &#x2013; the whereabouts of your family members and friends isn&#x2019;t something you&#x2019;d necessarily want available to anyone with access to your phone in general.</p>\n<p>Mail is another example. If you have multiple accounts, you may well want to protect access to one or more of them. Same with Messages &#x2013; if a friend has texted you their bank details to&#xA0;allow you to pay for something you&#x2019;ve bought from them, you&#x2019;ll probably want to keep that thread secure.</p>\n<p>The Health app, too.&#xA0;Body measurements are something people may wish to keep to themselves. I&#x2019;m sure there are&#xA0;other examples, but you get the idea.</p>\n<p><img title=\"Opinion: The three things I think Apple needs to do to unlock the full potential of Touch ID\" class=\"aligncenter size-full wp-image-426398\" src=\"https://9to5mac.files.wordpress.com/2016/04/3.png?w=1000&amp;h=270\" alt=\"3\" width=\"1000\"></p>\n<p>Second, make it an iTunes review requirement for any third-party app with&#xA0;a login for it to offer Touch ID as an option. Not everyone will choose to use it &#x2013; you may, for example, use a single app with multiple accounts &#x2013; but it should always be an option.</p>\n<p>Third, go one step better than this: provide system-level app-locking as an iOS feature. In that way, users could choose to use Touch ID to protect any app &#x2013; Facebook, Twitter, Google Authenticator, you name it. If Apple then passed that login confirmation to the app, the app would also know it was ok to login users automatically. (Again, you want a setting for this, for apps where&#xA0;people have multiple accounts.)</p>\n<p>Implementing these three features would be a win-win for Apple and its customers: increasing the security of the devices, while at the same time making many apps more convenient to use.</p>\n<p>Would you like to see&#xA0;Apple implement these features? Please take our poll, and share your thoughts in the comments.</p>\n\n\n\n\n<p><em>Images: <a href=\"http://www.tweaktown.com\" target=\"_blank\">TweakTown</a>; <a href=\"https://www.apple.com\" target=\"_blank\">Apple</a>; <a href=\"http://www.idownloadblog.com\" target=\"_blank\">iDownloadBlog</a>. Thanks to Benjamin, Greg and Zac for&#xA0;contributing to this piece.</em></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/06/opinion-touch-id-future/", "short_url": "http://rdd.me/e5ijd8vn", "title": "Opinion: The three things I think Apple needs to do to unlock the full potential of Touch ID", "excerpt": "I mused&#xA0;recently about the limited support for 3D Touch, not just from third-party developers but even by Apple itself. That&#x2019;s not something I consider a huge deal: the novelty appeal of&hellip;", "direction": "ltr", "word_count": 800, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/own-apps.png?w=1000&h=214", "rendered_pages": 1, "date_published": "2016-04-06 14:50:12"}