{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Many were skeptical that the work iPhone at the centre of the <a href=\"http://9to5mac.com/tag/fbi/\" target=\"_blank\">San Bernardino</a> controversy would prove in any way useful to the FBI given that the shooters left it untouched while destroying their personal&#xA0;phones, and so far that skepticism seems justified. Despite having had access to all the data on the phone for more than a week, the FBI has apparently not yet found&#xA0;anything of value.</p>\n\n<p>The&#xA0;<em><a href=\"http://www.wsj.com/articles/fbi-analyzing-data-from-san-bernardino-iphone-for-leads-1459894169\" target=\"_blank\">WSJ</a></em> reports that FBI general counsel James Baker told an&#xA0;International Association of Privacy Professionals conference that it was &#x201C;too early&#x201D; to say whether anything useful would be found, and that it may&#xA0;or may not choose to reveal the answer once it is certain.</p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">&#x201C;We&#x2019;re now doing an analysis of that data, as we would in any other type of criminal terrorism investigation,&#x2019;&#x2019; Mr. Baker said, adding: &#x201C;That means we would follow logical leads.&#x201D; But because the agency has only had access to the data for a short period of time, he said &#x201C;it&#x2019;s simply too early&#x2019;&#x2019; to say whether anything found on the phone has been valuable to investigators [&#x2026;]</span></p>\n<p class=\"p1\">The FBI [&#x2026;]&#xA0;<span class=\"s1\">won&#x2019;t decide whether to talk about what it has found until after that examination is complete.</span></p>\n</blockquote>\n<p>Baker also said that the agency was still feeling its way here, as normally such decisions would be made behind closed doors.</p>\n<blockquote>\n<p class=\"p1\"><span class=\"s1\">It raises a whole range of issues in terms of how we&#x2019;re going to handle it going forward. Normally we don&#x2019;t have such detailed real-time public discussions of precise surveillance tools&#x2026;There&#x2019;s a significant amount of novelty to us.</span></p>\n</blockquote>\n<p>While feeling some sympathy for the FBI having to figure out&#xA0;a whole new approach, it&#x2019;s worth remembering that it was the agency&#x2019;s own decision to place itself in that position by going to the press in the first place &#x2013; even before it told Apple about its court motion.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/06/fbi-san-bernardino-iphone-data/", "short_url": "http://rdd.me/3dialgxt", "title": "FBI says it doesn’t know if San Bernardino iPhone is useful, may or may not share the answer", "excerpt": "Many were skeptical that the work iPhone at the centre of the San Bernardino controversy would prove in any way useful to the FBI given that the shooters left it untouched while destroying their&hellip;", "direction": "ltr", "word_count": 303, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-06 10:53:33"}