{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>As it generally does following the release of a new version of iOS, Apple this evening has stopped signing iOS 9.2.1 for all devices. This change comes<a href=\"http://9to5mac.com/2016/03/21/apple-releases-ios-9-3-for-iphone-ipad-and-ipod-touch-featuring-night-shift-touch-id-notes-and-more-here-are-all-the-new-features/\"> two weeks after Apple released iOS 9.3</a> to the public and less than a week after the <a href=\"http://9to5mac.com/2016/03/31/apple-releases-ios-9-3-1-for-iphone-and-ipad-addresses-crashing-bugs-when-tapping-links/\">release of iOS 9.3.1</a>, which squashed a handful of bugs that plagued the initial version.</p>\n\n<p>Because Apple has stopped signing iOS 9.2.1, users will no longer be able to downgrade to the operating system after updating to iOS 9.3 or iOS 9.3.1. This means that once you update, you&#x2019;re permanently committed to the new version. Although theoretically, if you update&#xA0;to iOS 9.3.1 and encounter&#xA0;issues, you can still downgrade to iOS 9.3 for the time being.</p>\n<p>This change may be a disappointment to users who have been experiencing issues with iOS 9.3. There have been a handful of bugs associated with Apple&#x2019;s latest release, although many have been fixed with iOS 9.3.1. For instance, there was an odd bug that <a href=\"http://9to5mac.com/2016/03/27/some-users-reporting-iphone-crashes-on-ios-9-3-when-tapping-links-in-safari-and-other-apps/\">caused crashing when users would tap links in Safari and other apps</a>. Some&#xA0;Sprint users <a href=\"http://9to5mac.com/2016/03/31/sprint-cant-connect-to-lte-after-9-3/\">were also unable to connect LTE following</a> the update, although Sprint says that issue has now been resolved. Finally, users of older iOS devices were affected by a bug that would <a href=\"http://9to5mac.com/2016/03/24/bricked-iphone-5s-5-ipad-2-ios-9-3-fix/\">prevent them from being able to complete the update</a>. Apple has since <a href=\"http://9to5mac.com/2016/03/28/apple-re-releases-ios-9-3-for-older-iphones-and-ipads-affected-by-activation-lock-issue/\">fixed that issue</a> too, though.</p>\n<p>Generally, Apple stops signing older iOS releases to prevent users from downgrading and being vulnerable to security holes that have since been patched. This generally affects jailbreak users the most, but there was never a jailbreak available for iOS 9.2.1.</p>\n<p>It&#x2019;s unclear how much longer Apple will be signing iOS 9.3, so if you&#x2019;re having issues with iOS 9.3.1, we&#x2019;d recommend downgrading sooner rather than later to prevent Apple from closing that signing window as well.</p>\n<p>Apple today has also made <a href=\"http://9to5mac.com/2016/04/05/apple-fixes-siri-passcode-bypass-flaw-nightshift-low-power-mode-trick/\">several server-side fixes to a pair of bugs relating to Siri</a>.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/05/apple-stops-signing-ios-9-2-1/", "short_url": "http://rdd.me/iz9otwxe", "title": "Following release of iOS 9.3 & 9.3.1, Apple stops signing iOS 9.2.1", "excerpt": "As it generally does following the release of a new version of iOS, Apple this evening has stopped signing iOS 9.2.1 for all devices. This change comes two weeks after Apple released iOS 9.3 to the&hellip;", "direction": "ltr", "word_count": 316, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-06 00:32:08"}