{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>As the United States heads full speed into election season, Apple has been a topic of conversation for a variety of reasons thus far. Republican candidate Donald Trump <a href=\"http://9to5mac.com/2016/01/18/donald-trump-says-he-will-force-apple-to-build-its-computers-and-things-in-the-united-states/\">has said that he will &#x201C;get Apple to start building their damn computers and things in this country,&#x201D;</a> while he also <a href=\"http://9to5mac.com/2016/02/19/donald-trump-apple-boycott-iphone/\">last month called for a boycott of Apple</a> when it refused to <a href=\"http://9to5mac.com/2016/02/16/u-s-judge-orders-apple-to-help-fbi-access-data-on-san-bernardino-gunmans-iphone-5c/\">comply with the FBI&#x2019;s request</a> for help unlocking the iPhone used by one of the San Bernardino gunmen.</p>\n<p>Now, Democratic candidate Bernie Sanders has commented on Apple in a new interview with <a href=\"http://www.nydailynews.com/opinion/transcript-bernie-sanders-meets-news-editorial-board-article-1.2588306\">New York Daily News</a>. In the interview, Sanders echoed some of the comments from Trump, noting that he would appreciate it if Apple would move some manufacturing to the United States.</p>\n\n<p>Sanders, when asked about the greed of Wall Street and corporate America &#x201C;destroying the fabric of our nation,&#x201D; said that Apple is not one of those companies, but that it is not perfect either. Sanders said that he wishes Apple&#xA0;would manufacture &#x201C;some of their devices&#x201D; in the United States, while also saying that he wishes the company would &#x201C;not be trying to avoid paying their fair share of taxes.&#x201D;</p>\n<blockquote><p>No, Apple is not destroying the fabric of America. But I do wish they&#x2019;d be manufacturing some of their devices, here, in the United States rather than in China. And I do wish that they would not be trying to avoid paying their fair share of taxes.</p></blockquote>\n<p>Sanders, while his comments are somewhat less extreme than Trump&#x2019;s, does echo some of the same sentiments as the Republican frontrunner. Apple has been working to move manufacturing to the United States when possible, though. For instance, some iPhone parts are manufactured in the United States, as is the Mac Pro.</p>\n<p>Regarding tax payments, Apple CEO Tim Cook has long stated that the company pays every cent it owes in taxes, labeling claims that say the <a href=\"http://9to5mac.com/2015/12/18/tim-cook-60-minutes-interview-taxes-encryption/\">opposite as &#x201C;political crap.&#x201D;</a> Cook has also expressed his <a href=\"http://9to5mac.com/2015/12/20/apple-60-minutes-special/\">displeasure with the American tax code</a> in the past, saying it is simply not written with corporations as large as Apple in mind.</p>\n<p>Apple has been at the center of a handful of presidential debates over its stance on user security. <a href=\"http://9to5mac.com/2016/01/18/democratic-debate-encryption-privacy-technology/\">Candidates on both sides</a> of the <a href=\"http://9to5mac.com/2016/01/15/tim-cook-republican-debate-encryption/\">aisle have wavered</a> in their support, with most generally leaning towards national security being more important. Additionally, Tim Cook <a href=\"http://9to5mac.com/2016/03/07/tim-cook-apple-stop-donald-trump/\">allegedly attended a meeting</a> where one of the topics was figuring out how to stop Donald Trump. Nevertheless, Apple will likely continue to be a factor in the election as we head towards November.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/05/presidential-candidate-bernie-sanders-calls-on-apple-to-make-products-in-us-pay-fair-share-of-taxes/", "short_url": "http://rdd.me/tsvqpu9d", "title": "Presidential candidate Bernie Sanders calls on Apple to make products in US, pay ‘fair share’ of taxes", "excerpt": "As the United States heads full speed into election season, Apple has been a topic of conversation for a variety of reasons thus far. Republican candidate Donald Trump has said that he will&hellip;", "direction": "ltr", "word_count": 424, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 21:34:29"}