{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Apple appears to be taking its new Apple News app to the place that news often breaks (then spreads), Twitter. The Twitter handle @applenews has been dressed for the job for several months now although it&#x2019;s been inactive before today and it isn&#x2019;t yet marked &#x201C;verified&#x201D; by Twitter; Apple execs Phil Schiller and Roger Rosner are among those that follow the account, however, which suggests it&#x2019;s an official Apple property. Here&#x2019;s the first tweet that was shared today:</p>\n<blockquote><p>Follow us here for top stories &amp; great reads from your favorite publishers, curated by our U.S. editors.</p></blockquote>\n<p>9to5Mac reported based on job listings last <a href=\"http://9to5mac.com/2015/06/15/apple-news-curation-editors/\">summer that Apple&#x2019;s News app will employ human editors</a> to curate stories featured within the app, and Apple recently started promoting the editor&#x2019;s pick section within the app around iOS 9.3. Now it looks like Apple is going one step further and will use&#xA0;Twitter to drive attention to the Apple News app on iPhone and iPad&#x2026;</p>\n\n<p>The new Top Stories section appears at the top of the Apple News app&#x2019;s For You section, which collects new stories from sources you follow; the editor curated Top Stories section includes handpicked stories from sources you may not follow which makes Apple News app better at presenting timely stories happening each day.</p>\n<p>Apple News first launched last September with iOS 9 on iPhone, iPad, and iPod touch, replacing the previous Newsstand app which was basically a special folder for publication apps that once offered additional privileges for developers. Apple News, instead, focusing on letting publishers push content directly into the Apple News app so readers have an enhanced experience without using a dozen different apps.</p>\n\n<p>Assuming Apple does begin using the @applenews Twitter account as described above, it will only continue the pattern of Apple further embracing social media and Twitter in particular. Early last month, Apple started offering official technical support for its products <a href=\"http://9to5mac.com/2016/03/03/apple-launches-official-company-twitter-account-for-tips-tricks-and-customer-support-queries/\">through the @AppleSupport handle</a>.</p>\n\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Zac Hall", "url": "http://9to5mac.com/2016/04/05/apple-news-twitter-curated-stories/", "short_url": "http://rdd.me/oh50glcm", "title": "Apple News team now using Twitter to promote curated stories", "excerpt": "Apple appears to be taking its new Apple News app to the place that news often breaks (then spreads), Twitter. The Twitter handle @applenews has been dressed for the job for several months now&hellip;", "direction": "ltr", "word_count": 318, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-05 17:19:19"}