{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>There was a time just a few years back when the 4-inch screen was considered Apple&#x2019;s big phone. After five generations of 3.5-inch screens, Apple made the iPhone taller&#xA0;in 2012&#xA0;with the 4-inch iPhone 5. The width remained the same in a &#x201C;common sense&#x201D; move that maintained easy one-hand use for most people, and the 16:9 aspect ratio&#xA0;framed video playback perfectly. Two years later, Apple upgraded the iPhone with two new models: 4.7-inch and 5.5-inch, but no new 4-inch iPhone until now.</p>\n<p>iPhone SE is the first upgrade to this size since the iPhone 5s in 2013. It&#x2019;s a huge specs upgrade if&#xA0;you&#x2019;re coming from an iPhone 5s, iPhone 5c, iPhone 5, or earlier. And in some cases like mine, iPhone SE is&#xA0;mostly on par with Apple&#x2019;s iPhone 6s and iPhone 6s Plus flagships. But there are a few limitations of varying importance plus a few oddities that should be considered before buying &#x2026; even with the relatively competitive price tag on iPhone SE.</p>\n\n<p>First, a short rundown on the general specs:</p>\n<ul>\n<li>4-inch Retina display with&#xA0;1136&#x2011;by&#x2011;640&#x2011;pixel resolution at&#xA0;326 ppi</li>\n<li>7.6mm thin and 3.99 ounces light</li>\n<li>12-megapixel iSight camera with Live Photos and 4K video recording</li>\n<li>1.2-megapixel FaceTime HD camera with Retina Flash</li>\n<li>A9 + M9 chips</li>\n<li>First-generation Touch ID with Apple Pay</li>\n<li>Available in 16GB or 64GB for $399 or $499</li>\n<li>Sold in space gray, silver, gold, or rose gold</li>\n<li>Up to 13 hours of Internet use on LTE on a single charge</li>\n</ul>\n<p>You can read how that compares to the rest of the lineup <a href=\"http://9to5mac.com/2016/03/22/comparison-iphone-se-6-6s-plus-specs/\" target=\"_blank\">here</a>, but this is how it&#xA0;all translates:</p>\n<ul>\n<li>iPhone SE has the smallest screen which shows less content than the iPhone 6/6s but it&#x2019;s just as sharp</li>\n<li>iPhone SE isn&#x2019;t the thinnest iPhone (it&#x2019;s actually the thickest in the current lineup) but it is the lightest since it&#x2019;s smaller</li>\n<li>iPhone SE has the same back camera as the iPhone 6s and iPhone 6s Plus, but the design is thicker so you don&#x2019;t have the camera bump</li>\n<li>iPhone SE lights up the screen when you take a selfie, but the photo&#xA0;quality isn&#x2019;t nearly as good as the iPhone 6s, iPhone 6s Plus, and even the 9.7-inch iPad Pro</li>\n<li>Speed&#xA0;is just as fast as the iPhone 6s and iPhone 6s Plus, which means it beats the iPhone 6 and iPhone 6 Plus by a lot, and older iPhones by even more;&#xA0;you can also activate Siri anytime with just your voice</li>\n<li>iPhone SE can replace your credit card in places&#xA0;like Best Buy, Walgreens, and McDonalds, and the fingerprint sensor is the same as iPhone 5s, not the faster version on iPhone 6s</li>\n<li>There&#x2019;s no option for 128GB and most people should avoid the 16GB option, but the 64GB version if $250 cheaper than the same storage option on the iPhone 6s</li>\n<li>Same color options as the iPhone 5s, but space gray is slightly lighter and now you can choose rose gold</li>\n<li>iPhone SE has the best battery life for LTE and Wi-Fi Internet use compared to any iPhone</li>\n</ul>\n<p>You can read<a href=\"http://www.apple.com/iphone-se/specs/\" target=\"_blank\"> detailed iPhone SE specifications&#xA0;here</a> and see how the <a href=\"http://www.apple.com/iphone/compare/\" target=\"_blank\">current&#xA0;iPhone lineup compares here</a>.</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-large wp-image-426918\" src=\"https://9to5mac.files.wordpress.com/2016/04/dsc_2673.jpg?w=1000&amp;h=669\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p>In my opening, I mentioned that the 4-inch iPhone was once considered Apple&#x2019;s big phone. That extra half-inch certainly made it feel bigger at the time. You even got an extra row of Home screen icons! But for almost anyone trying iPhone SE after spending time with iPhone 6 or later, the 4-inch screen can feel a bit like a toy.</p>\n<p>The icons feel much larger and take up a lot more of the Home screen, hiding your wallpaper, and you lose a row of icons if you&#x2019;re coming from a larger iPhone. But we lived with smaller iPhones for seven generations and everything felt normal then, and after a few days with the iPhone SE the same will start to be true. I&#x2019;m convinced I could adapt to almost any iPhone size below ~6-inches if needed.</p>\n<p>And there are benefits to having a 4-inch screen that you miss with larger iPhones. For most people, all four corners of the display can be thumb-tapped regardless of which hand you use. I don&#x2019;t have large hands, they&#x2019;re probably average, but the top left corner is a dead zone for my right hand and vice versa without doing some iPhone shuffling and pinky levitation on larger iPhones. iPhone SE is just super comfortable.</p>\n<p>There are other benefits too. iPhone SE may be a tad bit thicker than larger iPhones, but the whole device is physically smaller which makes it more pocket friendly; this is especially true in gym pockets when the size and weight of larger iPhones can create a <a href=\"http://static.idolator.com/uploads/2013/09/09/miley-cyrus-wrecking-ball-video.jpg\" target=\"_blank\">wrecking ball</a> effect on the treadmill or elliptical.</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-large wp-image-426919\" src=\"https://9to5mac.files.wordpress.com/2016/04/dsc_2670.jpg?w=1000&amp;h=476\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p>But a smaller display means you see less content too.&#xA0;Browsing the web is ideal on a larger screen, so Safari can feel cramped if you&#x2019;re coming from a larger iPhone. But if you&#x2019;re upgrading from an older iPhone, the speed improvements will be the only thing you notice here.</p>\n<p>The same is true for the viewfinder in the Camera app. The Plus-sized iPhones have the best viewfinders when shooting a photo or video; it&#x2019;s the same amount of content but bigger and still sharp. iPhone SE by comparison has a tighter viewfinder that may take some getting used to, but the photos and videos you put out are just as good.</p>\n<p>Except for the front-facing camera. I think the $400 price will make iPhone SE especially popular with younger people who may not find the $650 price of the iPhone 6s as accessible, and this same camp of people also probably appreciate a good selfie so it&#x2019;s disappointing that the front camera is such a step down in quality compared to the iPhone 6s and iPhone 6s Plus.</p>\n<div class=\"tiled-gallery type-rectangular tiled-gallery-unresized\"> <div class=\"gallery-row\"> <div class=\"gallery-group images-1\"> <div class=\"tiled-gallery-item tiled-gallery-item-large\"> <a href=\"http://9to5mac.com/2016/04/11/review-iphone-se/img_0294/\" border=\"0\"> <img src=\"https://9to5mac.files.wordpress.com/2016/04/img_0294.jpg\" width=\"329\" title=\"IMG_0294\" alt=\"IMG_0294\"> </a> </div> </div>  <div class=\"gallery-group images-1\"> <div class=\"tiled-gallery-item tiled-gallery-item-large\"> <a href=\"http://9to5mac.com/2016/04/11/review-iphone-se/img_0042-9/\" border=\"0\"> <img src=\"https://9to5mac.files.wordpress.com/2016/04/img_0042.jpg\" width=\"329\" title=\"IMG_0042\" alt=\"IMG_0042\"> </a> </div> </div>  <div class=\"gallery-group images-1\"> <div class=\"tiled-gallery-item tiled-gallery-item-large\"> <a href=\"http://9to5mac.com/2016/04/11/review-iphone-se/img_0154-4/\" border=\"0\"> <img src=\"https://9to5mac.files.wordpress.com/2016/04/img_0154.jpg\" width=\"330\" title=\"IMG_0154\" alt=\"IMG_0154\"> </a> </div> </div>  </div>  </div>\n<p>The smaller screen size has another downside too. Developers (including Apple) are targeting 4.7-inch iPhones when designing apps, then adjusting for 5.5-inch iPhones and 4-inch iPhones. On Plus-sized&#xA0;iPhones, this means you may see icons or text spaced apart more than you would on the iPhone 6 and iPhone 6s. But on the iPhone SE, you&#x2019;ll occasionally hit a layout that appears cluttered or just not optimized for the small screen.</p>\n<p>I don&#x2019;t recall this being an issue when using older iPhones before, so I&#x2019;m convinced it&#x2019;s an issue with targeting the medium-sized display by default. The status bar and Action&#xA0;sheet are prime examples of this. Wi-Fi Calling is a thing now so my carrier name sometimes tacks on Wi-Fi after AT&amp;T to signal the mode change. The result is a crowded row of text on the Lock screen with a scrolling carrier name.</p>\n<p>iPhone SE has nearly the same external design as the iPhone 5s it replaces, yet I still wasn&#x2019;t expecting these oddities. In part, that&#x2019;s because I believe earlier versions of iOS (including iOS 7) were designed&#xA0;<em>only&#xA0;</em>for the 4-inch screen, then iOS 8 and later were slightly tweaked to look best on the larger screens at the cost of the then-aging 4-inch iPhones.&#xA0;It will be interesting to see if future versions of iOS are better optimized for this screen size once again.</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-large wp-image-426921\" src=\"https://9to5mac.files.wordpress.com/2016/04/dsc_2672.jpg?w=1000&amp;h=500\" alt=\"DSC_2672\" width=\"1000\"></p>\n<p>And speaking of the iPhone SE using mostly the same design as the iPhone 5s, the differences that are present are worth discussing briefly. First, the matte edges that replace the shiny chamfered ones on the iPhone 5 and iPhone 5s are functionally different. They&#x2019;re likely less prone to scuffing although not completely as the top of my band has a couple of nicks after regular usage over the last week and a half. They also slightly&#xA0;change the way the iPhone feels in the hand.</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-large wp-image-426928\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0004.jpg?w=1000&amp;h=750\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p>The matte edges have more friction than the smoothed off edges, which you notice for the first few days. I suspect this may make iPhone SE slightly grippier than the already grippy iPhone 5 and iPhone 5s. I also really appreciate the flat edges that let iPhone SE stand up tall or on its side, and the rounded volume buttons make it feel very natural as a point-and-shoot camera. Apple calls this design &#x201C;beloved&#x201D; in marketing material, which I translate into &#x201C;convenient&#x201D; considering Apple is probably really good at making it, but it really is a nice design; packing iPhone 6s internals inside an iPhone 3GS wouldn&#x2019;t have the same effect. The SE stamp on the back that replaced the FCC markings in the US looks very nice too, as does the new inset Apple logo which replaces the stamped method. The new Apple logo is scratch prone, however; it&#x2019;s difficult to photograph but I&#x2019;ve noticed a few nicks across the shiny logo after just 10 days (without a case).</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-large wp-image-426932\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0003.jpg?w=1000&amp;h=750\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p>If you&#x2019;re coming from anything but an iPhone 6s or 6s Plus, then iPhone SE is a substantial camera upgrade on the backside too. 12MP still shots, 4K video, Live Photos, 63MP panoramas are also respectable features especially for a $400-$500 iPhone. I got my hands on an iPhone 5c over the weekend to compare photo quality differences for potential upgrades. iPhone 5c has&#xA0;the same iSight camera found on the iPhone 5, which is pretty similar to iPhone 5s and iPhone 6 as well.</p>\n<p><em>iPhone 5c on top, followed by iPhone SE:</em></p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426953\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-5c.jpg?w=1000&amp;h=750\" alt=\"iPhone 5c\" width=\"1000\"></p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426954\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se.jpg?w=1000&amp;h=750\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426948\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-5c-pano.jpg?w=1000&amp;h=226\" alt=\"iPhone 5c pano\" width=\"1000\"></p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426951\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-pano.jpg?w=1000&amp;h=233\" alt=\"iPhone SE pano\" width=\"1000\"></p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426955\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-5c-2.jpg?w=1000&amp;h=750\" alt=\"iPhone 5c 2\" width=\"1000\"></p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426956\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-2.jpg?w=1000&amp;h=750\" alt=\"iPhone SE 2\" width=\"1000\"></p>\n<p>iPhone SE is also a really great pocket camcorder for capturing home videos. Below is a clip that I shot and edited together on iPhone SE using iMovie, viewable in up to 4K resolution:</p>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/8Y1d4fRDWoQ?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<p>And selfies are fine at 1.2MP, not great like 5MP on iPhone 6s, which is acceptable on Instagram but not great for your favorite memories (my advice: don&#x2019;t mix 1.2MP selfie camera with Retina Flash feature):</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426977\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0309.jpg?w=1000&amp;h=750\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p>So clearly it&#x2019;s a decent video camera and a huge still camera upgrade from older iPhones including iPhone 6. But you might want a better display to view your photo library on than the one on the iPhone SE.</p>\n<p>Its 4-inch screen size makes it ideal for one-hand use and pockets, but the display quality itself highlights the gains we saw starting with the iPhone 6. Blacks look much darker on the larger screens which have&#xA0;a much higher contrast ratio, and using sun glasses&#xA0;with the iPhone SE creates a rainbow effect that was resolved on the larger display iPhones.</p>\n<p>The speaker is also louder on the bigger iPhones, which won&#x2019;t matter if you use Bluetooth speakers, AirPlay, or just use headphones, but it&#x2019;s worth noting.</p>\n<p>And there&#x2019;s no 3D Touch, but I find that I&#x2019;m faster navigating&#xA0;the iPhone SE because every corner is easily reachable that I don&#x2019;t miss moving around with quick look previews and shortcuts. There&#x2019;s also limited landscape app support, which is featured mostly on the Plus-sized iPhones. I don&#x2019;t miss this, though, because the apps that do landscape don&#x2019;t try to be miniature iPad apps with split column views that actually show less content.</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426968\" src=\"https://9to5mac.files.wordpress.com/2016/04/file-apr-11-1-47-14-pm.png?w=1000&amp;h=563\" alt=\"iPhone SE keyboard\" width=\"1000\"></p>\n<p>Another note on landscape use: iPhone SE is by far my favorite landscape iPhone keyboard. iPhone 6 and 6 Plus added tools on either side of the keyboard that I rarely use and frequently dodge; iPhone SE is just a larger version of the keyboard that goes edge to edge. Of course the screen size comes at the cost of a dramatically smaller preview above the keyboard, but in this instance it&#x2019;s the text field that&#x2019;s most important anyway.</p>\n<p>Battery life has been on par with iPhone 6s Plus, which is much larger and can pack in a larger battery, without the drawback of being such a big device. In average use which includes charging overnight and taking iPhone off around 6:30 am, I&#x2019;m seeing around 9 or 10 hours of usage with just over 24 hours of standby.</p>\n<p>Finally, there&#x2019;s that really appealing price tag. It wasn&#x2019;t too long ago that I&#x2019;d pay $400 on a two-year contract for a subsidized 64GB iPhone that actually cost $850. iPhone SE was the first iPhone I purchased SIM-free from any carrier, as the 64GB model runs a relatively more affordable $500 without any contract or payment plan. iPhone SE retaining the iPhone 5s design means a lot of people will think you&#x2019;re not using one of the latest iPhones (if that matters to you), but overall it&#x2019;s a design with limited usability issues that still holds up today.</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426969\" src=\"https://9to5mac.files.wordpress.com/2016/04/img_0002.jpg?w=1000&amp;h=563\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p>Prefer small iPhones and switching from an iPhone 6s or iPhone 6s Plus? iPhone SE is better in some areas like battery life&#xA0;in some situations, one-handed use, and pocket friendliness, but iOS isn&#x2019;t as optimized for this screen size and there&#x2019;s no 128GB option. If you&#x2019;re moving from an iPhone 6 or iPhone 6 Plus for the same reason, iPhone SE is actually a spec upgrade in most cases too.</p>\n<p>And if you&#x2019;re upgrading from an iPhone 5s, iPhone 5c, iPhone 5, or earlier, then iPhone SE will be noticeably better in the important camera, speed, and battery life departments.</p>\n<p>The problem is that iPhone SE is an off-cycle iPhone release which suggests it won&#x2019;t be updated in the fall with whatever new big-screened iPhones are introduced, and its name suggests we won&#x2019;t see an iPhone SE 2 this time next year.</p>\n<p><img title=\"Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)\" class=\"aligncenter size-full wp-image-426920\" src=\"https://9to5mac.files.wordpress.com/2016/04/dsc_2669.jpg?w=1000&amp;h=625\" alt=\"iPhone SE\" width=\"1000\"></p>\n<p>Personally, I&#x2019;m a huge fan of this small iPhone and plan to use it until the fall then pass it on to family as it&#x2019;s plenty capable, but I would like some direction from Apple about the future of the 4-inch iPhone before I get too hooked.</p>\n<p>But if you&#x2019;re just looking for a phone, maybe an iPhone, and don&#x2019;t want to spend too much money, then iPhone SE is a seriously good contender and worth consideration in ways Apple&#x2019;s previous attempts at cheaper iPhones were not. It&#x2019;s not last year&#x2019;s internals put into a plastic shell, and it&#x2019;s not last year&#x2019;s iPhone sold for $100 less. It&#x2019;s a design we&#x2019;ve seen before but a strategy we haven&#x2019;t: selling flagship features at a lower-than-ever price. And fans of small iPhones only benefit for now so long as you can overlook a few oddities here and there.</p>\n<p><em>Check out these stories for more tests and impressions on iPhone SE:</em></p>\n\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Zac Hall", "url": "http://9to5mac.com/2016/04/11/review-iphone-se/", "short_url": "http://rdd.me/b8yltp3p", "title": "Review: iPhone SE is just a (really nice) phone for a great price (with a few oddities)", "excerpt": "There was a time just a few years back when the 4-inch screen was considered Apple&#x2019;s big phone. After five generations of 3.5-inch screens, Apple made the iPhone taller&#xA0;in 2012&#xA0;with&hellip;", "direction": "ltr", "word_count": 2332, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/dsc_2673.jpg?w=1000&h=669", "rendered_pages": 1, "date_published": "2016-04-11 19:22:32"}