{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p class=\"p1\">I use&#xA0;this <a href=\"http://9to5mac.com/2016/04/01/iphone-se-diary-day-1-first-impressions/\" target=\"_blank\">diary format</a> to provide my take&#xA0;on iDevices for three reasons. First, because <a href=\"http://9to5mac.com/2015/04/24/apple-watch-diary-first-impressions/\" target=\"_blank\">initial impressions</a> can be <a href=\"http://9to5mac.com/2015/07/31/apple-watch-diary-three-months/\" target=\"_blank\">misleading</a>. Second, because tastes, of course,&#xA0;vary. And third,&#xA0;in recognition of the fact that you can&#x2019;t really look at a single device in isolation &#x2013; we also need to understand the role it plays in our own personal Apple ecosystem.</p>\n<p class=\"p1\">If I were looking to have just two devices &#x2013; a laptop and a phone &#x2013; then there would be only one sensible choice for me: the iPhone 6s Plus. As a pocket computer (which is of course what the iPhone is), the iPhone 6s Plus is an extremely capable device which offers an excellent compromise between a smaller iPhone and an iPad.</p>\n<p class=\"p1\">But, for me, that&#xA0;would be&#xA0;too great a&#xA0;compromise. I&#x2019;d be giving up the ability to carry it in most trouser pockets (YTrousersMV) without gaining the usability benefits of an iPad-sized screen. It is, to me, a little too large for comfortable handling and a little too small for comfortable viewing and typing.</p>\n<p class=\"p1\">I am, though, in the fortunate position of not having to make that kind of compromise. I have an array of iDevices, so I&#x2019;m able to assign each a much more specific role &#x2013; something which has a significant impact on my perception of the relative pros &amp; cons of the iPhone 6s versus the iPhone SE &#x2026;</p>\n\n<p class=\"p1\">My MacBook Pro is definitely my primary Apple device. I use it all day in my office, and in the evening carry it to the living-room where it becomes our main Netflix device and music system.</p>\n<p class=\"p1\">My LTE iPad is clearly the number two device in my personal ecosystem. It goes pretty much everywhere with me, and is my go-to mobile device for everything from writing through web access to apps. My MacBook Air takes its place when mobile writing is the main task at hand.</p>\n<p class=\"p1\">My Apple Watch does some of the things my iPhone used to do. Checking notifications, calendar appointments, weather, quick replies to messages and so on. So my iPhone now plugs the gap between Watch and iPad. That&#x2019;s not to say it isn&#x2019;t a useful device (leaving aside the fact that my Watch would be largely useless without it). There are things the Watch isn&#x2019;t really able to do and where my iPad would be overkill.</p>\n<p class=\"p1\">So the iPhone has a role in my personal Apple ecosystem, but a relatively small one &#x2013; and that puts me in a rather luxurious position when it comes to deciding which phone best suits my needs.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426239\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-16.jpg?w=1000&amp;h=639\" alt=\"iphone-se-16\" width=\"1000\"></p>\n<p class=\"p1\">All of which is, of course, leading up to me reporting that, one week in, the smaller screen size of the iPhone hasn&#x2019;t proven significantly problematic.</p>\n<p class=\"p1\">I say &#x2018;significantly&#x2019; because the smaller size is not entirely free from drawbacks, and not just because there&#x2019;s more scrolling involved. One thing that only became apparent over the course of a few days is that there&#x2019;s a secondary issue with smaller screens: the tap targets are also smaller. Many of today&#x2019;s apps are designed with larger screens in mind, so buttons can sometimes be a little on the small side on a 4-inch screen.</p>\n<p class=\"p1\">That hasn&#x2019;t proven a deal-breaker for me, but it&#x2019;s definitely a factor to consider.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426243\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-181.jpg?w=1000&amp;h=580\" alt=\"iphone-se-18\" width=\"1000\"></p>\n<p class=\"p1\">Did I mention that I absolutely love the classic design of the SE?</p>\n<p class=\"p1\">I know it&#x2019;s shallow, but let&#x2019;s be honest here, great design is one of the reasons we all buy Apple kit. The UI and ecosystem may be bigger factors in the scheme of things, but we&#x2019;re also people who appreciate gorgeous aesthetics and are willing to pay a (<a href=\"http://9to5mac.com/2014/03/21/opinion-why-the-upgrade-cycle-means-the-apple-tax-is-lower-than-it-seems/\" target=\"_blank\">modest</a>)&#xA0;premium for something as beautiful as it is functional.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426241\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-20.jpg?w=1000&amp;h=377\" alt=\"iphone-se-20\" width=\"1000\"></p>\n<p class=\"p1\">Design is, of course, subjective, and some people adore the iPhone 6/6s design; I&#x2019;m&#xA0;just&#xA0;not one of them. As I said last time, it&#x2019;s not that there&#x2019;s anything wrong with the design of the larger iPhones, it&#x2019;s just that &#x2013; to me &#x2013; there&#x2019;s nothing special about it. But the iPhone 4/4S/5/5S &#x2013; that&#x2019;s beautiful. And timeless. While I&#x2019;ve seen some complaining that Apple is selling a 2012 design in 2016, to me that&#x2019;s testament to the fact that the design is a classic that stands the test of time.</p>\n<p class=\"p1\">I&#x2019;m willing to pay a premium for great design because every time I look at or use a stylish device, I&#x2019;m glad I did. I never had that feeling about the iPhone 6 or 6s, but I do have it about the SE. Only this time, I don&#x2019;t even have to pay a premium: I&#x2019;d actually have money in my pocket after selling my 6s. Win-win.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426244\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-22.jpg?w=1000&amp;h=495\" alt=\"iphone-se-22\" width=\"1000\"></p>\n<p class=\"p1\">But it isn&#x2019;t just the aesthetics that favor the SE, it&#x2019;s also the handling. Again, there&#x2019;s nothing actively wrong with the handling of the 6s, but it only&#xA0;felt ok in the hand rather than great. The SE feels perfect. Even in a crowded place, where there&#x2019;s a risk of being jostled by the crowds, I never feel there&#x2019;s any danger of dropping the phone. And unlike the sharpish edges of the 6s, the flat sides of the SE are comfortable.</p>\n<p class=\"p1\">I honestly think that in terms of both looks and handling, the iPhone 5S cracked it &#x2013; and Apple has yet to better the experience. Using the 5S form factor is, for me, almost perfect.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426252\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-19.jpg?w=1000&amp;h=278\" alt=\"iphone-se-19\" width=\"1000\"></p>\n<p class=\"p1\">I say almost perfect for one reason: the power button. I mentioned before that this&#xA0;moving back from the right-hand side of the phone to the top was something I had to get used to, and &#x2013; silly as it might seem &#x2013; that&#x2019;s the single thing that has bothered me more than anything else! I do feel that the right side is a much more ergonomic location, allowing me to seamlessly switch off the phone after use. But it&#x2019;s again no biggie.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426255\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-23.jpg?w=1000&amp;h=319\" alt=\"iphone-se-23\" width=\"1000\"></p>\n<p class=\"p1\">Part of the reason I&#x2019;d be better off after selling a used 6s to pay for a new SE is that I&#x2019;d be forced to downgrade from 128GB to 64GB. I suspect there are two reasons Apple limited the SE to just two storage tiers. First, that it sees the SE as a semi-budget phone, so doesn&#x2019;t see much of a market for a 128GB model. But also because it&#x2019;s hedging its bets a little, and wants to minimize the risk of cannibalizing sales of its flagship device by those who always buy the top-of-the-range model.</p>\n<p class=\"p1\">In my first diary piece,&#xA0;<a href=\"http://9to5mac.com/2016/03/23/iphone-se-diary-before/\" target=\"_blank\">explaining the reasons</a> I was considering a switch in the first place, I said that 64GB felt a little tight, but I felt I could live with it. I bought the 128GB iPhone 6 and 6s because I&#x2019;d rather pay over the odds for storage I&#x2019;d never use than curse when I ran out of space.</p>\n<p class=\"p1\">However, 18 months in (a year of the 128GB iPhone 6 then six months of the same size 6s), I peaked at 48GB used. I took the opportunity of the switch to the SE to do a little housekeeping (removing podcasts I was never going to play, apps I was never going to use again and audiobooks I&#x2019;d already listened to), and that dropped me down to just 26GB. That means that 64GB gives me plenty of breathing space. Over time, that will probably creep back up again to 48GB, but I don&#x2019;t think I&#x2019;ll use more.</p>\n<p class=\"p1\">I no longer feel that 64GB is tight, so storage needn&#x2019;t be a factor in my decision.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426258\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-24.jpg?w=1000&amp;h=287\" alt=\"iphone-se-24\" width=\"1000\"></p>\n<p class=\"p1\">I wondered whether I&#x2019;d miss 3D Touch. It&#x2019;s possible that I&#x2019;d regret losing it if it ever gets <a href=\"http://9to5mac.com/2016/03/25/3d-touch-future-opinion/\" target=\"_blank\">more committed support</a> from both Apple and third-party developers,&#xA0;but so far, I really haven&#x2019;t missed it. I said last time that I did habitually force-touch a couple of times, but I soon got used to not having it. Right now, at least, it&#x2019;s not enough of a factor to influence my decision. The slower Touch ID, likewise, is something I adapted to really quickly.</p>\n<p class=\"p1\">The downgrade to a 1.2MP camera might bother me if I were a selfie fan, but I&#x2019;m someone who likes to be behind the lens rather than in front of it. I have never in my life taken a solo selfie. I probably average about one selfie a month with my fianc&#xE9;e or a friend, and those photos never go further than the phone, or perhaps Facebook, where 1.2MP does the job.</p>\n<p class=\"p1\"><img title=\"iPhone SE diary: It's day 5, and my decision is already made\" class=\"aligncenter size-full wp-image-426260\" src=\"https://9to5mac.files.wordpress.com/2016/04/iphone-se-21.jpg?w=1000&amp;h=332\" alt=\"iphone-se-21\" width=\"1000\"></p>\n<p class=\"p1\">As I mentioned in the introduction, what will be right for one person will be wrong for another, and the role the iPhone plays in our life will play a major role in determining which model is best for us.</p>\n<p class=\"p1\">But for me &#x2013; someone for whom the iPhone simply fills the smallish gap between the Apple Watch and the iPad &#x2013; small is beautiful. It&#x2019;s a more convenient size. It is, in my eyes, a much more pleasing&#xA0;design. And the switch involves only minor compromises which are well worth it to me.</p>\n<p class=\"p1\">I <a href=\"http://9to5mac.com/2016/04/01/iphone-se-diary-day-1-first-impressions/\" target=\"_blank\">was planning</a> to&#xA0;give it my usual week before I made the decision, but I don&#x2019;t need to: my decision is already made. My iPhone 6s is dead, long live the iPhone SE!</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/05/iphone-se-diary-decision-time/", "short_url": "http://rdd.me/2axaziwy", "title": "iPhone SE diary: It’s day 5, and my decision is already made", "excerpt": "I use&#xA0;this diary format to provide my take&#xA0;on iDevices for three reasons. First, because initial impressions can be misleading. Second, because tastes, of course,&#xA0;vary. And&hellip;", "direction": "ltr", "word_count": 1513, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/iphone-se-16.jpg?w=1000&h=639", "rendered_pages": 1, "date_published": "2016-04-05 14:41:50"}