{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Apple has always been known for putting a huge focus on the environment,&#xA0;and over recent months the company has not been shy about its initiatives. At its <a href=\"http://9to5mac.com/2016/03/21/apple-svp-lisa-jackson-details-apples-environmental-effort-including-recycling-program-during-event/\">press event last month</a>, Apple dedicated stage time to detailing its environmental efforts. Now, Apple looks to be bringing its environmental focus to its retail stores. In a note sent to retail employees and obtained by 9to5Mac Apple has announced that it will be moving away from the iconic plastic drawstring Apple Store bags in favor of new paper bags made out of 80 percent recycled materials.</p>\n\n<p>In the note, Apple says that the change will occur on April 15th, but adds&#xA0;that if stores still have plastic bags in stock, they should use those first before switching exclusively to the new paper bags. Apple also tells employees to first ask if the customer would like a bag before giving them one, again looking to limit the number bags that it uses to begin with. The new bags are said to come in medium and large sizes.</p>\n<p>While the design of the new Apple Store bags is still unclear, it&#x2019;s certainly going to be a change for die-hard Apple fans that have come to love and collect the plastic Apple Store bags since they were introduced years ago.</p>\n<p>For special occasions, Apple has introduced various other retail store bag designs. For instance, when the Apple Watch launched, the <a href=\"http://9to5mac.com/2015/06/16/apple-watch-retail-launch-details-bags/\">company used paper bags with colorful rope handles</a>. It&#x2019;s certainly possible that Apple will use a design similar to these for the new bags, but that&#x2019;s unclear as of right now.</p>\n<p>Furthermore, the gift cards that Apple has been giving out to customers who recycle their iOS device in the Apple Store have been revealed. A handful of these &#x201C;Apple Renew&#x201D; cards have <a href=\"http://www.ebay.com/itm/272186848110?ul_noapp=true&amp;autorefresh=true\">hit eBay,</a> with the seller explaining that you are given them when you go into a retail store to recycle an old device. The cards themselves are made out of recycled paper, as well.</p>\n<p>Last month, Apple&#x2019;s VP of environment, policy, and social initiatives Lisa Jackson detailed the company&#x2019;s continued environmental efforts. Jackson noted that 93 percent of Apple&#x2019;s worldwide operations are powered by renewable energy. Furthermore, Jackson noted of Liam, the company&#x2019;s new automated robot that can dissemble iPhones down to their very basic components to then&#xA0;recycle them.</p>\n<p>Apple will begin the switch to paper retail store bags on April 15th. You can see the note sent to employees below:</p>\n<p><img title=\"Apple Stores to transition from traditional plastic bags to paper in latest environmental move\" class=\"size-full wp-image-426172 aligncenter\" src=\"https://9to5mac.files.wordpress.com/2016/04/screen-shot-2016-04-04-at-7-18-30-pm.png?w=1000\" alt=\"Screen Shot 2016-04-04 at 7.18.30 PM\"></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/04/apple-paper-retail-store-bags/", "short_url": "http://rdd.me/9dcnzkh4", "title": "Apple Stores to transition from traditional plastic bags to paper in latest environmental move", "excerpt": "Apple has always been known for putting a huge focus on the environment,&#xA0;and over recent months the company has not been shy about its initiatives. At its press event last month, Apple dedicated&hellip;", "direction": "ltr", "word_count": 407, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/screen-shot-2016-04-04-at-7-18-30-pm.png?w=1000", "rendered_pages": 1, "date_published": "2016-04-04 23:27:11"}