{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>The 9.7&#x2033; iPad Pro is an interesting new device. Fitting squarely between the 12.9&#x2033; iPad Pro and the 9.7&#x2033; iPad Air 2, it can be difficult to determine what the device actually is. Is it an &#x201C;iPad Air 3&#x2033; or is it an iPad Pro mini? Well, to be honest, it&#x2019;s a little bit of both.</p>\n<p>The new iPad Pro will feel very familiar to current iPad&#xA0;Air 2 owners. For those of you that already own a 12.9&#x201D; iPad Pro, the smaller version&#xA0;might feel like a downgrade in some ways. Certainly, it&#x2019;s a downgrade in the most obvious area &#x2014; size. But in other ways, primarily camera capability, it&#x2019;s a <em>huge</em> upgrade.</p>\n<p>Of course, iPad Air 2 owners who are envious&#xA0;of the iPad Pro&#x2019;s ability to use the Apple Pencil have a definite reason to eye the 9.7&#x2033; Pro. The new iPad Pro also works with Apple&#x2019;s new smaller Smart Keyboard accessory. In other words, there&#x2019;s a lot to consider when it comes to the 9.7&#x2033; iPad Pro. Have a look at some of our favorite new features, along with a few of the disappointments that we encountered.\n\t<ins class=\"adsbygoogle author_ad\"></ins>\n\n\t\t\n</p>\n<h2>Top new 9.7&#x2033; iPad Pro features</h2>\n<h3>Improved display</h3>\n<p>At first glance, you may come away with the impression that the 9.7&#x2033; iPad Pro&#x2019;s display is the same as the display found in the iPad Air 2. While it is the same from a size and resolution standpoint, the iPad Pro&#x2019;s screen features several improvements that make it the most advance display in the entire&#xA0;lineup.</p>\n<p>For starters, the display features a wider color gamut, which improves color saturation.&#xA0;The screen is also brighter than the iPad Air 2, and while I no longer have&#xA0;an Air 2 in my possession, it definitely seems to be brighter from what I can recall. Apple says that the iPad Pro is 25% brighter than the iPad Air 2, which is no small difference.</p>\n<p>Along with that brightness, the new display features improved anti-glare properties. At the iPhone SE press event, Apple SVP of Worldwide Marketing Phil Schiller stated that the iPad Pro is 40% less reflective than the Air 2. Combined with its higher 500 nits of brightness, the iPad Pro is as sun-friendly as any device in Apple&#x2019;s lineup.</p>\n<h2>Video review</h2>\n<p><span class=\"embed-youtube\"><iframe class=\"youtube-player\" type=\"text/html\" width=\"704\" height=\"426\" src=\"http://www.youtube.com/embed/u-3h5AGGXvw?version=3&amp;rel=1&amp;fs=1&amp;autohide=2&amp;showsearch=0&amp;showinfo=1&amp;iv_load_policy=1&amp;wmode=transparent\"></iframe></span></p>\n<h3>True Tone display</h3>\n<p>Apple is using the launch of the 9.7&#x2033; iPad Pro as a way to usher in its new True Tone Display. The True Tone Display is basically a way to make reading the contents on the display more natural in various ambient settings.</p>\n<p><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"alignnone size-full wp-image-426162\" src=\"https://9to5mac.files.wordpress.com/2016/04/true-tone-display-ipad-pro.jpg?w=1000&amp;h=563\" alt=\"True Tone Display iPad Pro\" width=\"1000\"></p>\n<p>The True Tone Display uses four-channel ambient light sensors to automatically adjust the display to a most ideal color temperature and intensity based on ambient light. So if you step outside into natural sunlight, and come inside and sit under fluorescent light, you&#x2019;ll notice the display change automatically to match the light in your environment.</p>\n<blockquote>\n<h2>See also:</h2>\n\n</blockquote>\n<h3>12-megapixel iSight camera</h3>\n<p>The iPad has never been great for shooting photos or videos, but the 9.7&#x2033; iPad Pro is beyond competent when it comes to its camera. Like <a href=\"http://9to5mac.com/2016/03/31/iphone-6s-vs-iphone-se-isight-camera-comparison/\">the iPhone SE</a> and iPhone 6s, the smaller iPad Pro features a 12-megapixel sensor with an&#xA0;&#x192;/2.2 aperture. This is a major improvement over the 12.9&#x2033; iPad Pro and iPad Air 2&#x2019;s 8-megapixel sensor with&#xA0;&#x192;/2.4 aperture.</p>\n<h3>True Tone Flash</h3>\n<p>The lack of a flash has always been an asterisk&#xA0;for iPad photography, but the 9.7&#x2033; iPad Pro is the first iPad to remedy this issue. The True Tone Flash is the same type of flash featured on the iPhone, and is a welcomed addition to the iPad lineup.</p>\n<p><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"alignnone size-full wp-image-426155\" src=\"https://9to5mac.files.wordpress.com/2016/04/true-tone-flash.jpg?w=1000&amp;h=563\" alt=\"True Tone Flash\" width=\"1000\"></p>\n<h3>4K video</h3>\n<p>To tell the truth, I found it puzzling that the 12.9&#x2033; iPad Pro didn&#x2019;t ship with the ability to shoot in 4K, because one&#xA0;of its major selling points revolved around editing multiple streams of 4K video. The 9.7&#x2033; iPad Pro resolves this issue by allowing users to both shoot and edit 4K video on the same device.</p>\n<p>As I&#x2019;ll later talk about, one of my major grievances&#xA0;with the 9.7&#x2033; iPad Pro is the fact that it doesn&#x2019;t do USB 3 file transfers. If there&#x2019;s any positive spin that you can put on such an oversight, it&#x2019;s that you may not need to transfer large 4K files when the device&#xA0;itself can shoot in 4K.</p>\n<h3>Improved FaceTime HD camera</h3>\n<p>The FaceTime HD camera in the larger iPad Pro is the same terrible 1.2-megapixel FaceTime HD camera found in the just-released iPhone SE and previous iPad Air models. It was one of my major gripes in my iPhone SE review, and it&#x2019;s one of my major issues with the big iPad Pro as well.</p>\n<p>I&#x2019;m happy to say that the FaceTime HD camera in the smaller iPad Pro sports the same specs as the one&#xA0;in the iPhone 6s. That means you get a 5-megapixel camera with a&#xA0;&#x192;/2.2 aperture. The upgrade also packs in Apple&#x2019;s Retina Flash technology for better low light selfies, and Apple&#x2019;s popular Live Photos feature.</p>\n<h3>Rose gold</h3>\n<p>If you own a rose gold iPhone 6s or a rose gold iPhone SE, then the having the same color on the&#xA0;iPad Pro is a nice complement. I currently have <a href=\"http://9to5mac.com/2016/03/31/top-15-new-iphone-se-features-5-not-so-good-features-video/\">an iPhone SE</a> and an iPhone 6s &#x2014; both in rose gold &#x2014; but I wasn&#x2019;t sure how I&#x2019;d like having such a big device covered in pink. Surprisingly, it doesn&#x2019;t look all that bad. It&#x2019;s big and pink, but it doesn&#x2019;t look egregiously tacky as you might&#xA0;expect.</p>\n<p><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"alignnone size-full wp-image-426156\" src=\"https://9to5mac.files.wordpress.com/2016/04/rose-gold-ipad-pro.jpg?w=1000&amp;h=563\" alt=\"Rose Gold iPad Pro\" width=\"1000\"></p>\n<h3>Apple Pencil &amp; Smart Keyboard</h3>\n<p>I&#x2019;m not an artist, and I prefer to do my typing on my MacBook Pro with Retina Display, but if you&#x2019;re in the market for either of these accessories, then the 9.7&#x2033; iPad Pro is the cheapest way to get in the game. Both the <a href=\"http://9to5mac.com/2016/03/21/smart-keyboard-9-7-inch-ipad-pro/\">Smart Keyboard</a>, which has been redesigned to fit the Pro&#x2019;s smaller form factor, and the <a href=\"http://9to5mac.com/2015/11/24/review-apple-pencil-for-ipad-pro/\">Apple Pencil</a> can help increase productivity and artistry.</p>\n<h3>Speed</h3>\n<p>The 9.7&#x2033; iPad Pro features the same beastly A9X processor as its bigger brother. In my opinion, speed was never a problem with the iPad Air 2, but for some of the more intense apps and games, having more processing power can only be a good thing.</p>\n<h3>Sound</h3>\n<p>Outside of the 12.9&#x2033; iPad Pro&#x2019;s extra-large screen, its most impressive feature is its speakers. Both Pro tablets feature four speakers that automatically adjust for stereo sound as you reorient the screen. The speakers are so much louder and more impressive than the iPad Air 2 or any iPad or iPhone prior to the iPad Pro. The sound quality on the 9.7&#x2033; iPad Pro is a <em>major</em> upgrade from the iPad Air 2, which makes it worth considering if audio is important to you.</p>\n<p><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"alignnone size-full wp-image-426157\" src=\"https://9to5mac.files.wordpress.com/2016/04/small-ipad-pro-speakers.jpg?w=1000&amp;h=563\" alt=\"Small iPad Pro Speakers\" width=\"1000\"></p>\n<h3>Untethered Hey Siri</h3>\n<p>For whatever reason, the ability to use Siri without being plugged into a power source is not possible on the larger iPad Pro. The feature is available on the 9.7&#x2033; iPad Pro, although both devices feature A9X processors with embedded M9 motion coprocessors.</p>\n<p><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"alignnone size-full wp-image-426158\" src=\"https://9to5mac.files.wordpress.com/2016/04/ipad-untethered-hey-siri.jpg?w=1000&amp;h=563\" alt=\"iPad Untethered Hey Siri\" width=\"1000\"></p>\n<h2>Not-so-good features of the 9.7&#x2033; iPad Pro</h2>\n<h3>Less RAM</h3>\n<p>The 9.7&#x2033; iPad Pro features 2GB of RAM. While that&#x2019;s the same amount of RAM featured in the iPad Air 2, it&#x2019;s half the RAM featured in the bigger 12.9&#x2033; iPad Pro. That&#x2019;s a little disappointing, but honestly 2GB of RAM has been the sweet spot for iOS devices, and I see it as being sufficient enough for the time being.</p>\n<p><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"alignnone size-full wp-image-426160\" src=\"https://9to5mac.files.wordpress.com/2016/04/ipad-pro-less-ram.jpg?w=1000&amp;h=563\" alt=\"iPad Pro Less Ram\" width=\"1000\"></p>\n<h3>No USB 3.0 support</h3>\n<p>As we demonstrated in our <a href=\"http://9to5mac.com/2016/03/27/review-lightning-to-usb-3-camera-adapter-a-podcasters-best-friend/\">review of Apple&#x2019;s new Lightning to USB 3 Camera Adapter</a>, the iPad Pro can take advantage of USB 3 speeds for transferring photos and videos from a camera. Users can also take advantage of faster USB 3 speeds by using the <a href=\"http://9to5mac.com/2015/12/12/review-apple-usb-3-lightning-to-sd-card-camera-reader/\">USB 3&#xA0;Lightning to SD Card Camera Reader</a>. Sadly, the 9.7&#x2033; iPad Pro is relegated to USB 2.0 speeds only, which is a major disappointment for anyone&#xA0;needing&#xA0;professional video and photography workflows.</p>\n<h3>Camera bump</h3>\n<p>With the upgrade in iSight camera optics, the dreaded camera bump makes appearance as well. This is a camera bump that&#x2019;s similar to the one found on the iPhone 6s. There&#x2019;s even a spot for the camera bump to rest in inside of the 9.7&#x2033; iPad Pro&#x2019;s box, which is quite amusing. Fortunately, the camera bump doesn&#x2019;t cause the iPad Pro to rock at all when placed on a flat surface. It&#x2019;s still perfectly fine for drawing on with an Apple Pencil.</p>\n<p><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"alignnone size-full wp-image-426161\" src=\"https://9to5mac.files.wordpress.com/2016/04/ipad-pro-camera-bump.jpg?w=1000&amp;h=563\" alt=\"iPad Pro Camera Bump\" width=\"1000\"></p>\n<h3>No faster charging</h3>\n<p>The 12.9&#x2033; iPad Pro can charge faster by using a <a href=\"http://9to5mac.com/2016/03/25/review-usb-c-to-lightning-cable-must-have-accessory-12-9-ipad-pro/\">Lightning to USB-C Cable mated with Apple&#x2019;s 29W Power Adapter</a>. Our tests showed that using the upgraded adapters significantly improved charging times. Sadly, the 9.7&#x2033; iPad Pro cannot take advantage of faster charging. It&#x2019;s not all bad though, as the smaller&#xA0;Pro doesn&#x2019;t require nearly the amount of juice to charge adequately like the&#xA0;larger iteration.</p>\n<h2>Should iPad Air 2 owners upgrade to the 9.7&#x2033; iPad Pro?</h2>\n<h3>You should consider upgrading if&#x2026;</h3>\n<ul>\n<li>You want to use the Apple Pencil or Smart Keyboard</li>\n<li>Sound quality is important to you</li>\n<li>You wish&#xA0;to take photos&#xA0;or videos with your iPad</li>\n<li>You often use your iPad in direct sunlight</li>\n<li>You want a rose gold iPad</li>\n</ul>\n<h2>Should 12.9&#x2033; iPad Pro owners &#x201C;upgrade&#x201D; to the 9.7&#x2033; iPad Pro?</h2>\n<h3>You should consider &#x201C;upgrading&#x201D; if&#x2026;</h3>\n<ul>\n<li>The 12.9&#x2033; form-factor is too unwieldy</li>\n<li>You wish&#xA0;to take photos&#xA0;or videos with your iPad</li>\n<li>You don&#x2019;t care about USB 3 speeds</li>\n<li>You don&#x2019;t use Split View multitasking&#xA0;often</li>\n<li>You want a rose gold iPad</li>\n</ul>\n<h3>Conclusion</h3>\n<p>At first glance, the 9.7&#x2033; iPad Pro might seem like a product that neither iPad Air 2 or 12.9&#x2033; iPad Pro owners would be interested enough in to seriously consider. However, as you can see from this walkthrough, that would be a mistake.</p>\n<p>There are significant reasons to consider going with the smaller iPad Pro.&#xA0;It&#x2019;s more powerful than the iPad Air 2, features support for the Apple Pencil and Smart Keyboard, and it&#x2019;s a much better camera than either the iPad Air 2, or the larger iPad Pro.</p>\n<p>While it&#x2019;s&#xA0;true that the smaller iPad Pro does indeed feel like the natural successor to&#xA0;the iPad Air 2, that&#x2019;s inevitable given its size.&#xA0;If having the size of the 12.9&#x2033; iPad Pro isn&#x2019;t a must, then the smaller version&#xA0;is quite the compelling product. Besides, being an &#x201C;iPad Air 3&#x201D; isn&#x2019;t necessarily a bad thing, as up until the iPad Pro, the iPad Air 2 was still the tablet to beat.</p>\n<p><a href=\"http://www.speckproducts.com/apple/iphone-cases/iphone-5s-cases/candyshell-grip-iphone-5s-cases/IP5-...\" rel=\"attachment wp-att-425538\"><img title=\"Top new 9.7 iPad Pro features + a few not-so-great features [Video]\" class=\"aligncenter size-full wp-image-425538\" src=\"https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000\" alt=\"AD_Clear_Pecan_728x90\"></a></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Jeff Benjamin", "url": "http://9to5mac.com/2016/04/04/top-10-new-9-7-ipad-pro-features-should-you-upgrade-video/", "short_url": "http://rdd.me/9ovvcoys", "title": "Top new 9.7″ iPad Pro features + a few not-so-great features [Video]", "excerpt": "The 9.7&#x2033; iPad Pro is an interesting new device. Fitting squarely between the 12.9&#x2033; iPad Pro and the 9.7&#x2033; iPad Air 2, it can be difficult to determine what the device actually is.&hellip;", "direction": "ltr", "word_count": 1712, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/true-tone-display-ipad-pro.jpg?w=1000&h=563", "rendered_pages": 1, "date_published": "2016-04-04 22:00:12"}