{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Popular commenting service Disqus today has announced its first ever iOS app. The app is available now in the <a href=\"https://geo.itunes.apple.com/us/app/disqus/id1006908426?mt=8&amp;at=11l3RE\">App Store for free</a> and allows users to track notifications relating to their comments as well as discussions from channels and websites they follow. The app&#x2019;s interface is pretty standard, with home, channel, notification, and profile tabs along the bottom.</p>\n\n<p>When you first launch the app, you are presented with a stream of trending discussions across websites and channels you follow. You&#x2019;ll also see content that other people you follow have liked or recommended. Choosing one of the trending or recommended discussions will bring up the original article, as well as all of the comments and the ability for you to join the discussion.</p>\n<p>In the Channels tab of the app, you&#x2019;ll find discussions from channels and websites you follow, as well as additional channels that are recommended by Disqus for you.</p>\n<p>In the Notifications&#xA0;tab of the app, you&#x2019;ll see two streams of content: one for comments and another for general activity. The main comments stream of the notifications tab shows replies to the comments you have made on websites and discussions that use the Disqus platform. The Activity stream shows newly started discussions, discussions to which you&#x2019;ve been invited, and when a comment you&#x2019;ve made is upvoted or downvoted.</p>\n<p>The Profile tab of the app shows&#xA0;all of the comments you&#x2019;ve made, as well as discussions you&#x2019;ve started and content that is recommended for you. The Profile tab also houses the ability to keep track of upvotes, followers, and people you have blocked.</p>\n<p>As you would expect, the Disqus app on iOS supports push notifications, which means you&#x2019;ll immediately know when someone replies to one of your comments or a new discussion is started. Furthermore, you can upvote and reply to comments directly from&#xA0;Notification&#xA0;Center.</p>\n<p>There are a handful of other features in Disqus for iOS as well:</p>\n<blockquote><p>Along with many of the features&#xA0;you&#x2019;re familiar with, we&#x2019;re introducing a few new ones that are&#xA0;unique to the iOS app.</p>\n<p>First is the ability to block others so that posts, and notifications from them will no longer be visible.</p>\n<p>Blocking actions taken on&#xA0;the app aren&#x2019;t&#xA0;currently reflected on the web version, though it&#x2019;s something we&#x2019;re committed to adding in the future.</p>\n<p>Second, downvotes now reduce the comment&#x2019;s total number of votes, with zero being the lowest&#xA0;a&#xA0;count can go.</p></blockquote>\n<p>Disqus for&#xA0;iPhone&#xA0;is available now for free on the <a href=\"https://geo.itunes.apple.com/us/app/disqus/id1006908426?mt=8&amp;at=11l3RE\">App Store</a>.</p>\n<p><a href=\"http://www.speckproducts.com/apple/iphone-cases/iphone-5s-cases/candyshell-grip-iphone-5s-cases/IP5-CS-GRIP.html?utm_source=9to5mac.com&amp;utm_medium=referral&amp;utm_campaign=iPhone%20SE%20launch\" rel=\"attachment wp-att-425538\"><img title=\"Disqus releases first iPhone app w/ support for tracking comments &amp; discussions, more\" class=\"aligncenter size-full wp-image-425538\" src=\"https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000\" alt=\"AD_Clear_Pecan_728x90\"></a></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/04/disqus-for-iphone-app/", "short_url": "http://rdd.me/g4qicwjz", "title": "Disqus releases first iPhone app w/ support for tracking comments & discussions, more", "excerpt": "Popular commenting service Disqus today has announced its first ever iOS app. The app is available now in the App Store for free and allows users to track notifications relating to their comments as&hellip;", "direction": "ltr", "word_count": 402, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000", "rendered_pages": 1, "date_published": "2016-04-04 18:58:02"}