{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Apple last month <a href=\"http://9to5mac.com/2016/03/21/carekit-researchkit-updates/\">announced</a> that it was expanding the capabilities of ResearchKit with CareKit, and today the company&#xA0;revealed that researchers can now integrate genetics into their ResearchKit apps with a new 23andMe module. 23andMe is a popular personal genomics and biotechnology company based in Mountain View, California. With support for genetic information in ResearchKit apps, researchers will more easily be able to look for information relating to illness and disease and make associations.</p>\n\n<blockquote><p>The 23andMe module will allow interested researchers who are using the ResearchKit platform to support the collection of genetic data for their studies from current 23andMe customers and beyond. Using the module, researchers can allow existing 23andMe customers to easily contribute their data to a study. Or, researchers could choose to offer genotyping services to their study participants through 23andMe, with the services being funded by the researchers.</p></blockquote>\n<p>The 23andMe module will allow researchers to collect genetic data for their studies, as well as to offer genotyping services to research participants. In that case, the researchers could fund the services for&#xA0;the participants, who would then have access to the full 23andMe subscription service.</p>\n<p>Once a participant agrees to share their genetic data, the researchers can access the information via the 23andMe API.</p>\n<blockquote><p>&#x201C;This new technology gives researchers a turnkey way to integrate genetics into their studies,&#x201D; said Anne Wojcicki, 23andMe CEO and co-founder. &#x201C;This will enable research on a much broader scale. Incorporating genetics into a platform with the reach of ResearchKit will accelerate insights into illness and disease even further.&#x201D;</p></blockquote>\n<p>As with all ResearchKit modules, privacy is an important factor. 23andMe says that researchers only have access to data that the user explicitly agrees to share. The user must provide informed consent and have the ability to disconnect from an app in their 23andMe settings at any point to stop sharing additional data. Additionally, any study that uses the 23andMe ResearchKit module must have their study approved by an Institutional Review Board.</p>\n<p>More information regarding the new 23andMe ResearchKit module is available on the <a href=\"http://researchkit.org/blog.html#article-14\">ResearchKit blog</a>. It&#x2019;s interesting to see the capabilities of ResearchKit continuing to expand at a relatively fast pace, especially with privacy remaining a big concern, although 23andMe has a shaky history when it comes to <a href=\"http://fusion.net/story/215204/law-enforcement-agencies-are-asking-ancestry-com-and-23andme-for-their-customers-dna/\">protecting user privacy</a>.</p>\n<p><a href=\"http://www.speckproducts.com/apple/iphone-cases/iphone-5s-cases/candyshell-grip-iphone-5s-cases/IP5-...\" rel=\"attachment wp-att-425538\"><img title=\"Personal genomics company 23andMe using ResearchKit for new genetic research module\" class=\"aligncenter size-full wp-image-425538\" src=\"https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000\" alt=\"AD_Clear_Pecan_728x90\"></a></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Chance Miller", "url": "http://9to5mac.com/2016/04/04/genetics-in-researchkit-23andme/", "short_url": "http://rdd.me/5lf9a5sp", "title": "Personal genomics company 23andMe using ResearchKit for new genetic research module", "excerpt": "Apple last month announced that it was expanding the capabilities of ResearchKit with CareKit, and today the company&#xA0;revealed that researchers can now integrate genetics into their ResearchKit&hellip;", "direction": "ltr", "word_count": 375, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000", "rendered_pages": 1, "date_published": "2016-04-04 18:24:22"}