{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Juggling&#xA0;passwords for all the digital services we manage these days is no easy task with varying rules and expiring credentials all the time, but 1Password makes the process both more secure and way more convenient. Rather than using a version of a few passwords that you can actually remember, 1Password easily lets you generate strong, randomized passwords for each service that you protect behind a single secure password, then browser extensions and action extensions on OS X and iOS make password entry super simple.</p>\n<p>The latest update to <a href=\"https://geo.itunes.apple.com/us/app/1password-password-manager/id443987910?mt=12&amp;at=10laZc&amp;ct=925\" target=\"_blank\">1Password for Mac, version 6.2</a>, adds a couple of minor but useful enhancements to the desktop experience. First, intelligence&#xA0;behind the automatic login and password filler is&#xA0;smarter in the new version, which means using the keyboard shortcut or browser extension to fill in your info will fail fewer times. The database upgrade also means that naming new logins will be easier as 1Password will be smarter about guessing what website you&#x2019;re new login is for.</p>\n<p>If you&#x2019;re new to 1Password or setting up friends or family, 1Password 6.2 for Mac also includes a more intelligent data importer for users moving from other password management apps. This follows the introduction of new features like <a href=\"http://9to5mac.com/2016/02/16/1password-for-families/\" target=\"_blank\">1Password for Families</a> and Teams, which are also improved in this version, as well as 1Password mini for the Menu Bar on OS X.</p>\n<p>Check out the full release notes below:</p>\n\n<blockquote>\n<h4>What&#x2019;s New in Version 6.2</h4>\n<p class=\" \">The New Tricks Edition</p>\n<p>You know what they say. &#x201C;You can&#x2019;t teach an old dog new tricks, but you can teach password managers new things.&#x201D; We totally agree with that last part. Over the years, we&#x2019;ve released many dozens of new versions, hundreds of betas, and approximately a gazillion improvements! That&#x2019;s a lot of changes, and we&#x2019;re not about to stop now. Without further ado, we present 1Password 6.2 for Mac: The New Tricks Edition.</p>\n<p>== More studying, bigger brain ==</p>\n<p>Some of the coolest tricks 1Password performs, like automatically saving Logins or filling information on websites, come from the browser extension and the brain that powers it. Every once in a while the brain would come across a website it just didn&#x2019;t understand. That&#x2019;s when 1Password wouldn&#x2019;t fill your information accurately. In an effort to improve, the brain sat down and studied all sorts of websites, and now its guesses are more educated than ever. As an added bonus, 1Password will now try to automatically name the Logins it creates.</p>\n<p>== First-class importing ==</p>\n<p>Thanks to 1Password for Teams and Families, this is the sweetest time to try 1Password, especially if you&#x2019;ve been using something else to safeguard your digital life. Our latest upgrades to the importer make it super simple to import your information from another application.</p>\n<p>We&#x2019;ve also improved the way 1Password for Mac and Families and Teams (oh my!) work together, the way 1Password mini behaves, and more!</p>\n<p>We value your workflow too much to prompt you for a review. If you feel generous or have a couple of minutes, please take some time to leave a rating and review on the App Store. It makes a huge difference to us. Thank you so very much.</p>\n<p>We love hearing from you! Get in touch with us at discussions.agilebits.com, @1Password on Twitter, and facebook.com/1Password and tell us about the newest tricks you&#x2019;ve learned!</p></blockquote>\n<p class=\" \">1Password 6.2 for Mac is a<a href=\"https://geo.itunes.apple.com/us/app/1password-password-manager/id443987910?mt=12&amp;at=10laZc&amp;ct=925\" target=\"_blank\"> free update</a> to existing customers, and currently <a href=\"https://geo.itunes.apple.com/us/app/1password-password-manager/id443987910?mt=12&amp;at=10laZc&amp;ct=925\" target=\"_blank\">$64.99 on the Mac App Store</a> for new customers. 1Password for iPhone, iPad, and Apple Watch is <a href=\"https://geo.itunes.apple.com/us/app/1password-password-manager/id568903335?mt=8&amp;at=10laZc&amp;ct=925\" target=\"_blank\">free for all users </a>with an optional $9.99 in-app purchase to unlock pro features.</p>\n<p><a href=\"http://www.speckproducts.com/apple/iphone-cases/iphone-5s-cases/candyshell-grip-iphone-5s-cases/IP5-CS-GRIP.html?utm_source=9to5mac.com&amp;utm_medium=referral&amp;utm_campaign=iPhone%20SE%20launch\" rel=\"attachment wp-att-425538\"><img title=\"1Password 6.2 for Mac adds automatic login naming + upgraded data importer\" class=\"aligncenter size-full wp-image-425538\" src=\"https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000\" alt=\"AD_Clear_Pecan_728x90\"></a></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Zac Hall", "url": "http://9to5mac.com/2016/04/04/1password-6-2-mac-login-naming-data-importer/", "short_url": "http://rdd.me/umm7dzlt", "title": "1Password 6.2 for Mac adds automatic login naming + upgraded data importer", "excerpt": "Juggling&#xA0;passwords for all the digital services we manage these days is no easy task with varying rules and expiring credentials all the time, but 1Password makes the process both more secure&hellip;", "direction": "ltr", "word_count": 595, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000", "rendered_pages": 1, "date_published": "2016-04-04 16:57:38"}