{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>KGI&#x2019;s Ming-Chi Kuo &#x2013; an analyst with an excellent track-record on AAPL &#x2013; has forecast that&#xA0;year-on-year iPhone shipments will continue to fall this year, and be well below market expectations. In an investment note seen by&#xA0;<em>9to5Mac</em>, KGI says that total 2016 iPhone shipments will likely fall below 200M units, and that the iPhone 7 will see lower sales than the iPhone 6s/Plus.</p>\n<p>Kuo&#xA0;says that lower-than-expected iPhone 6s/Plus sales showed that replacement demand was falling in developed markets, while new demand from emerging markets has not yet picked up the slack. KGI does not believe that the launch of the iPhone 7 later this year will be sufficiently appealing to see the iPhone return to growth &#x2026;</p>\n\n<p>The note argues that the iPhone 7 appears likely to adopt a broadly similar form factor to the 6s/Plus, with the only notable upgrade&#xA0;leaked to date being the dual camera expected to be found in the iPhone 7 Plus, limiting it potential appeal. With the feature found only on&#xA0;the larger model, and many competitor smartphones also expected to feature dual cameras &#x2013; some of them already on the market &#x2013;&#xA0;consumers could be underwhelmed by the iPhone 7.</p>\n<p>We&#x2019;re still a fair way out at this stage, meaning that Apple could well have surprises in store, but KGI does have excellent supply-chain contacts that have so far revealed no sign of additional new features.</p>\n<p>Finally, KGI is also skeptical about a&#xA0;<a href=\"http://9to5mac.com/2016/03/28/iphone-se-preorders-china/\" target=\"_blank\"><em>CNBC&#xA0;</em>report</a> that the iPhone SE&#xA0;saw 3.4M retailer pre-orders in China, stating that it was unable to find any evidence to substantiate the number.</p>\n<p>The Wall Street consensus is for total iPhone sales of 210-230M, while Kuo believes it will fall within the 190-210M range, with&#xA0;the number likely to fall on the wrong side of 200M.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Ben Lovejoy", "url": "http://9to5mac.com/2016/04/04/no-recovery-from-peak-iphone-this-year-total-shipments-likely-below-200m-units-kgi/", "short_url": "http://rdd.me/kheykyub", "title": "No recovery from ‘peak iPhone’ this year, total shipments “likely below 200M units” – KGI", "excerpt": "KGI&#x2019;s Ming-Chi Kuo &#x2013; an analyst with an excellent track-record on AAPL &#x2013; has forecast that&#xA0;year-on-year iPhone shipments will continue to fall this year, and be well below&hellip;", "direction": "ltr", "word_count": 289, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-04 12:43:07"}