{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p class=\"\">Speck Products<span class=\"\">&#xA0;has unleashed a series of new, high-quality accessories for Apple&#x2019;s latest line of mobile devices. For the new 9.7-inch iPad Pro and 4-inch iPhone SE, Speck has created new designs in addition to some of their most popular iPad and iPhone case designs. All of the new cases&#xA0;are great choices to protect your new Apple device because of their high-quality materials, snug fit, reliable engineering, cool colors, and low prices. Three of&#xA0;</span><span class=\"\"><a href=\"http://www.speckproducts.com/?utm_source=9to5mac.com&amp;utm_medium=referral&amp;utm_campaign=iPhone%20SE%20launch\">Speck&#x2019;s latest offerings</a></span><span class=\"\">&#xA0;standout: StyleFolio Pencil for the 9.7-inch iPad Pro, CandyShell Grip for the iPhone SE, and CandyShell Clear for the iPhone SE.</span></p>\n\n<p class=\"\"><span class=\"\">One of the premier additions to the 9.7-inch iPad with the new iPad Pro is support for the Apple Pencil: Apple&#x2019;s stylus for drawing, navigating the iPad&#x2019;s interface, and jotting down handwritten notes. While the Apple Pencil offers great functionality for many users, it is not so useful if an iPad user forgets it at home or at the office. Speck&#x2019;s new</span>&#xA0;StyleFolio Pencil&#xA0;<span class=\"\">for the iPad Pro solves that problem and some others. StyleFolio Pencil starts with the same protectiveness, design and functionality of the standard StyleFolio model, but adds in support for storing an Apple Pencil, both during travel and work.</span></p>\n<p class=\"\">As can be seen in the image above, an iPad Pro user can simply store the Apple Pencil in a resting position during travel. Even more convenient is the &#x201C;inkwell&#x201D; feature that allows a user to place the Apple Pencil in standing position similar to how people could store ink pens in an inkwell decades ago. This feature allows a user to quickly move between sketching, tapping, and typing without misplacing the Apple Pencil. The bottom of the StyleFolio Pencil has an open hole to access the Lightning connector, and this makes quickly charging up the Apple Pencil between uses especially quick.</p>\n<p class=\"\">As for the design and protectiveness, this case features a soft internal lining to keep the iPad&#x2019;s display clean and a hard shell exterior to keep the iPad safe. It also includes a secure latch to make sure the folio-style case does not open while traveling in a user&#x2019;s bag or in their hands. At its heart, StyleFolio Pencil is a folio-style accessory, meaning that its top flap can fold over so users can easily stand their iPad up to watch video or move it into a position prime for touch typing.</p>\n<p class=\"\"><span class=\"\">StyleFolio Pencil comes in a black/gray color combination and costs $59.95. Speck also launched a series of other&#xA0;</span><span class=\"\"><a href=\"http://www.speckproducts.com/apple/ipad-cases/ipad-pro-9-7-cases.html?utm_source=9to5mac.com&amp;utm_medium=referral&amp;utm_campaign=iPhone%20SE%20launch\">new cases for the 9.7-inch iPad Pro</a></span><span class=\"\">,&#xA0;including some that are based off of the unique StyleFolio design. The new cases range from $39.95 to $59.95 and can be found at&#xA0;speckproducts.com.</span></p>\n<p class=\"\"><span class=\"\"><img title=\"Our favorite Speck cases for your new iPhone SE &amp; iPad Pro\" class=\"aligncenter size-full wp-image-425561\" src=\"https://9to5mac.files.wordpress.com/2016/03/candyshell-grip-for-iphone-se.jpg?w=1000&amp;h=415\" alt=\"CandyShell Grip for iPhone SE\" width=\"1000\"></span></p>\n<p class=\"\"><span class=\"\">CandyShell is Speck&#x2019;s premier protective case for the iPhone, and</span>&#xA0;CandyShell Grip fo<span class=\"\">r the iPhone SE adds the benefit of raised rubber ridges on the back and sides of the case. The ridges make it easier to hold on to the iPhone, take pictures, and play games. This also makes the case a perfect fit for those who sometimes complain of their iPhone (when not in a case) being too slippery. The case also includes a raised bezel to protect the front of the iPhone, a flash ring, and responsive button protection.</span></p>\n<p class=\"\">Like other CandyShell cases, CandyShell Grip includes a dual-layer design to protect the iPhone from scratches, falls, and general impact. Even with the strong materials, the military-grade case retains the iPhone&#x2019;s slim profile and keeps all controls and hardware features fully accessible. The CandyShell Grip comes in several&#xA0;unique color combinations, which makes it a great fit regardless of your iPhone SE&#x2019;s color. The case costs $34.95 and is available on&#xA0;speckproducts.com.</p>\n<div class=\"\"><span class=\"\">Speck has also announced a series of other&#xA0;</span><span class=\"\"><a href=\"http://www.speckproducts.com/iphone-se-cases.html?utm_source=9to5mac.com&amp;utm_medium=referral&amp;utm_campaign=iPhone%20SE%20launch\">new iPhone SE cases</a></span><span class=\"\">, including their best-selling&#xA0;</span><span class=\"\">CandyShell Clear</span><span class=\"\"><span>. </span></span>These cases range from $34.95 to $39.95 and can be found at&#xA0;speckproducts.com.</div>\n<p><a href=\"http://www.speckproducts.com/apple/iphone-cases/iphone-5s-cases/candyshell-grip-iphone-5s-cases/IP5-CS-GRIP.html?utm_source=9to5mac.com&amp;utm_medium=referral&amp;utm_campaign=iPhone%20SE%20launch\" rel=\"attachment wp-att-425538\"><img title=\"Our favorite Speck cases for your new iPhone SE &amp; iPad Pro\" class=\"aligncenter size-full wp-image-425538\" src=\"https://9to5mac.files.wordpress.com/2016/03/ad_clear_pecan_728x90.jpg?w=1000\" alt=\"AD_Clear_Pecan_728x90\"></a></p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Sponsored Post", "url": "http://9to5mac.com/2016/04/04/speck-iphone-se-9-7-ipad-pro-cases/", "short_url": "http://rdd.me/w3e90kjl", "title": "Our favorite Speck cases for your new iPhone SE & iPad Pro", "excerpt": "Speck Products&#xA0;has unleashed a series of new, high-quality accessories for Apple&#x2019;s latest line of mobile devices. For the new 9.7-inch iPad Pro and 4-inch iPhone SE, Speck has created new&hellip;", "direction": "ltr", "word_count": 624, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/03/candyshell-grip-for-iphone-se.jpg?w=1000&h=415", "rendered_pages": 1, "date_published": "2016-04-04 14:00:58"}