{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>It&#x2019;s been a <a href=\"http://9to5mac.com/2014/10/22/ipad-air-2-teardown-shows-minor-internal-tweaks-15-smaller-7340-mah-battery/\" target=\"_blank\">year and a half</a> since iFixit tore into the flagship&#xA0;9.7-inch tablet from Apple, and now it&#x2019;s finally time to <a href=\"https://www.ifixit.com/Teardown/iPad+Pro+9.7-Inch+Teardown/60939\" target=\"_blank\">look inside the smaller iPad Pro</a> and see what it&#x2019;s really made of. What you&#x2019;ll find is your typical mix of components from Samsung,&#xA0;Bosch Sensortec,&#xA0;NXP Semiconductors, and others, plus a whole lot of battery. Cutting to the chase, iFixit rates the smaller iPad Pro&#x2019;s repairability at a low 2 out of 10, which is the same as the iPad Air 2 it replaces but one point below what it rated the 12.9-inch iPad Pro last year. Here&#x2019;s what&#x2019;s inside the 9.7-inch iPad Pro and why iFixit says it&#x2019;s not so repairable&#x2026;</p>\n\n<p>To start, while neither iPad Pro is easily fixable in most situations, iFixit gave the larger model a slightly higher repairability score because its battery features pull tabs which help when removing and replacing it; the smaller iPad Pro&#x2019;s battery lacks these pull tabs and can&#x2019;t be easily removed due to a ton of adhesive that keeps it in place almost like soldering.</p>\n<p>The 9.7-inch iPad Pro&#x2019;s battery is slightly smaller than the iPad Air 2&#x2019;s battery at 7,306 mAh versus 7,340 mAh, but note that battery life is rated at the same base line of 10 hours thanks in part to the usual gains in processor efficiency.</p>\n<p>Speaking of processors, iFixit details the guts of the smaller iPad Pro: <em>Apple APL1021 A9X 64-bit Processor,&#xA0;Samsung K3RG1G1 2 GB (16 Gb) LPDDR4 RAM,&#xA0;SK Hynix H23QEG8VG1ACA 32 GB (256 Gb) NAND Flash Memory, 2 &#xD7; Broadcom BCM15900B0 (as seen in the iPad Pro 12.9&#x2033;),&#xA0;Apple 339S00109 Wi-Fi Module,&#xA0;NXP 66V10 NFC Controller and 1610A3 Charging IC (as seen in iPhone SE/6s/6s Plus), and&#xA0;InvenSense EMS-A 6-axis Gyroscope and Accelerometer Combo (also found in iPhone SE).</em></p>\n<p><img title=\"9.7-inch iPad Pro teardown finds Samsung RAM, slightly smaller battery, and low repairability\" class=\"aligncenter wp-image-426051 size-large\" src=\"https://9to5mac.files.wordpress.com/2016/04/bwxddigysyxw6ysd-e1459778585192.jpeg?w=1000&amp;h=650\" alt=\"iFixit Teardown\" width=\"1000\"></p>\n<p>Note that iFixit sourced the larger iPad Pro&#x2019;s 4GB of RAM to&#xA0;SK Hynix versus the 2GB found here to Samsung.&#xA0;SK Hynix is back, though, supplying the 32GB flash storage compared to&#xA0;Toshiba supplying the 32GB flash storage on the larger iPad Pro. Apple advertises both iPad Pro models as featuring first-generation Touch ID, not the faster version found on the iPhone 6s and 6s Plus, and iFixit confirms that both iPads use the same&#xA0;NXP Semiconductors 8416A1 Touch ID Sensor.</p>\n<p>And the&#xA0;new iPad Pro has a Smart Connector for a new class of accessories just like the first iPad Pro, which iFixit describes as virtually irreplaceable but also unlikely to fail due to the lack of moving parts. In comparison to the 12.9-inch iPad Pro, iFixit describes the smaller version as being designed inside around the battery, whereas the big Pro noticeably accommodates the larger speakers which are packed into the smaller version. There&#x2019;s also the not one but two relocated ambient light sensors found in the smaller iPad Pro and not the larger version, and generally a lot less room to pack hardware into. All in all, no major surprises this year, but check out<a href=\"https://www.ifixit.com/Teardown/iPad+Pro+9.7-Inch+Teardown/60939\" target=\"_blank\"> iFixit&#x2019;s detailed teardown</a> to get a look for yourself and read <a href=\"http://9to5mac.com/2016/03/31/9-7-inch-ipad-pro-diary-day-one-first-impressions/\" target=\"_blank\">Ben Lovejoy&#x2019;s day one impressions </a>for more hands-on photos.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Zac Hall", "url": "http://9to5mac.com/2016/04/04/9-7-inch-ipad-pro-teardown-finds-samsung-ram-slightly-smaller-battery-and-low-repairability/", "short_url": "http://rdd.me/41anqmah", "title": "9.7-inch iPad Pro teardown finds Samsung RAM, slightly smaller battery, and low repairability", "excerpt": "It&#x2019;s been a year and a half since iFixit tore into the flagship&#xA0;9.7-inch tablet from Apple, and now it&#x2019;s finally time to look inside the smaller iPad Pro and see what it&#x2019;s&hellip;", "direction": "ltr", "word_count": 506, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": "https://9to5mac.files.wordpress.com/2016/04/bwxddigysyxw6ysd-e1459778585192.jpeg?w=1000&h=650", "rendered_pages": 1, "date_published": "2016-04-04 14:21:16"}