{"content": "<div><div class=\"post-body\">\n\t\t\t\t\t\t\n<p>Apple doesn&#x2019;t normally improve the capabilities of Siri outside of a&#xA0;major operating system&#xA0;update, but it has made an exception this time around for baseball. Apple has dramatically improved the&#xA0;knowledge base Siri can draw from for Siri, allowing the voice-activated personal assistant to answer&#xA0;a wider range of questions about the sport. <a href=\"http://www.theverge.com/2016/4/3/11355466/siri-can-now-answer-more-of-your-baseball-questions\">Via The Verge</a>, Siri now covers 28 leagues, not just Major League Baseball, too.</p>\n<p>Siri first started answering sports questions with iOS 6. Apple says that the&#xA0;upgrade to baseball, timed alongside the new MLB season, allows users to ask more detailed questions about career&#xA0;statistics and baseball history.</p>\n\n<p>The&#xA0;news comes&#xA0;days after the announcement that Apple and MLB have signed a deal for coaches to use <a href=\"http://amzn.to/1UssqRf\">12.9 inch iPad Pros</a> in the dugout during real games. The deal gives coaches and managers in the&#xA0;MLB iPad Pros to use, equipped with a custom app for statistics, but usage of the devices is not mandatory.</p>\n<p>The season has only just begun, so the impact of the Apple-MLB deal is yet to really be seen come to fruition. It&#x2019;s also worth noting that Siri&#x2019;s coverage of baseball questions is not perfect. Many queries still&#xA0;resulted in WolframAlpha results or fallback Google searches. The voice dictation also struggled to understand the names of many players.</p>\n<p>By the way,&#xA0;T-Mobile is <a href=\"http://9to5mac.com/2016/04/03/how-to-free-year-mlb-tv-premium-live/\">offering a free year of MLB Premium for customers</a>.</p>\n\n\t\t\t\t\t</div>\n\t\t\t\t</div>", "domain": "9to5mac.com", "author": "Benjamin Mayo", "url": "http://9to5mac.com/2016/04/04/apple-upgrades-siri-to-be-smarter-about-baseball-deeper-historical-knowledge-spanning-28-leagues/", "short_url": "http://rdd.me/6wwise15", "title": "Apple upgrades Siri to be smarter about baseball, deeper historical knowledge spanning 28 leagues", "excerpt": "Apple doesn&#x2019;t normally improve the capabilities of Siri outside of a&#xA0;major operating system&#xA0;update, but it has made an exception this time around for baseball. Apple has dramatically&hellip;", "direction": "ltr", "word_count": 220, "total_pages": 0, "next_page_id": null, "dek": null, "lead_image_url": null, "rendered_pages": 1, "date_published": "2016-04-04 09:09:32"}